/* automatically generated by rust-bindgen 0.60.1 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const RCUTILS_RET_OK: u32 = 0;
pub const RCUTILS_RET_WARN: u32 = 1;
pub const RCUTILS_RET_ERROR: u32 = 2;
pub const RCUTILS_RET_BAD_ALLOC: u32 = 10;
pub const RCUTILS_RET_INVALID_ARGUMENT: u32 = 11;
pub const RCUTILS_RET_NOT_ENOUGH_SPACE: u32 = 12;
pub const RCUTILS_RET_NOT_INITIALIZED: u32 = 13;
pub const RCUTILS_RET_NOT_FOUND: u32 = 14;
pub const RCUTILS_RET_STRING_MAP_ALREADY_INIT: u32 = 30;
pub const RCUTILS_RET_STRING_MAP_INVALID: u32 = 31;
pub const RCUTILS_RET_STRING_KEY_NOT_FOUND: u32 = 32;
pub const RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID: u32 = 40;
pub const RCUTILS_RET_LOGGING_SEVERITY_STRING_INVALID: u32 = 41;
pub const RCUTILS_RET_HASH_MAP_NO_MORE_ENTRIES: u32 = 50;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;

pub const RCL_RET_SUBSCRIPTION_TAKE_FAILED: u32 = 401;
pub const RCL_RET_CLIENT_INVALID: u32 = 500;
pub const RCL_RET_CLIENT_TAKE_FAILED: u32 = 501;
pub const RCL_RET_SERVICE_INVALID: u32 = 600;
pub const RCL_RET_SERVICE_TAKE_FAILED: u32 = 601;
pub const RCL_RET_TIMER_INVALID: u32 = 800;
pub const RCL_RET_TIMER_CANCELED: u32 = 801;
pub const RCL_RET_WAIT_SET_INVALID: u32 = 900;
pub const RCL_RET_WAIT_SET_EMPTY: u32 = 901;
pub const RCL_RET_WAIT_SET_FULL: u32 = 902;
pub const RCL_RET_INVALID_REMAP_RULE: u32 = 1001;
pub const RCL_RET_WRONG_LEXEME: u32 = 1002;
pub const RCL_RET_INVALID_ROS_ARGS: u32 = 1003;
pub const RCL_RET_INVALID_PARAM_RULE: u32 = 1010;
pub const RCL_RET_INVALID_LOG_LEVEL_RULE: u32 = 1020;
pub const RCL_RET_EVENT_INVALID: u32 = 2000;
pub const RCL_RET_EVENT_TAKE_FAILED: u32 = 2001;
pub const RCL_RET_LIFECYCLE_STATE_REGISTERED: u32 = 3000;
pub const RCL_RET_LIFECYCLE_STATE_NOT_REGISTERED: u32 = 3001;
pub const RCL_ROS_ARGS_FLAG: &[u8; 11usize] = b"--ros-args\0";
pub const RCL_ROS_ARGS_EXPLICIT_END_TOKEN: &[u8; 3usize] = b"--\0";
pub const RCL_PARAM_FLAG: &[u8; 8usize] = b"--param\0";
pub const RCL_SHORT_PARAM_FLAG: &[u8; 3usize] = b"-p\0";
pub const RCL_PARAM_FILE_FLAG: &[u8; 14usize] = b"--params-file\0";
pub const RCL_REMAP_FLAG: &[u8; 8usize] = b"--remap\0";
pub const RCL_SHORT_REMAP_FLAG: &[u8; 3usize] = b"-r\0";
pub const RCL_ENCLAVE_FLAG: &[u8; 10usize] = b"--enclave\0";
pub const RCL_SHORT_ENCLAVE_FLAG: &[u8; 3usize] = b"-e\0";
pub const RCL_LOG_LEVEL_FLAG: &[u8; 12usize] = b"--log-level\0";
pub const RCL_EXTERNAL_LOG_CONFIG_FLAG: &[u8; 18usize] = b"--log-config-file\0";
pub const RCL_LOG_STDOUT_FLAG_SUFFIX: &[u8; 12usize] = b"stdout-logs\0";
pub const RCL_LOG_ROSOUT_FLAG_SUFFIX: &[u8; 12usize] = b"rosout-logs\0";
pub const RCL_LOG_EXT_LIB_FLAG_SUFFIX: &[u8; 18usize] = b"external-lib-logs\0";
pub const __alignas_is_defined: u32 = 1;
pub const __alignof_is_defined: u32 = 1;
pub const RCL_DEFAULT_DOMAIN_ID: i32 = -1;
pub const RCL_NODE_OPTIONS_DEFAULT_DOMAIN_ID: i32 = -1;
pub const RCL_RET_ACTION_NAME_INVALID: u32 = 2000;
pub const RCL_RET_ACTION_GOAL_ACCEPTED: u32 = 2100;
pub const RCL_RET_ACTION_GOAL_REJECTED: u32 = 2101;
pub const RCL_RET_ACTION_CLIENT_INVALID: u32 = 2102;
pub const RCL_RET_ACTION_CLIENT_TAKE_FAILED: u32 = 2103;
pub const RCL_RET_ACTION_SERVER_INVALID: u32 = 2200;
pub const RCL_RET_ACTION_SERVER_TAKE_FAILED: u32 = 2201;
pub const RCL_RET_ACTION_GOAL_HANDLE_INVALID: u32 = 2300;
pub const RCL_RET_ACTION_GOAL_EVENT_INVALID: u32 = 2301;
pub const UUID_SIZE: u32 = 16;
pub const GOAL_STATE_NUM_STATES: u32 = 7;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    fn test_field___clang_max_align_nonce1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<max_align_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(max_align_t),
                "::",
                stringify!(__clang_max_align_nonce1)
            )
        );
    }
    test_field___clang_max_align_nonce1();
    fn test_field___clang_max_align_nonce2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<max_align_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(max_align_t),
                "::",
                stringify!(__clang_max_align_nonce2)
            )
        );
    }
    test_field___clang_max_align_nonce2();
}
#[doc = " The type that holds a return value for an rcutils operation."]
pub type rcutils_ret_t = ::std::os::raw::c_int;
#[doc = " Encapsulation of an allocator."]
#[doc = "* *"]
#[doc = "* The default allocator uses malloc(), free(), calloc(), and realloc()."]
#[doc = "* It can be obtained using rcutils_get_default_allocator()."]
#[doc = "* "]
#[doc = "* The allocator should be trivially copyable."]
#[doc = "* Meaning that the struct should continue to work after being assignment"]
#[doc = "* copied into a new struct."]
#[doc = "* Specifically the object pointed to by the state pointer should remain valid"]
#[doc = "* until all uses of the allocator have been made."]
#[doc = "* Particular care should be taken when giving an allocator to functions like"]
#[doc = "* rcutils_*_init() where it is stored within another object and used later."]
#[doc = "* Developers should note that, while the fields of a const-qualified allocator"]
#[doc = "* struct cannot be modified, the state of the allocator can be modified."]
#[doc = "* /"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_allocator_t {
    #[doc = " Allocate memory, given a size and the `state` pointer."]
    #[doc = "* * An error should be indicated by returning `NULL`. */"]
    pub allocate: ::std::option::Option<
        unsafe extern "C" fn(
            size: size_t,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Deallocate previously allocated memory, mimicking free()."]
    #[doc = "* * Also takes the `state` pointer. */"]
    pub deallocate: ::std::option::Option<
        unsafe extern "C" fn(
            pointer: *mut ::std::os::raw::c_void,
            state: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Reallocate if possible, otherwise it deallocates and allocates."]
    #[doc = "* *"]
    #[doc = "* Also takes the `state` pointer."]
    #[doc = "* "]
    #[doc = "* If unsupported then do deallocate and then allocate."]
    #[doc = "* This should behave as realloc() does, as opposed to posix's"]
    #[doc = "* [reallocf](https://linux.die.net/man/3/reallocf), i.e. the memory given"]
    #[doc = "* by pointer will not be free'd automatically if realloc() fails."]
    #[doc = "* For reallocf-like behavior use rcutils_reallocf()."]
    #[doc = "* This function must be able to take an input pointer of `NULL` and succeed."]
    #[doc = "* /"]
    pub reallocate: ::std::option::Option<
        unsafe extern "C" fn(
            pointer: *mut ::std::os::raw::c_void,
            size: size_t,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Allocate memory with all elements set to zero, given a number of elements and their size."]
    #[doc = "* * An error should be indicated by returning `NULL`. */"]
    pub zero_allocate: ::std::option::Option<
        unsafe extern "C" fn(
            number_of_elements: size_t,
            size_of_element: size_t,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Implementation defined state storage."]
    #[doc = "* *"]
    #[doc = "* This is passed as the final parameter to other allocator functions."]
    #[doc = "* Note that the contents of the state can be modified even in const-qualified"]
    #[doc = "* allocator objects."]
    #[doc = "* /"]
    pub state: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rcutils_allocator_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_allocator_t>(),
        40usize,
        concat!("Size of: ", stringify!(rcutils_allocator_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_allocator_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_allocator_t))
    );
    fn test_field_allocate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_allocator_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocate) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_allocator_t),
                "::",
                stringify!(allocate)
            )
        );
    }
    test_field_allocate();
    fn test_field_deallocate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_allocator_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deallocate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_allocator_t),
                "::",
                stringify!(deallocate)
            )
        );
    }
    test_field_deallocate();
    fn test_field_reallocate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_allocator_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reallocate) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_allocator_t),
                "::",
                stringify!(reallocate)
            )
        );
    }
    test_field_reallocate();
    fn test_field_zero_allocate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_allocator_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).zero_allocate) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_allocator_t),
                "::",
                stringify!(zero_allocate)
            )
        );
    }
    test_field_zero_allocate();
    fn test_field_state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_allocator_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_allocator_t),
                "::",
                stringify!(state)
            )
        );
    }
    test_field_state();
}
extern "C" {
    #[doc = " Return a zero initialized allocator."]
    #[doc = "* *"]
    #[doc = "* Note that this is an invalid allocator and should only be used as a placeholder."]
    #[doc = "* /"]
    pub fn rcutils_get_zero_initialized_allocator() -> rcutils_allocator_t;
}
extern "C" {
    #[doc = " Return a properly initialized rcutils_allocator_t with default values."]
    #[doc = "* *"]
    #[doc = "* This defaults to:"]
    #[doc = "* "]
    #[doc = "* - allocate = wraps malloc()"]
    #[doc = "* - deallocate = wraps free()"]
    #[doc = "* - reallocate = wraps realloc()"]
    #[doc = "* - zero_allocate = wraps calloc()"]
    #[doc = "* - state = `NULL`"]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | Yes"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* /"]
    pub fn rcutils_get_default_allocator() -> rcutils_allocator_t;
}
extern "C" {
    #[doc = " Return true if the given allocator has non-null function pointers."]
    #[doc = "* *"]
    #[doc = "* \\param[in] allocator to be checked by the function"]
    #[doc = "* \\return `true` if the allocator is valid, `false` otherwise."]
    #[doc = "* /"]
    pub fn rcutils_allocator_is_valid(allocator: *const rcutils_allocator_t) -> bool;
}
extern "C" {
    #[doc = " Emulate the behavior of [reallocf](https://linux.die.net/man/3/reallocf)."]
    #[doc = "* *"]
    #[doc = "* This function will return `NULL` if the allocator is `NULL` or has `NULL` for"]
    #[doc = "* function pointer fields."]
    #[doc = "* \\param[inout] pointer to the memory which will be reallocated"]
    #[doc = "* \\param[in] size in bytes"]
    #[doc = "* \\param[in] allocator to be used to allocate and deallocate memory"]
    #[doc = "* /"]
    pub fn rcutils_reallocf(
        pointer: *mut ::std::os::raw::c_void,
        size: size_t,
        allocator: *mut rcutils_allocator_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Encapsulation of an allocator."]
#[doc = "* *"]
#[doc = "* The default allocator uses malloc(), free(), calloc(), and realloc()."]
#[doc = "* It can be obtained using rcutils_get_default_allocator()."]
#[doc = "* "]
#[doc = "* The allocator should be trivially copyable."]
#[doc = "* Meaning that the struct should continue to work after being assignment"]
#[doc = "* copied into a new struct."]
#[doc = "* Specifically the object pointed to by the state pointer should remain valid"]
#[doc = "* until all uses of the allocator have been made."]
#[doc = "* Particular care should be taken when giving an allocator to functions like"]
#[doc = "* rcutils_*_init() where it is stored within another object and used later."]
#[doc = "* Developers should note that, while the fields of a const-qualified allocator"]
#[doc = "* struct cannot be modified, the state of the allocator can be modified."]
#[doc = "* /"]
pub type rcl_allocator_t = rcutils_allocator_t;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    fn test_field___val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__fsid_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__fsid_t),
                "::",
                stringify!(__val)
            )
        );
    }
    test_field___val();
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[doc = " Uses ROS_LOCALHOST_ONLY environment variable."]
pub const rmw_localhost_only_t_RMW_LOCALHOST_ONLY_DEFAULT: rmw_localhost_only_t = 0;
#[doc = " Forces using only localhost."]
pub const rmw_localhost_only_t_RMW_LOCALHOST_ONLY_ENABLED: rmw_localhost_only_t = 1;
#[doc = " Forces disabling localhost only."]
pub const rmw_localhost_only_t_RMW_LOCALHOST_ONLY_DISABLED: rmw_localhost_only_t = 2;
#[doc = " Used to specify if the context can only communicate through localhost."]
pub type rmw_localhost_only_t = ::std::os::raw::c_uint;
#[doc = " Return code for rmw functions"]
pub type rmw_ret_t = i32;
pub const rmw_security_enforcement_policy_t_RMW_SECURITY_ENFORCEMENT_PERMISSIVE:
    rmw_security_enforcement_policy_t = 0;
pub const rmw_security_enforcement_policy_t_RMW_SECURITY_ENFORCEMENT_ENFORCE:
    rmw_security_enforcement_policy_t = 1;
pub type rmw_security_enforcement_policy_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_security_options_t {
    pub enforce_security: rmw_security_enforcement_policy_t,
    pub security_root_path: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_rmw_security_options_t() {
    assert_eq!(
        ::std::mem::size_of::<rmw_security_options_t>(),
        16usize,
        concat!("Size of: ", stringify!(rmw_security_options_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_security_options_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_security_options_t))
    );
    fn test_field_enforce_security() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_security_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enforce_security) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_security_options_t),
                "::",
                stringify!(enforce_security)
            )
        );
    }
    test_field_enforce_security();
    fn test_field_security_root_path() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_security_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).security_root_path) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_security_options_t),
                "::",
                stringify!(security_root_path)
            )
        );
    }
    test_field_security_root_path();
}
extern "C" {
    #[doc = " Get zero initialized security options."]
    pub fn rmw_get_zero_initialized_security_options() -> rmw_security_options_t;
}
extern "C" {
    #[doc = " Get default initialized security options."]
    pub fn rmw_get_default_security_options() -> rmw_security_options_t;
}
extern "C" {
    #[doc = " Copy the given security options."]
    #[doc = "* *"]
    #[doc = "* \\param[in] src security options to be copied."]
    #[doc = "* \\param[in] allocator allocator used when copying data to the new security options."]
    #[doc = "* \\param[out] dst security options to be set."]
    #[doc = "* \\returns RMW_RET_BAD_ALLOC, or"]
    #[doc = "* \\returns RMW_RET_OK"]
    #[doc = "* /"]
    pub fn rmw_security_options_copy(
        src: *const rmw_security_options_t,
        allocator: *const rcutils_allocator_t,
        dst: *mut rmw_security_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Set the security root path for the given security options."]
    #[doc = "* *"]
    #[doc = "* The provided `security_root_path` will be copied into allocated memory."]
    #[doc = "* "]
    #[doc = "* \\param[in] security_root_path path to be set."]
    #[doc = "* \\param[in] allocator allocator used to allocate the new path."]
    #[doc = "* \\param[in|out] security_options security options to be set."]
    #[doc = "* \\returns RMW_RET_BAD_ALLOC, or"]
    #[doc = "* \\returns RMW_RET_OK"]
    #[doc = "* /"]
    pub fn rmw_security_options_set_root_path(
        security_root_path: *const ::std::os::raw::c_char,
        allocator: *const rcutils_allocator_t,
        security_options: *mut rmw_security_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Finalize the given security_options."]
    #[doc = "* *"]
    #[doc = "* \\param[in] security_options security options to be finalized."]
    #[doc = "* \\param[in] allocator allocator used to deallocate the root path."]
    #[doc = "* \\returns RMW_RET_ERROR, or"]
    #[doc = "* \\returns RMW_RET_OK"]
    #[doc = "* /"]
    pub fn rmw_security_options_fini(
        security_options: *mut rmw_security_options_t,
        allocator: *const rcutils_allocator_t,
    ) -> rmw_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_init_options_impl_t {
    _unused: [u8; 0],
}
#[doc = " Options structure used during rmw_init()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_init_options_t {
    #[doc = " Locally (process local) unique ID that represents this init/shutdown cycle."]
    #[doc = "* *"]
    #[doc = "* This should be set by the caller of `rmw_init()` to a number that is"]
    #[doc = "* unique within this process."]
    #[doc = "* It is designed to be used with `rcl_init()` and `rcl_get_instance_id()`."]
    #[doc = "* /"]
    pub instance_id: u64,
    #[doc = " Implementation identifier, used to ensure two different implementations are not being mixed."]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " ROS domain id"]
    pub domain_id: size_t,
    #[doc = " Security options"]
    pub security_options: rmw_security_options_t,
    #[doc = " Enable localhost only"]
    pub localhost_only: rmw_localhost_only_t,
    #[doc = " Enclave, name used to find security artifacts in a sros2 keystore."]
    pub enclave: *mut ::std::os::raw::c_char,
    #[doc = " Allocator used during internal allocation of init options, if needed."]
    pub allocator: rcutils_allocator_t,
    #[doc = " Implementation defined init options."]
    #[doc = "* * May be NULL if there are no implementation defined options. */"]
    pub impl_: *mut rmw_init_options_impl_t,
}
#[test]
fn bindgen_test_layout_rmw_init_options_t() {
    assert_eq!(
        ::std::mem::size_of::<rmw_init_options_t>(),
        104usize,
        concat!("Size of: ", stringify!(rmw_init_options_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_init_options_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_init_options_t))
    );
    fn test_field_instance_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_init_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).instance_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_init_options_t),
                "::",
                stringify!(instance_id)
            )
        );
    }
    test_field_instance_id();
    fn test_field_implementation_identifier() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_init_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_init_options_t),
                "::",
                stringify!(implementation_identifier)
            )
        );
    }
    test_field_implementation_identifier();
    fn test_field_domain_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_init_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).domain_id) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_init_options_t),
                "::",
                stringify!(domain_id)
            )
        );
    }
    test_field_domain_id();
    fn test_field_security_options() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_init_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).security_options) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_init_options_t),
                "::",
                stringify!(security_options)
            )
        );
    }
    test_field_security_options();
    fn test_field_localhost_only() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_init_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).localhost_only) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_init_options_t),
                "::",
                stringify!(localhost_only)
            )
        );
    }
    test_field_localhost_only();
    fn test_field_enclave() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_init_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enclave) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_init_options_t),
                "::",
                stringify!(enclave)
            )
        );
    }
    test_field_enclave();
    fn test_field_allocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_init_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_init_options_t),
                "::",
                stringify!(allocator)
            )
        );
    }
    test_field_allocator();
    fn test_field_impl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_init_options_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_init_options_t),
                "::",
                stringify!(impl_)
            )
        );
    }
    test_field_impl();
}
extern "C" {
    #[doc = " Return a zero initialized init options structure."]
    pub fn rmw_get_zero_initialized_init_options() -> rmw_init_options_t;
}
extern "C" {
    #[doc = " Initialize given init options with the default values and implementation specific values."]
    #[doc = "* *"]
    #[doc = "* The given allocator is used, if required, during setup of the init options,"]
    #[doc = "* but is also used during initialization."]
    #[doc = "* "]
    #[doc = "* In either case the given allocator is stored in the returned init options."]
    #[doc = "* "]
    #[doc = "* The `impl` pointer should not be changed manually."]
    #[doc = "* "]
    #[doc = "* \\pre The given init options must be zero initialized."]
    #[doc = "* "]
    #[doc = "* \\post If initialization fails, init options will remain zero initialized."]
    #[doc = "* "]
    #[doc = "* \\remark Giving an already initialized init options will result"]
    #[doc = "* in a failure with return code `RMW_RET_INVALID_ARGUMENT`."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | Yes"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* This should be defined by the rmw implementation."]
    #[doc = "* "]
    #[doc = "* \\param[inout] init_options object to be setup"]
    #[doc = "* \\param[in] allocator to be used during setup and during initialization"]
    #[doc = "* \\return `RMW_RET_OK` if setup is successful, or"]
    #[doc = "* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or"]
    #[doc = "* \\return `RMW_RET_BAD_ALLOC` if allocating memory failed, or"]
    #[doc = "* \\return `RMW_RET_ERROR` if an unspecified error occurs."]
    #[doc = "* /"]
    pub fn rmw_init_options_init(
        init_options: *mut rmw_init_options_t,
        allocator: rcutils_allocator_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Copy the given source init options to the destination init options."]
    #[doc = "* *"]
    #[doc = "* The allocator from the source is used for any allocations and stored in the"]
    #[doc = "* destination."]
    #[doc = "* "]
    #[doc = "* \\pre The source init options must have been initialized"]
    #[doc = "* i.e. had `rmw_init_options_init()` called on."]
    #[doc = "* \\pre The destination init options must be zero initialized."]
    #[doc = "* "]
    #[doc = "* \\post If copy fails, destination init options will remain zero initialized."]
    #[doc = "* "]
    #[doc = "* \\remark Giving an zero initialized init options as a source will result"]
    #[doc = "* in a failure with return code `RMW_RET_INVALID_ARGUMENT`."]
    #[doc = "* \\remark Giving an already initialized init options for the destination will result"]
    #[doc = "* in a failure with return code `RMW_RET_INVALID_ARGUMENT`."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | Yes"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* This should be defined by the rmw implementation."]
    #[doc = "* "]
    #[doc = "* \\param[in] src rcl_init_options_t object to be copied from"]
    #[doc = "* \\param[out] dst rcl_init_options_t object to be copied into"]
    #[doc = "* \\return `RMW_RET_OK` if the copy is successful, or"]
    #[doc = "* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation"]
    #[doc = "* identifier for src does not match the implementation of this function, or"]
    #[doc = "* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or"]
    #[doc = "* \\return `RMW_RET_BAD_ALLOC` if allocating memory failed, or"]
    #[doc = "* \\return `RMW_RET_ERROR` if an unspecified error occurs."]
    #[doc = "* /"]
    pub fn rmw_init_options_copy(
        src: *const rmw_init_options_t,
        dst: *mut rmw_init_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Finalize the given init options."]
    #[doc = "* *"]
    #[doc = "* This function will return early if a logical error, such as `RMW_RET_INVALID_ARGUMENT`"]
    #[doc = "* or `RMW_RET_INCORRECT_RMW_IMPLEMENTATION`, ensues, leaving the given init options"]
    #[doc = "* unchanged."]
    #[doc = "* Otherwise, it will proceed despite errors, freeing as much resources as it can and zero"]
    #[doc = "* initializing the given init options."]
    #[doc = "* "]
    #[doc = "* \\pre The given init options must have been initialized"]
    #[doc = "* i.e. had `rmw_init_options_init()` called on."]
    #[doc = "* "]
    #[doc = "* \\remarks If init options are zero initialized,"]
    #[doc = "* then `RMW_RET_INVALID_ARGUMENT` is returned."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | Yes"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* This should be defined by the rmw implementation."]
    #[doc = "* "]
    #[doc = "* \\param[inout] init_options object to finalized"]
    #[doc = "* \\return `RMW_RET_OK` if finalization is successful, or"]
    #[doc = "* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or"]
    #[doc = "* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation"]
    #[doc = "* identifier does not match the implementation of this function, or"]
    #[doc = "* \\return `RMW_RET_ERROR` if an unspecified error occurs."]
    #[doc = "* /"]
    pub fn rmw_init_options_fini(init_options: *mut rmw_init_options_t) -> rmw_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_context_impl_t {
    _unused: [u8; 0],
}
#[doc = " Initialization context structure which is used to store init specific information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_context_t {
    #[doc = " Locally (process local) unique ID that represents this init/shutdown cycle."]
    pub instance_id: u64,
    #[doc = " Implementation identifier, used to ensure two different implementations are not being mixed."]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Options used to initialize the context."]
    pub options: rmw_init_options_t,
    #[doc = " Domain id that is being used."]
    pub actual_domain_id: size_t,
    #[doc = " Implementation defined context information."]
    #[doc = "* * May be NULL if there is no implementation defined context information. */"]
    pub impl_: *mut rmw_context_impl_t,
}
#[test]
fn bindgen_test_layout_rmw_context_t() {
    assert_eq!(
        ::std::mem::size_of::<rmw_context_t>(),
        136usize,
        concat!("Size of: ", stringify!(rmw_context_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_context_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_context_t))
    );
    fn test_field_instance_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).instance_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_context_t),
                "::",
                stringify!(instance_id)
            )
        );
    }
    test_field_instance_id();
    fn test_field_implementation_identifier() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_context_t),
                "::",
                stringify!(implementation_identifier)
            )
        );
    }
    test_field_implementation_identifier();
    fn test_field_options() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_context_t),
                "::",
                stringify!(options)
            )
        );
    }
    test_field_options();
    fn test_field_actual_domain_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).actual_domain_id) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_context_t),
                "::",
                stringify!(actual_domain_id)
            )
        );
    }
    test_field_actual_domain_id();
    fn test_field_impl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rmw_context_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(rmw_context_t),
                "::",
                stringify!(impl_)
            )
        );
    }
    test_field_impl();
}
extern "C" {
    #[doc = " Return a zero initialized context structure."]
    pub fn rmw_get_zero_initialized_context() -> rmw_context_t;
}
extern "C" {
    #[doc = " Initialize the middleware with the given options, and yielding an context."]
    #[doc = "* *"]
    #[doc = "* Context is filled with middleware specific data upon success of this function."]
    #[doc = "* The context is used when initializing some entities like nodes and"]
    #[doc = "* guard conditions, and is also required to properly call `rmw_shutdown()`."]
    #[doc = "* "]
    #[doc = "* \\pre The given options must have been initialized"]
    #[doc = "* i.e. `rmw_init_options_init()` called on it and"]
    #[doc = "* an enclave set."]
    #[doc = "* \\pre The given context must be zero initialized."]
    #[doc = "* "]
    #[doc = "* \\post If initialization fails, context will remain zero initialized."]
    #[doc = "* \\post `context->actual_domain_id` will be set with the domain id the rmw implementation is using."]
    #[doc = "* This matches `options->domain_id` if it is not RMW_DEFAULT_DOMAIN_ID."]
    #[doc = "* In other case, the value is rmw implementation dependent."]
    #[doc = "* "]
    #[doc = "* \\remarks If options are zero-initialized, then `RMW_RET_INVALID_ARGUMENT` is returned."]
    #[doc = "* If options are initialized but no enclave is provided, then `RMW_RET_INVALID_ARGUMENT`"]
    #[doc = "* is returned."]
    #[doc = "* If context has been already initialized (`rmw_init()` was called on it), then"]
    #[doc = "* `RMW_RET_INVALID_ARGUMENT` is returned."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* This should be defined by the rmw implementation."]
    #[doc = "* "]
    #[doc = "* \\param[in] options initialization options to be used during initialization"]
    #[doc = "* \\param[out] context resulting context struct"]
    #[doc = "* \\return `RMW_RET_OK` if successful, or"]
    #[doc = "* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or"]
    #[doc = "* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation"]
    #[doc = "* identifier does not match, or"]
    #[doc = "* \\return `RMW_RET_ERROR` if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rmw_init(options: *const rmw_init_options_t, context: *mut rmw_context_t) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Shutdown the middleware for a given context."]
    #[doc = "* *"]
    #[doc = "* \\pre The given context must be a valid context which has been initialized with `rmw_init()`."]
    #[doc = "* "]
    #[doc = "* \\remarks If context is zero initialized, then `RMW_RET_INVALID_ARGUMENT` is returned."]
    #[doc = "* If context has been already invalidated (`rmw_shutdown()` was called on it), then"]
    #[doc = "* this function is a no-op and `RMW_RET_OK` is returned."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* This should be defined by the rmw implementation."]
    #[doc = "* "]
    #[doc = "* \\param[in] context resulting context struct"]
    #[doc = "* \\return `RMW_RET_OK` if successful, or"]
    #[doc = "* \\return `RMW_RET_INVALID_ARGUMENT` if any argument are invalid, or"]
    #[doc = "* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation"]
    #[doc = "* identifier does not match, or"]
    #[doc = "* \\return `RMW_RET_ERROR` if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rmw_shutdown(context: *mut rmw_context_t) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Finalize a context."]
    #[doc = "* *"]
    #[doc = "* This function will return early if a logical error, such as `RMW_RET_INVALID_ARGUMENT`"]
    #[doc = "* or `RMW_RET_INCORRECT_RMW_IMPLEMENTATION`, ensues, leaving the given context unchanged."]
    #[doc = "* Otherwise, it will proceed despite errors, freeing as much resources as it can and zero"]
    #[doc = "* initializing the given context."]
    #[doc = "* "]
    #[doc = "* \\pre The context to be finalized must have been previously initialized with"]
    #[doc = "* `rmw_init()`, and then later invalidated with `rmw_shutdown()`."]
    #[doc = "* "]
    #[doc = "* \\remarks If context is zero initialized, then `RMW_RET_INVALID_ARGUMENT` is returned."]
    #[doc = "* If context is initialized and valid (`rmw_shutdown()` was not called on it), then"]
    #[doc = "* `RMW_RET_INVALID_ARGUMENT` is returned."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | Yes"]
    #[doc = "* Lock-Free          | Yes [1]"]
    #[doc = "* <i>[1] if `atomic_is_lock_free()` returns true for `atomic_uint_least64_t`</i>"]
    #[doc = "* "]
    #[doc = "* This should be defined by the rmw implementation."]
    #[doc = "* "]
    #[doc = "* \\return `RMW_RET_OK` if successful, or"]
    #[doc = "* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or"]
    #[doc = "* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation"]
    #[doc = "* identifier does not match, or"]
    #[doc = "* \\return `RMW_RET_ERROR` if an unspecified error occur."]
    #[doc = "* /"]
    pub fn rmw_context_fini(context: *mut rmw_context_t) -> rmw_ret_t;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    fn test_field___wch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t__bindgen_ty_1),
                "::",
                stringify!(__wch)
            )
        );
    }
    test_field___wch();
    fn test_field___wchb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t__bindgen_ty_1),
                "::",
                stringify!(__wchb)
            )
        );
    }
    test_field___wchb();
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    fn test_field___count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__count)
            )
        );
    }
    test_field___count();
    fn test_field___value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__value)
            )
        );
    }
    test_field___value();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    fn test_field___pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_G_fpos_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos_t),
                "::",
                stringify!(__pos)
            )
        );
    }
    test_field___pos();
    fn test_field___state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_G_fpos_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos_t),
                "::",
                stringify!(__state)
            )
        );
    }
    test_field___state();
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    fn test_field___pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_G_fpos64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos64_t),
                "::",
                stringify!(__pos)
            )
        );
    }
    test_field___pos();
    fn test_field___state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_G_fpos64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos64_t),
                "::",
                stringify!(__state)
            )
        );
    }
    test_field___state();
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    fn test_field__flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags)
            )
        );
    }
    test_field__flags();
    fn test_field__IO_read_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_ptr)
            )
        );
    }
    test_field__IO_read_ptr();
    fn test_field__IO_read_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_end)
            )
        );
    }
    test_field__IO_read_end();
    fn test_field__IO_read_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_base)
            )
        );
    }
    test_field__IO_read_base();
    fn test_field__IO_write_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_base)
            )
        );
    }
    test_field__IO_write_base();
    fn test_field__IO_write_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_ptr)
            )
        );
    }
    test_field__IO_write_ptr();
    fn test_field__IO_write_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_end)
            )
        );
    }
    test_field__IO_write_end();
    fn test_field__IO_buf_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_base)
            )
        );
    }
    test_field__IO_buf_base();
    fn test_field__IO_buf_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_end)
            )
        );
    }
    test_field__IO_buf_end();
    fn test_field__IO_save_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_base)
            )
        );
    }
    test_field__IO_save_base();
    fn test_field__IO_backup_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_backup_base)
            )
        );
    }
    test_field__IO_backup_base();
    fn test_field__IO_save_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_end)
            )
        );
    }
    test_field__IO_save_end();
    fn test_field__markers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_markers)
            )
        );
    }
    test_field__markers();
    fn test_field__chain() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_chain)
            )
        );
    }
    test_field__chain();
    fn test_field__fileno() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_fileno)
            )
        );
    }
    test_field__fileno();
    fn test_field__flags2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags2)
            )
        );
    }
    test_field__flags2();
    fn test_field__old_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_old_offset)
            )
        );
    }
    test_field__old_offset();
    fn test_field__cur_column() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_cur_column)
            )
        );
    }
    test_field__cur_column();
    fn test_field__vtable_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize
            },
            130usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_vtable_offset)
            )
        );
    }
    test_field__vtable_offset();
    fn test_field__shortbuf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize
            },
            131usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_shortbuf)
            )
        );
    }
    test_field__shortbuf();
    fn test_field__lock() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_lock)
            )
        );
    }
    test_field__lock();
    fn test_field__offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_offset)
            )
        );
    }
    test_field__offset();
    fn test_field__codecvt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_codecvt)
            )
        );
    }
    test_field__codecvt();
    fn test_field__wide_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_wide_data)
            )
        );
    }
    test_field__wide_data();
    fn test_field__freeres_list() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_list)
            )
        );
    }
    test_field__freeres_list();
    fn test_field__freeres_buf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_buf)
            )
        );
    }
    test_field__freeres_buf();
    fn test_field___pad5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(__pad5)
            )
        );
    }
    test_field___pad5();
    fn test_field__mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_mode)
            )
        );
    }
    test_field__mode();
    fn test_field__unused2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize
            },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_unused2)
            )
        );
    }
    test_field__unused2();
}
pub type off_t = __off_t;
pub type ssize_t = __ssize_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: size_t,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __assert_fail(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn __assert_perror_fail(
        __errnum: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn __assert(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_int,
    );
}
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub type idtype_t = ::std::os::raw::c_uint;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<div_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(div_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<div_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(div_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ldiv_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ldiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<lldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(lldiv_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<lldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(lldiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    fn test_field___val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sigset_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sigset_t),
                "::",
                stringify!(__val)
            )
        );
    }
    test_field___val();
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    fn test_field_tv_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timeval>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(timeval),
                "::",
                stringify!(tv_sec)
            )
        );
    }
    test_field_tv_sec();
    fn test_field_tv_usec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timeval>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(timeval),
                "::",
                stringify!(tv_usec)
            )
        );
    }
    test_field_tv_usec();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    fn test_field_tv_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timespec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(timespec),
                "::",
                stringify!(tv_sec)
            )
        );
    }
    test_field_tv_sec();
    fn test_field_tv_nsec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timespec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(timespec),
                "::",
                stringify!(tv_nsec)
            )
        );
    }
    test_field_tv_nsec();
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    fn test_field___fds_bits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<fd_set>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(fd_set),
                "::",
                stringify!(__fds_bits)
            )
        );
    }
    test_field___fds_bits();
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    fn test_field___prev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_list),
                "::",
                stringify!(__prev)
            )
        );
    }
    test_field___prev();
    fn test_field___next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_list),
                "::",
                stringify!(__next)
            )
        );
    }
    test_field___next();
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    fn test_field___next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_slist>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_slist),
                "::",
                stringify!(__next)
            )
        );
    }
    test_field___next();
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    fn test_field___lock() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__lock)
            )
        );
    }
    test_field___lock();
    fn test_field___count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__count)
            )
        );
    }
    test_field___count();
    fn test_field___owner() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__owner)
            )
        );
    }
    test_field___owner();
    fn test_field___nusers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__nusers)
            )
        );
    }
    test_field___nusers();
    fn test_field___kind() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__kind)
            )
        );
    }
    test_field___kind();
    fn test_field___spins() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__spins)
            )
        );
    }
    test_field___spins();
    fn test_field___elision() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__elision)
            )
        );
    }
    test_field___elision();
    fn test_field___list() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__list)
            )
        );
    }
    test_field___list();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    fn test_field___readers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__readers)
            )
        );
    }
    test_field___readers();
    fn test_field___writers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__writers)
            )
        );
    }
    test_field___writers();
    fn test_field___wrphase_futex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__wrphase_futex)
            )
        );
    }
    test_field___wrphase_futex();
    fn test_field___writers_futex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__writers_futex)
            )
        );
    }
    test_field___writers_futex();
    fn test_field___pad3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad3)
            )
        );
    }
    test_field___pad3();
    fn test_field___pad4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad4)
            )
        );
    }
    test_field___pad4();
    fn test_field___cur_writer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__cur_writer)
            )
        );
    }
    test_field___cur_writer();
    fn test_field___shared() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__shared)
            )
        );
    }
    test_field___shared();
    fn test_field___rwelision() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__rwelision)
            )
        );
    }
    test_field___rwelision();
    fn test_field___pad1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize
            },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad1)
            )
        );
    }
    test_field___pad1();
    fn test_field___pad2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad2)
            )
        );
    }
    test_field___pad2();
    fn test_field___flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__flags)
            )
        );
    }
    test_field___flags();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field___low() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(__low)
            )
        );
    }
    test_field___low();
    fn test_field___high() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(__high)
            )
        );
    }
    test_field___high();
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    fn test_field___wseq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_1),
                "::",
                stringify!(__wseq)
            )
        );
    }
    test_field___wseq();
    fn test_field___wseq32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wseq32) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_1),
                "::",
                stringify!(__wseq32)
            )
        );
    }
    test_field___wseq32();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    fn test_field___low() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
                "::",
                stringify!(__low)
            )
        );
    }
    test_field___low();
    fn test_field___high() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
                "::",
                stringify!(__high)
            )
        );
    }
    test_field___high();
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    fn test_field___g1_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_2),
                "::",
                stringify!(__g1_start)
            )
        );
    }
    test_field___g1_start();
    fn test_field___g1_start32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g1_start32) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s__bindgen_ty_2),
                "::",
                stringify!(__g1_start32)
            )
        );
    }
    test_field___g1_start32();
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    fn test_field___g_refs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_refs)
            )
        );
    }
    test_field___g_refs();
    fn test_field___g_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_size)
            )
        );
    }
    test_field___g_size();
    fn test_field___g1_orig_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g1_orig_size)
            )
        );
    }
    test_field___g1_orig_size();
    fn test_field___wrefs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__wrefs)
            )
        );
    }
    test_field___wrefs();
    fn test_field___g_signals() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_signals)
            )
        );
    }
    test_field___g_signals();
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutexattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutexattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutexattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutexattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_condattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_condattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_condattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_condattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_attr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_attr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_attr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_attr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlockattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlockattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlockattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlockattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrier_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrier_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrier_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrier_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrierattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrierattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrierattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrierattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    fn test_field_fptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(fptr)
            )
        );
    }
    test_field_fptr();
    fn test_field_rptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rptr)
            )
        );
    }
    test_field_rptr();
    fn test_field_state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(state)
            )
        );
    }
    test_field_state();
    fn test_field_rand_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_type)
            )
        );
    }
    test_field_rand_type();
    fn test_field_rand_deg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_deg)
            )
        );
    }
    test_field_rand_deg();
    fn test_field_rand_sep() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_sep)
            )
        );
    }
    test_field_rand_sep();
    fn test_field_end_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(end_ptr)
            )
        );
    }
    test_field_end_ptr();
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    fn test_field___x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__x)
            )
        );
    }
    test_field___x();
    fn test_field___old_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__old_x)
            )
        );
    }
    test_field___old_x();
    fn test_field___c() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__c) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__c)
            )
        );
    }
    test_field___c();
    fn test_field___init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__init) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__init)
            )
        );
    }
    test_field___init();
    fn test_field___a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__a) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__a)
            )
        );
    }
    test_field___a();
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(
        __pwcs: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcstombs(
        __s: *mut ::std::os::raw::c_char,
        __pwcs: *const wchar_t,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    fn test_field___locales() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__locales)
            )
        );
    }
    test_field___locales();
    fn test_field___ctype_b() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__ctype_b)
            )
        );
    }
    test_field___ctype_b();
    fn test_field___ctype_tolower() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__ctype_tolower)
            )
        );
    }
    test_field___ctype_tolower();
    fn test_field___ctype_toupper() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__ctype_toupper)
            )
        );
    }
    test_field___ctype_toupper();
    fn test_field___names() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__locale_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(__locale_struct),
                "::",
                stringify!(__names)
            )
        );
    }
    test_field___names();
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
        __l: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: size_t,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: size_t,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: size_t);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Format a string."]
    #[doc = "* *"]
    #[doc = "* This function just wraps snprintf() as defined in C11 in a portable way."]
    #[doc = "* "]
    #[doc = "* On Windows this defaults to the _TRUNCATE behavior of _snprintf_s(), but"]
    #[doc = "* only returns -1 if errno is not 0."]
    #[doc = "* Unlike _snprintf_s() which returns -1 when truncation occurs, this function"]
    #[doc = "* behaves like snprintf() (http://en.cppreference.com/w/cpp/io/c/fprintf):"]
    #[doc = "* "]
    #[doc = "* > Number of characters written if successful or negative value if an error"]
    #[doc = "* > occurred."]
    #[doc = "* > If the resulting string gets truncated due to buf_size limit, function"]
    #[doc = "* > returns the total number of characters (not including the terminating"]
    #[doc = "* > null-byte) which would have been written, if the limit was not imposed."]
    #[doc = "* "]
    #[doc = "* If `NULL` and `0` are given for buffer and buffer_size respectively, the"]
    #[doc = "* size of the string that would be generated is returned."]
    #[doc = "* Either snprintf() or _vscprintf() is used to calculate this value."]
    #[doc = "* "]
    #[doc = "* \\see snprintf()"]
    #[doc = "* \\see _snprintf_s()"]
    #[doc = "* \\return the number of bytes that would have been written given enough space, or"]
    #[doc = "* \\return a negative number if there is an error, but unlike _snprintf_s(),"]
    #[doc = "* -1 is not returned if there is truncation."]
    #[doc = "* /"]
    pub fn rcutils_snprintf(
        buffer: *mut ::std::os::raw::c_char,
        buffer_size: size_t,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Format a string with va_list for arguments, see rcutils_snprintf()."]
    pub fn rcutils_vsnprintf(
        buffer: *mut ::std::os::raw::c_char,
        buffer_size: size_t,
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rcutils_fault_injection_is_test_complete() -> bool;
}
extern "C" {
    #[doc = " \\brief Atomically set the fault injection counter."]
    #[doc = ""]
    #[doc = " This is typically not the preferred method of interacting directly with the fault injection"]
    #[doc = " logic, instead use `RCUTILS_FAULT_INJECTION_TEST` instead."]
    #[doc = ""]
    #[doc = " This function may also be used for pausing code inside of a `RCUTILS_FAULT_INJECTION_TEST` with"]
    #[doc = " something like the following:"]
    #[doc = ""]
    #[doc = " RCUTILS_FAULT_INJECTION_TEST({"]
    #[doc = "     ...  // code to run with fault injection"]
    #[doc = "     int64_t count = rcutils_fault_injection_get_count();"]
    #[doc = "     rcutils_fault_injection_set_count(RCUTILS_FAULT_INJECTION_NEVER_FAIL);"]
    #[doc = "     ...  // code to run without fault injection"]
    #[doc = "     rcutils_fault_injection_set_count(count);"]
    #[doc = "     ...  // code to run with fault injection"]
    #[doc = " });"]
    #[doc = ""]
    #[doc = " \\param count The count to set the fault injection counter to. If count is negative, then fault"]
    #[doc = " injection errors will be disabled. The counter is globally initialized to"]
    #[doc = " RCUTILS_FAULT_INJECTION_NEVER_FAIL."]
    pub fn rcutils_fault_injection_set_count(count: int_least64_t);
}
extern "C" {
    #[doc = " \\brief Atomically get the fault injection counter value"]
    #[doc = ""]
    #[doc = " This function is typically not used directly but instead indirectly inside an"]
    #[doc = " `RCUTILS_FAULT_INJECTION_TEST`"]
    pub fn rcutils_fault_injection_get_count() -> int_least64_t;
}
extern "C" {
    #[doc = " \\brief Implementation of fault injection decrementer"]
    #[doc = ""]
    #[doc = " This is included inside of macros, so it needs to be exported as a public function, but it"]
    #[doc = " should not be used directly."]
    pub fn _rcutils_fault_injection_maybe_fail() -> int_least64_t;
}
#[doc = " Struct wrapping a fixed-size c string used for returning the formatted error string."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_error_string_t {
    #[doc = " The fixed-size C string used for returning the formatted error string."]
    pub str_: [::std::os::raw::c_char; 1024usize],
}
#[test]
fn bindgen_test_layout_rcutils_error_string_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_error_string_t>(),
        1024usize,
        concat!("Size of: ", stringify!(rcutils_error_string_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_error_string_t>(),
        1usize,
        concat!("Alignment of ", stringify!(rcutils_error_string_t))
    );
    fn test_field_str() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_error_string_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_error_string_t),
                "::",
                stringify!(str_)
            )
        );
    }
    test_field_str();
}
#[doc = " Struct which encapsulates the error state set by RCUTILS_SET_ERROR_MSG()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_error_state_t {
    #[doc = " User message storage, limited to RCUTILS_ERROR_STATE_MESSAGE_MAX_LENGTH characters."]
    pub message: [::std::os::raw::c_char; 768usize],
    #[doc = " File name, limited to what's left from RCUTILS_ERROR_STATE_MAX_SIZE characters"]
    #[doc = " after subtracting storage for others."]
    pub file: [::std::os::raw::c_char; 229usize],
    #[doc = " Line number of error."]
    pub line_number: u64,
}
#[test]
fn bindgen_test_layout_rcutils_error_state_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_error_state_t>(),
        1008usize,
        concat!("Size of: ", stringify!(rcutils_error_state_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_error_state_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_error_state_t))
    );
    fn test_field_message() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_error_state_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_error_state_t),
                "::",
                stringify!(message)
            )
        );
    }
    test_field_message();
    fn test_field_file() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_error_state_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize
            },
            768usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_error_state_t),
                "::",
                stringify!(file)
            )
        );
    }
    test_field_file();
    fn test_field_line_number() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_error_state_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).line_number) as usize - ptr as usize
            },
            1000usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_error_state_t),
                "::",
                stringify!(line_number)
            )
        );
    }
    test_field_line_number();
}
extern "C" {
    #[doc = " Forces initialization of thread-local storage if called in a newly created thread."]
    #[doc = "* *"]
    #[doc = "* If this function is not called beforehand, then the first time the error"]
    #[doc = "* state is set or the first time the error message is retrieved, the default"]
    #[doc = "* allocator will be used to allocate thread-local storage."]
    #[doc = "* "]
    #[doc = "* This function may or may not allocate memory."]
    #[doc = "* The system's thread-local storage implementation may need to allocate"]
    #[doc = "* memory, since it usually has no way of knowing how much storage is needed"]
    #[doc = "* without knowing how many threads will be created."]
    #[doc = "* Most implementations (e.g. C11, C++11, and pthread) do not have ways to"]
    #[doc = "* specify how this memory is allocated, but if the implementation allows, the"]
    #[doc = "* given allocator to this function will be used, but is otherwise unused."]
    #[doc = "* This only occurs when creating and destroying threads, which can be avoided"]
    #[doc = "* in the \"steady\" state by reusing pools of threads."]
    #[doc = "* "]
    #[doc = "* It is worth considering that repeated thread creation and destruction will"]
    #[doc = "* result in repeated memory allocations and could result in memory"]
    #[doc = "* fragmentation."]
    #[doc = "* This is typically avoided anyways by using pools of threads."]
    #[doc = "* "]
    #[doc = "* In case an error is indicated by the return code, no error message will have"]
    #[doc = "* been set."]
    #[doc = "* "]
    #[doc = "* If called more than once in a thread, or after implicitly initialized by"]
    #[doc = "* setting the error state, it will still return `RCUTILS_RET_OK`, even"]
    #[doc = "* if the given allocator is invalid."]
    #[doc = "* Essentially this function does nothing if thread-local storage has already"]
    #[doc = "* been called."]
    #[doc = "* If already initialized, the given allocator is ignored, even if it does not"]
    #[doc = "* match the allocator used originally to initialize the thread-local storage."]
    #[doc = "* "]
    #[doc = "* \\param[in] allocator to be used to allocate and deallocate memory"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if the allocator is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if allocating memory fails, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unspecified error occurs."]
    #[doc = "* /"]
    pub fn rcutils_initialize_error_handling_thread_local_storage(
        allocator: rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Set the error message, as well as the file and line on which it occurred."]
    #[doc = "* *"]
    #[doc = "* This is not meant to be used directly, but instead via the"]
    #[doc = "* RCUTILS_SET_ERROR_MSG(msg) macro."]
    #[doc = "* "]
    #[doc = "* The error_msg parameter is copied into the internal error storage and must"]
    #[doc = "* be null terminated."]
    #[doc = "* The file parameter is copied into the internal error storage and must"]
    #[doc = "* be null terminated."]
    #[doc = "* "]
    #[doc = "* \\param[in] error_string The error message to set."]
    #[doc = "* \\param[in] file The path to the file in which the error occurred."]
    #[doc = "* \\param[in] line_number The line number on which the error occurred."]
    #[doc = "* /"]
    pub fn rcutils_set_error_state(
        error_string: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line_number: size_t,
    );
}
extern "C" {
    #[doc = " Return `true` if the error is set, otherwise `false`."]
    pub fn rcutils_error_is_set() -> bool;
}
extern "C" {
    #[doc = " Return an rcutils_error_state_t which was set with rcutils_set_error_state()."]
    #[doc = "* *"]
    #[doc = "* The returned pointer will be NULL if no error has been set in this thread."]
    #[doc = "* "]
    #[doc = "* The returned pointer is valid until RCUTILS_SET_ERROR_MSG, rcutils_set_error_state,"]
    #[doc = "* or rcutils_reset_error are called in the same thread."]
    #[doc = "* "]
    #[doc = "* \\return A pointer to the current error state struct."]
    #[doc = "* /"]
    pub fn rcutils_get_error_state() -> *const rcutils_error_state_t;
}
extern "C" {
    #[doc = " Return the error message followed by `, at <file>:<line>` if set, else \"error not set\"."]
    #[doc = "* *"]
    #[doc = "* This function is \"safe\" because it returns a copy of the current error"]
    #[doc = "* string or one containing the string \"error not set\" if no error was set."]
    #[doc = "* This ensures that the copy is owned by the calling thread and is therefore"]
    #[doc = "* never invalidated by other error handling calls, and that the C string"]
    #[doc = "* inside is always valid and null terminated."]
    #[doc = "* "]
    #[doc = "* \\return The current error string, with file and line number, or \"error not set\" if not set."]
    #[doc = "* /"]
    pub fn rcutils_get_error_string() -> rcutils_error_string_t;
}
extern "C" {
    #[doc = " Reset the error state by clearing any previously set error state."]
    pub fn rcutils_reset_error();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_array_list_impl_t {
    _unused: [u8; 0],
}
#[doc = " The structure holding the metadata for an array list."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_array_list_t {
    #[doc = " A pointer to the PIMPL implementation type."]
    pub impl_: *mut rcutils_array_list_impl_t,
}
#[test]
fn bindgen_test_layout_rcutils_array_list_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_array_list_t>(),
        8usize,
        concat!("Size of: ", stringify!(rcutils_array_list_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_array_list_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_array_list_t))
    );
    fn test_field_impl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_array_list_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_array_list_t),
                "::",
                stringify!(impl_)
            )
        );
    }
    test_field_impl();
}
extern "C" {
    #[doc = " Return an empty array_list struct."]
    #[doc = "* *"]
    #[doc = "* This function returns an empty and zero initialized array_list struct."]
    #[doc = "* Calling rcutils_array_list_fini() on any non-initialized instance leads"]
    #[doc = "* to undefined behavior."]
    #[doc = "* Every instance of array_list_t has to either be zero_initialized with this"]
    #[doc = "* function or manually allocated."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | Yes"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* "]
    #[doc = "* ```c"]
    #[doc = "* rcutils_array_list_t foo;"]
    #[doc = "* rcutils_array_list_fini(&foo); // undefined behavior!"]
    #[doc = "* "]
    #[doc = "* rcutils_array_list_t bar = rcutils_get_zero_initialized_array_list();"]
    #[doc = "* rcutils_array_list_fini(&bar); // ok"]
    #[doc = "* ```"]
    #[doc = "* /"]
    pub fn rcutils_get_zero_initialized_array_list() -> rcutils_array_list_t;
}
extern "C" {
    #[doc = " Initialize an array list with a given initial capacity."]
    #[doc = "* *"]
    #[doc = "* This function will initialize a given, zero initialized, array_list to"]
    #[doc = "* a given size."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* "]
    #[doc = "* ```c"]
    #[doc = "* rcutils_allocator_t allocator = rcutils_get_default_allocator();"]
    #[doc = "* rcutils_array_list_t array_list = rcutils_get_zero_initialized_array_list();"]
    #[doc = "* rcutils_ret_t ret = rcutils_array_list_init(&array_list, 2, sizeof(int), &allocator);"]
    #[doc = "* if (ret != RCUTILS_RET_OK) {"]
    #[doc = "* // ... error handling"]
    #[doc = "* }"]
    #[doc = "* int data = 42;"]
    #[doc = "* int out_data = 0;"]
    #[doc = "* ret = rcutils_array_list_add(&array_list, &data);"]
    #[doc = "* data++;"]
    #[doc = "* ret = rcutils_array_list_get(&array_list, 0, &out_data);"]
    #[doc = "* assert(42 == out_data);"]
    #[doc = "* ret = rcutils_array_list_fini(&array_list);"]
    #[doc = "* ```"]
    #[doc = "* "]
    #[doc = "* \\param[inout] array_list object to be initialized"]
    #[doc = "* \\param[in] initial_capacity the initial capacity to allocate in the list"]
    #[doc = "* \\param[in] data_size the size (in bytes) of the data object being stored in the list"]
    #[doc = "* \\param[in] allocator to be used to allocate and deallocate memory"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_array_list_init(
        array_list: *mut rcutils_array_list_t,
        initial_capacity: size_t,
        data_size: size_t,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize an array list, reclaiming all resources."]
    #[doc = "* *"]
    #[doc = "* This function reclaims any memory owned by the array list."]
    #[doc = "* "]
    #[doc = "* The allocator used to initialize the array list is used to deallocate each"]
    #[doc = "* entry in the list and the list itself."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[inout] array_list object to be finalized"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_array_list_fini(array_list: *mut rcutils_array_list_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Adds an entry to the list"]
    #[doc = "* *"]
    #[doc = "* This function adds the provided data to the end of the list. A shallow copy of"]
    #[doc = "* the provided data is made to store in the list instead of just storing"]
    #[doc = "* the pointer to the provided data."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] array_list to add the data to"]
    #[doc = "* \\param[in] data a pointer to the data to add to the list"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_array_list_add(
        array_list: *mut rcutils_array_list_t,
        data: *const ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Sets an entry in the list to the provided data"]
    #[doc = "* *"]
    #[doc = "* This function sets the provided data at the specified index in the list."]
    #[doc = "* A shallow copy of the provided data is made to store in the list instead"]
    #[doc = "* of just storing the pointer to the provided data."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] array_list to add the data to"]
    #[doc = "* \\param[in] index the position in the list to set the data"]
    #[doc = "* \\param[in] data a pointer to the data that will be set in the list"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if index out of bounds, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_array_list_set(
        array_list: *mut rcutils_array_list_t,
        index: size_t,
        data: *const ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Removes an entry in the list at the provided index"]
    #[doc = "* *"]
    #[doc = "* This function removes data from the list at the specified index. The capacity"]
    #[doc = "* of the list will never decrease when entries are removed."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] array_list to add the data to"]
    #[doc = "* \\param[in] index the index of the item to remove from the list"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if index out of bounds, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_array_list_remove(
        array_list: *mut rcutils_array_list_t,
        index: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Retrieves an entry in the list at the provided index"]
    #[doc = "* *"]
    #[doc = "* This function retrieves a copy of the data stored in the list at the provided index."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* "]
    #[doc = "* \\param[in] array_list to add the data to"]
    #[doc = "* \\param[in] index the index at which to get the data"]
    #[doc = "* \\param[out] data a copy of the data stored in the list"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_array_list_get(
        array_list: *const rcutils_array_list_t,
        index: size_t,
        data: *mut ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Retrieves the size of the provided array_list"]
    #[doc = "* *"]
    #[doc = "* This function retrieves the number of items in the provided array list"]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* "]
    #[doc = "* \\param[in] array_list list to get the size of"]
    #[doc = "* \\param[out] size The number of items currently stored in the list"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_array_list_get_size(
        array_list: *const rcutils_array_list_t,
        size: *mut size_t,
    ) -> rcutils_ret_t;
}
#[doc = " The structure holding the metadata for a char array."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_char_array_t {
    #[doc = " A pointer to the allocated memory for this char array."]
    pub buffer: *mut ::std::os::raw::c_char,
    #[doc = " if this is true, we may safely free/realloc the buffer as needed;"]
    #[doc = " otherwise we will leave the buffer alone and alloc new memory if"]
    #[doc = " more space is needed"]
    pub owns_buffer: bool,
    #[doc = " The length of the data stored in the buffer pointer."]
    pub buffer_length: size_t,
    #[doc = " The maximum capacity of the buffer pointer."]
    pub buffer_capacity: size_t,
    #[doc = " The allocator used to allocate and free the data in the pointer."]
    pub allocator: rcutils_allocator_t,
}
#[test]
fn bindgen_test_layout_rcutils_char_array_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_char_array_t>(),
        72usize,
        concat!("Size of: ", stringify!(rcutils_char_array_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_char_array_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_char_array_t))
    );
    fn test_field_buffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_char_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_char_array_t),
                "::",
                stringify!(buffer)
            )
        );
    }
    test_field_buffer();
    fn test_field_owns_buffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_char_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).owns_buffer) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_char_array_t),
                "::",
                stringify!(owns_buffer)
            )
        );
    }
    test_field_owns_buffer();
    fn test_field_buffer_length() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_char_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer_length) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_char_array_t),
                "::",
                stringify!(buffer_length)
            )
        );
    }
    test_field_buffer_length();
    fn test_field_buffer_capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_char_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer_capacity) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_char_array_t),
                "::",
                stringify!(buffer_capacity)
            )
        );
    }
    test_field_buffer_capacity();
    fn test_field_allocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_char_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_char_array_t),
                "::",
                stringify!(allocator)
            )
        );
    }
    test_field_allocator();
}
extern "C" {
    #[doc = " Return a zero initialized char array struct."]
    #[doc = "* *"]
    #[doc = "* \\return rcutils_char_array_t a zero initialized char array struct"]
    #[doc = "* /"]
    pub fn rcutils_get_zero_initialized_char_array() -> rcutils_char_array_t;
}
extern "C" {
    #[doc = " Initialize a zero initialized char array struct."]
    #[doc = "* *"]
    #[doc = "* This function may leak if the char array struct is already"]
    #[doc = "* pre-initialized."]
    #[doc = "* If the capacity is set to 0, no memory is allocated and the internal buffer"]
    #[doc = "* is still NULL."]
    #[doc = "* "]
    #[doc = "* \\param[in] char_array a pointer to the to be initialized char array struct"]
    #[doc = "* \\param[in] buffer_capacity the size of the memory to allocate for the byte stream"]
    #[doc = "* \\param[in] allocator the allocator to use for the memory allocation"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if no memory could be allocated correctly"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_init(
        char_array: *mut rcutils_char_array_t,
        buffer_capacity: size_t,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize a char array struct."]
    #[doc = "* *"]
    #[doc = "* Cleans up and deallocates any resources owned by rcutils_char_array_t."]
    #[doc = "* The array passed to this function needs to have been initialized by"]
    #[doc = "* rcutils_char_array_init()."]
    #[doc = "* If .owns_buffer is false, this function has no effect because that"]
    #[doc = "* implies that the char_array does not own the internal buffer."]
    #[doc = "* Passing an uninitialized instance to this function leads to undefined"]
    #[doc = "* behavior."]
    #[doc = "* "]
    #[doc = "* \\param[in] char_array pointer to the rcutils_char_array_t to be cleaned up"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if the char_array argument is invalid"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_fini(char_array: *mut rcutils_char_array_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Resize the internal buffer of the char array."]
    #[doc = "* *"]
    #[doc = "* The internal buffer of the char array can be resized dynamically if needed."]
    #[doc = "* If the new size is smaller than the current capacity, then the memory is"]
    #[doc = "* truncated."]
    #[doc = "* Be aware, that this will deallocate the memory and therefore invalidates any"]
    #[doc = "* pointers to this storage."]
    #[doc = "* If the new size is larger, new memory is getting allocated and the existing"]
    #[doc = "* content is copied over."]
    #[doc = "* Note that if the array doesn't own the current buffer the function just"]
    #[doc = "* allocates a new block of memory and copies the contents of the old buffer"]
    #[doc = "* instead of resizing the existing buffer."]
    #[doc = "* "]
    #[doc = "* \\param[in] char_array pointer to the instance of rcutils_char_array_t which is being resized"]
    #[doc = "* \\param[in] new_size the new size of the internal buffer"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if new_size is set to zero"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_resize(
        char_array: *mut rcutils_char_array_t,
        new_size: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Expand the internal buffer of the char array."]
    #[doc = "* *"]
    #[doc = "* This function is equivalent to `rcutils_char_array_resize` except that it resizes"]
    #[doc = "* the internal buffer only when it is not big enough."]
    #[doc = "* If the buffer is already big enough for `new_size`, it returns `RCUTILS_RET_OK` without"]
    #[doc = "* doing anything."]
    #[doc = "* "]
    #[doc = "* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being resized"]
    #[doc = "* \\param[in] new_size the new size of the internal buffer"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_expand_as_needed(
        char_array: *mut rcutils_char_array_t,
        new_size: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Produce output according to format and args."]
    #[doc = "* *"]
    #[doc = "* This function is equivalent to `vsprintf(char_array->buffer, format, args)`"]
    #[doc = "* except that the buffer grows as needed so a user doesn't have to deal with"]
    #[doc = "* memory management."]
    #[doc = "* The `va_list args` will be cloned before being used, so a user can safely"]
    #[doc = "* use it again after calling this function."]
    #[doc = "* "]
    #[doc = "* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being"]
    #[doc = "* written to"]
    #[doc = "* \\param[in] format the format string used by the underlying `vsnprintf`"]
    #[doc = "* \\param[in] args the `va_list` used by the underlying `vsnprintf`"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_vsprintf(
        char_array: *mut rcutils_char_array_t,
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Append a string (or part of it) to the string in buffer."]
    #[doc = "* *"]
    #[doc = "* This function treats the internal buffer as a string and appends the src string to it."]
    #[doc = "* If src is longer than n, n bytes will be used and an extra null byte will be appended."]
    #[doc = "* It is virtually equivalent to `strncat(char_array->buffer, src, n)` except that the buffer"]
    #[doc = "* grows as needed so a user doesn't have to deal with memory management."]
    #[doc = "* "]
    #[doc = "* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being appended to"]
    #[doc = "* \\param[in] src the string to be appended to the end of the string in buffer"]
    #[doc = "* \\param[in] n it uses at most n bytes from the src string"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_strncat(
        char_array: *mut rcutils_char_array_t,
        src: *const ::std::os::raw::c_char,
        n: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Append a string to the string in buffer."]
    #[doc = "* *"]
    #[doc = "* This function treats the internal buffer as a string and appends the src string to it."]
    #[doc = "* It is virtually equivalent to `strcat(char_array->buffer, src)` except that the buffer"]
    #[doc = "* grows as needed. That is to say, a user can safely use it without doing calculation or"]
    #[doc = "* checks on the sizes of the src and buffer."]
    #[doc = "* "]
    #[doc = "* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being"]
    #[doc = "* appended to"]
    #[doc = "* \\param[in] src the string to be appended to the end of the string in buffer"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_strcat(
        char_array: *mut rcutils_char_array_t,
        src: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Copy memory to buffer."]
    #[doc = "* *"]
    #[doc = "* This function is equivalent to `memcpy(char_array->buffer, src, n)` except that the buffer"]
    #[doc = "* grows as needed so a user doesn't have to worry about overflow."]
    #[doc = "* "]
    #[doc = "* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being resized"]
    #[doc = "* \\param[in] src the memory to be copied from"]
    #[doc = "* \\param[in] n a total of n bytes will be copied"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_memcpy(
        char_array: *mut rcutils_char_array_t,
        src: *const ::std::os::raw::c_char,
        n: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Copy a string to buffer."]
    #[doc = "* *"]
    #[doc = "* This function is equivalent to `strcpy(char_array->buffer, src)` except that the buffer"]
    #[doc = "* grows as needed so that `src` will fit without overflow."]
    #[doc = "* "]
    #[doc = "* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being"]
    #[doc = "* copied to"]
    #[doc = "* \\param[in] src the string to be copied from"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_char_array_strcpy(
        char_array: *mut rcutils_char_array_t,
        src: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_hash_map_impl_t {
    _unused: [u8; 0],
}
#[doc = " The structure holding the metadata for a hash map."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_hash_map_t {
    #[doc = " A pointer to the PIMPL implementation type."]
    pub impl_: *mut rcutils_hash_map_impl_t,
}
#[test]
fn bindgen_test_layout_rcutils_hash_map_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_hash_map_t>(),
        8usize,
        concat!("Size of: ", stringify!(rcutils_hash_map_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_hash_map_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_hash_map_t))
    );
    fn test_field_impl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_hash_map_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_hash_map_t),
                "::",
                stringify!(impl_)
            )
        );
    }
    test_field_impl();
}
#[doc = " The function signature for a key hashing function."]
#[doc = "* *"]
#[doc = "* \\param[in] key The key that needs to be hashed"]
#[doc = "* \\return A hash value for the provided string"]
#[doc = "* /"]
pub type rcutils_hash_map_key_hasher_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void) -> size_t>;
#[doc = " The function signature for a key comparison function."]
#[doc = "* *"]
#[doc = "* \\param[in] val1 The first value to compare"]
#[doc = "* \\param[in] val2 The second value to compare"]
#[doc = "* \\return A negative number if val1 < val2, or"]
#[doc = "* \\return A positve number if val1 > val2, or"]
#[doc = "* \\return Zero if val1 == val2."]
#[doc = "* /"]
pub type rcutils_hash_map_key_cmp_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = " A hashing function for a null terminated c string."]
    #[doc = "* *"]
    #[doc = "* A hashing function for a null terminated c string."]
    #[doc = "* Should be used when your key is just a pointer to a c-string"]
    #[doc = "* /"]
    pub fn rcutils_hash_map_string_hash_func(key_str: *const ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    #[doc = " A comparison function for a null terminated c string."]
    #[doc = "* *"]
    #[doc = "* A comparison function for a null terminated c string."]
    #[doc = "* Should be used when your key is just a pointer to a c-string"]
    #[doc = "* /"]
    pub fn rcutils_hash_map_string_cmp_func(
        val1: *const ::std::os::raw::c_void,
        val2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Return an empty hash_map struct."]
    #[doc = "* *"]
    #[doc = "* This function returns an empty and zero initialized hash_map struct."]
    #[doc = "* All hash maps should be initialized with this or manually initialized"]
    #[doc = "* before being used."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* ```c"]
    #[doc = "* // Do not do this:"]
    #[doc = "* // rcutils_hash_map_t foo;"]
    #[doc = "* // rcutils_hash_map_fini(&foo); // undefined behavior!"]
    #[doc = "* "]
    #[doc = "* // Do this instead:"]
    #[doc = "* rcutils_hash_map_t bar = rcutils_get_zero_initialized_hash_map();"]
    #[doc = "* rcutils_hash_map_fini(&bar); // ok"]
    #[doc = "* ```"]
    #[doc = "* */"]
    pub fn rcutils_get_zero_initialized_hash_map() -> rcutils_hash_map_t;
}
extern "C" {
    #[doc = " Initialize a rcutils_hash_map_t, allocating space for given capacity."]
    #[doc = "* *"]
    #[doc = "* This function initializes the rcutils_hash_map_t with a given initial"]
    #[doc = "* capacity for entries."]
    #[doc = "* Note this does not allocate space for keys or values in the hash_map, just the"]
    #[doc = "* arrays of pointers to the keys and values."]
    #[doc = "* rcutils_hash_map_set() should still be used when assigning values."]
    #[doc = "* "]
    #[doc = "* The hash_map argument should point to allocated memory and should have"]
    #[doc = "* been zero initialized with rcutils_get_zero_initialized_hash_map()."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* ```c"]
    #[doc = "* rcutils_hash_map_t hash_map = rcutils_get_zero_initialized_hash_map();"]
    #[doc = "* rcutils_ret_t ret ="]
    #[doc = "* rcutils_hash_map_init(&hash_map, 10, rcutils_get_default_allocator());"]
    #[doc = "* if (ret != RCUTILS_RET_OK) {"]
    #[doc = "* // ... do error handling"]
    #[doc = "* }"]
    #[doc = "* // ... use the hash_map and when done:"]
    #[doc = "* ret = rcutils_hash_map_fini(&hash_map);"]
    #[doc = "* if (ret != RCUTILS_RET_OK) {"]
    #[doc = "* // ... do error handling"]
    #[doc = "* }"]
    #[doc = "* ```"]
    #[doc = "* "]
    #[doc = "* \\param[inout] hash_map rcutils_hash_map_t to be initialized"]
    #[doc = "* \\param[in] initial_capacity the amount of initial capacity for the hash_map"]
    #[doc = "* \\param[in] key_size the size (in bytes) of the key used to index the data"]
    #[doc = "* \\param[in] data_size the size (in bytes) of the data being stored"]
    #[doc = "* \\param[in] key_hashing_func a function that returns a hashed value for a key"]
    #[doc = "* \\param[in] key_cmp_func a function used to compare keys"]
    #[doc = "* \\param[in] allocator the allocator to use through out the lifetime of the hash_map"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_ALREADY_INIT if alread initialized, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_init(
        hash_map: *mut rcutils_hash_map_t,
        initial_capacity: size_t,
        key_size: size_t,
        data_size: size_t,
        key_hashing_func: rcutils_hash_map_key_hasher_t,
        key_cmp_func: rcutils_hash_map_key_cmp_t,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize the previously initialized hash_map struct."]
    #[doc = "* *"]
    #[doc = "* This function will free any resources which were created when initializing"]
    #[doc = "* or when calling rcutils_hash_map_set()."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[inout] hash_map rcutils_hash_map_t to be finalized"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_fini(hash_map: *mut rcutils_hash_map_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the current capacity of the hash_map."]
    #[doc = "* *"]
    #[doc = "* This function will return the internal capacity of the hash_map, which is the"]
    #[doc = "* number of buckets the hash_map uses to sort the keys."]
    #[doc = "* The capacity does not indicate how many key value pairs are stored in the"]
    #[doc = "* hash_map, the rcutils_hash_map_get_size() function can provide that, nor the"]
    #[doc = "* maximum number that can be stored without increasing the capacity."]
    #[doc = "* The capacity can be set initially with rcutils_hash_map_init()."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] hash_map rcutils_hash_map_t to be queried"]
    #[doc = "* \\param[out] capacity capacity of the hash_map"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_get_capacity(
        hash_map: *const rcutils_hash_map_t,
        capacity: *mut size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the current size of the hash_map."]
    #[doc = "* *"]
    #[doc = "* This function will return the internal size of the hash_map, which is the"]
    #[doc = "* current number of key value pairs in the hash_map."]
    #[doc = "* The size is changed when calling rcutils_hash_map_set() or rcutils_hash_map_unset()."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] hash_map rcutils_hash_map_t to be queried"]
    #[doc = "* \\param[out] size size of the hash_map"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_get_size(
        hash_map: *const rcutils_hash_map_t,
        size: *mut size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Set a key value pair in the hash_map, increasing capacity if necessary."]
    #[doc = "* *"]
    #[doc = "* If the key already exists in the map then the value is updated to the new value"]
    #[doc = "* provided. If it does not already exist then a new entry is added for the new key"]
    #[doc = "* and value. The capacity will be increased if needed."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[inout] hash_map rcutils_hash_map_t to be updated"]
    #[doc = "* \\param[in] key hash_map key"]
    #[doc = "* \\param[in] value value for given hash_map key"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_set(
        hash_map: *mut rcutils_hash_map_t,
        key: *const ::std::os::raw::c_void,
        value: *const ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Unset a key value pair in the hash_map."]
    #[doc = "* *"]
    #[doc = "* Unsets the key value pair in the hash_map and frees any internal resources allocated"]
    #[doc = "* for the entry. This function will never decrease the capacity when removing keys."]
    #[doc = "* If the given key is not found, RCUTILS_RET_STRING_KEY_NOT_FOUND is returned."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[inout] hash_map rcutils_hash_map_t to be updated"]
    #[doc = "* \\param[in] key hash_map key, must be null terminated c string"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_KEY_NOT_FOUND if the key is not found in the map, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_unset(
        hash_map: *mut rcutils_hash_map_t,
        key: *const ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get whether or not a key exists."]
    #[doc = "* *"]
    #[doc = "* Returns true if the provided key exists in the hash_map or false if it does not or"]
    #[doc = "* if the hash_map or key are invalid."]
    #[doc = "* In all cases no error message is set."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] hash_map rcutils_hash_map_t to be searched"]
    #[doc = "* \\param[in] key hash_map key, must be null terminated c string"]
    #[doc = "* \\return `true` if key is in the hash_map, or"]
    #[doc = "* \\return `false` if key is not in the hash_map, or"]
    #[doc = "* \\return `false` for invalid arguments, or"]
    #[doc = "* \\return `false` if the hash_map is invalid."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_key_exists(
        hash_map: *const rcutils_hash_map_t,
        key: *const ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[doc = " Get value given a key."]
    #[doc = "* *"]
    #[doc = "* This function can be used to retrieve a shallow copy of the stored data. The data"]
    #[doc = "* pointer must point to a section of memory large enough to copy the full size of"]
    #[doc = "* the data being stored, which is specified when the hash_map in initialized."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] hash_map rcutils_hash_map_t to be searched"]
    #[doc = "* \\param[in] key hash_map key to look up the data for"]
    #[doc = "* \\param[out] data A copy of the data stored in the map"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_FOUND if the key doesn't exist in the map, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_get(
        hash_map: *const rcutils_hash_map_t,
        key: *const ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the next key in the hash_map, unless NULL is given, then get the first key."]
    #[doc = "* *"]
    #[doc = "* This function allows you to iteratively get each key/value pair in the hash_map."]
    #[doc = "* "]
    #[doc = "* If NULL is given for the previous_key, then the first key in the hash_map is returned."]
    #[doc = "* If that returned key is given as the previous_key for the next call to this function,"]
    #[doc = "* then the next key in the hash_map is returned."]
    #[doc = "* If there are no more keys in the hash_map or if the given key is not in the hash_map,"]
    #[doc = "* an error will be returned."]
    #[doc = "* "]
    #[doc = "* The order of the keys in the hash_map is arbitrary and if the hash_map is modified"]
    #[doc = "* between calls to this function the behavior is undefined."]
    #[doc = "* If the hash_map is modified then iteration should begin again by passing NULL to"]
    #[doc = "* get the first key again."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* ```c"]
    #[doc = "* printf(\"entries in the hash_map:\\n\");"]
    #[doc = "* int key = 0, data = 0;"]
    #[doc = "* rcutils_ret_t status = rcutils_hash_map_get_next_key(&hash_map, NULL, &key, &data);"]
    #[doc = "* while (RCUTILS_RET_OK == status) {"]
    #[doc = "* printf(\"%i: %i\\n\", key, data);"]
    #[doc = "* status = rcutils_hash_map_get_next_key(&hash_map, &key, &key, &data);"]
    #[doc = "* }"]
    #[doc = "* ```"]
    #[doc = "* "]
    #[doc = "* \\param[in] hash_map rcutils_hash_map_t to be queried"]
    #[doc = "* \\param[in] previous_key NULL to get the first key or the previous key to get the next for"]
    #[doc = "* \\param[out] key A copy of the next key in the sequence"]
    #[doc = "* \\param[out] data A copy of the next data in the sequence"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_FOUND if the previous_key doesn't exist in the map, or"]
    #[doc = "* \\return #RCUTILS_RET_HASH_MAP_NO_MORE_ENTRIES if there is no more data beyound the previous_key, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_hash_map_get_next_key_and_data(
        hash_map: *const rcutils_hash_map_t,
        previous_key: *const ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Interface to qsort with rcutils-style argument validation."]
    #[doc = "* *"]
    #[doc = "* This function changes the order of the elements in the array so that they"]
    #[doc = "* are in ascending order according to the given comparison function."]
    #[doc = "* "]
    #[doc = "* This function is thread-safe."]
    #[doc = "* "]
    #[doc = "* \\param[inout] ptr object whose elements should be sorted."]
    #[doc = "* \\param[in] count number of elements present in the object."]
    #[doc = "* \\param[in] size size of each element, in bytes."]
    #[doc = "* \\param[in] comp function used to compare two elements."]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_qsort(
        ptr: *mut ::std::os::raw::c_void,
        count: size_t,
        size: size_t,
        comp: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> rcutils_ret_t;
}
#[doc = " The structure holding the metadata for a string array."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_string_array_t {
    #[doc = " The number of strings that can be stored in the string array."]
    pub size: size_t,
    #[doc = " The allocated memory for the string array."]
    pub data: *mut *mut ::std::os::raw::c_char,
    #[doc = " The allocator used to allocate and free memory for the string array."]
    pub allocator: rcutils_allocator_t,
}
#[test]
fn bindgen_test_layout_rcutils_string_array_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_string_array_t>(),
        56usize,
        concat!("Size of: ", stringify!(rcutils_string_array_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_string_array_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_string_array_t))
    );
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_string_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_string_array_t),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_string_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_string_array_t),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_allocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_string_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_string_array_t),
                "::",
                stringify!(allocator)
            )
        );
    }
    test_field_allocator();
}
extern "C" {
    #[doc = " Return an empty string array struct."]
    #[doc = "* *"]
    #[doc = "* This function returns an empty and zero initialized string array struct."]
    #[doc = "* Calling rcutils_string_array_fini() on any non-initialized instance leads"]
    #[doc = "* to undefined behavior."]
    #[doc = "* Every instance of string_array_t has to either be zero_initialized with this"]
    #[doc = "* function or manually allocated."]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* "]
    #[doc = "* ```c"]
    #[doc = "* rcutils_string_array_t foo;"]
    #[doc = "* rcutils_string_array_fini(&foo); // undefined behavior!"]
    #[doc = "* "]
    #[doc = "* rcutils_string_array_t bar = rcutils_get_zero_initialized_string_array();"]
    #[doc = "* rcutils_string_array_fini(&bar); // ok"]
    #[doc = "* ```"]
    #[doc = "* /"]
    pub fn rcutils_get_zero_initialized_string_array() -> rcutils_string_array_t;
}
extern "C" {
    #[doc = " Initialize a string array with a given size."]
    #[doc = "* *"]
    #[doc = "* This function will initialize a given, zero initialized, string array to"]
    #[doc = "* a given size."]
    #[doc = "* "]
    #[doc = "* Note that putting a string into the array gives owenship to the array."]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* "]
    #[doc = "* ```c"]
    #[doc = "* rcutils_allocator_t allocator = rcutils_get_default_allocator();"]
    #[doc = "* rcutils_string_array_t string_array = rcutils_get_zero_initialized_string_array();"]
    #[doc = "* rcutils_ret_t ret = rcutils_string_array_init(&string_array, 2, &allocator);"]
    #[doc = "* if (ret != RCUTILS_RET_OK) {"]
    #[doc = "* // ... error handling"]
    #[doc = "* }"]
    #[doc = "* string_array.data[0] = rcutils_strdup(\"Hello\", &allocator);"]
    #[doc = "* string_array.data[1] = rcutils_strdup(\"World\", &allocator);"]
    #[doc = "* ret = rcutils_string_array_fini(&string_array);"]
    #[doc = "* ```"]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_array object to be initialized"]
    #[doc = "* \\param[in] size the size the array should be"]
    #[doc = "* \\param[in] allocator to be used to allocate and deallocate memory"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_array_init(
        string_array: *mut rcutils_string_array_t,
        size: size_t,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize a string array, reclaiming all resources."]
    #[doc = "* *"]
    #[doc = "* This function reclaims any memory owned by the string array, including the"]
    #[doc = "* strings it references."]
    #[doc = "* "]
    #[doc = "* The allocator used to initialize the string array is used to deallocate each"]
    #[doc = "* string in the array and the array of strings itself."]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_array object to be finalized"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_array_fini(string_array: *mut rcutils_string_array_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Compare two string arrays."]
    #[doc = "* *"]
    #[doc = "* The two string arrays are compared according to lexicographical order."]
    #[doc = "* "]
    #[doc = "* \\param[in] lhs The first string array."]
    #[doc = "* \\param[in] rhs The second string array."]
    #[doc = "* \\param[out] res Negative value if `lhs` appears before `rhs` in lexicographical order."]
    #[doc = "* Zero if `lhs` and `rhs` are equal."]
    #[doc = "* Positive value if `lhs` appears after `rhs` in lexographical order."]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if any argument is `NULL, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if `lhs->data` or `rhs->data` is `NULL, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_array_cmp(
        lhs: *const rcutils_string_array_t,
        rhs: *const rcutils_string_array_t,
        res: *mut ::std::os::raw::c_int,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Resize a string array, reclaiming removed resources."]
    #[doc = "* *"]
    #[doc = "* This function changes the size of an existing string array."]
    #[doc = "* If the new size is larger, new entries are added to the end of the array and"]
    #[doc = "* are zero- initialized."]
    #[doc = "* If the new size is smaller, entries are removed from the end of the array"]
    #[doc = "* and their resources reclaimed."]
    #[doc = "* "]
    #[doc = "* \\par Note:"]
    #[doc = "* Resizing to 0 is not a substitute for calling ::rcutils_string_array_fini."]
    #[doc = "* "]
    #[doc = "* \\par Note:"]
    #[doc = "* If this function fails, \\p string_array remains unchanged and should still"]
    #[doc = "* be reclaimed with ::rcutils_string_array_fini."]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_array object to be resized."]
    #[doc = "* \\param[in] new_size the size the array should be changed to."]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_array_resize(
        string_array: *mut rcutils_string_array_t,
        new_size: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Lexicographic comparer for pointers to string pointers."]
    #[doc = "* *"]
    #[doc = "* This functions compares pointers to string pointers lexicographically"]
    #[doc = "* ascending."]
    #[doc = "* "]
    #[doc = "* \\param[in] lhs pointer to the first string pointer."]
    #[doc = "* \\param[in] rhs pointer to the second string pointer."]
    #[doc = "* \\return <0 if lhs is lexicographically lower, or"]
    #[doc = "* \\return 0 if the strings are the same, or"]
    #[doc = "* \\return >0 if lhs is lexicographically higher."]
    #[doc = "* /"]
    pub fn rcutils_string_array_sort_compare(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_string_map_impl_t {
    _unused: [u8; 0],
}
#[doc = " The structure holding the metadata for a string map."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_string_map_t {
    #[doc = " A pointer to the PIMPL implementation type."]
    pub impl_: *mut rcutils_string_map_impl_t,
}
#[test]
fn bindgen_test_layout_rcutils_string_map_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_string_map_t>(),
        8usize,
        concat!("Size of: ", stringify!(rcutils_string_map_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_string_map_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_string_map_t))
    );
    fn test_field_impl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_string_map_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_string_map_t),
                "::",
                stringify!(impl_)
            )
        );
    }
    test_field_impl();
}
extern "C" {
    #[doc = " Return an empty string map struct."]
    #[doc = "* *"]
    #[doc = "* This function returns an empty and zero initialized string map struct."]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* "]
    #[doc = "* ```c"]
    #[doc = "* // Do not do this:"]
    #[doc = "* // rcutils_string_map_t foo;"]
    #[doc = "* // rcutils_string_map_fini(&foo); // undefined behavior!"]
    #[doc = "* "]
    #[doc = "* // Do this instead:"]
    #[doc = "* rcutils_string_map_t bar = rcutils_get_zero_initialized_string_map();"]
    #[doc = "* rcutils_string_map_fini(&bar); // ok"]
    #[doc = "* ```"]
    #[doc = "* */"]
    pub fn rcutils_get_zero_initialized_string_map() -> rcutils_string_map_t;
}
extern "C" {
    #[doc = " Initialize a rcutils_string_map_t, allocating space for given capacity."]
    #[doc = "* *"]
    #[doc = "* This function initializes the rcutils_string_map_t with a given initial"]
    #[doc = "* capacity for entries."]
    #[doc = "* Note this does not allocate space for keys or values in the map, just the"]
    #[doc = "* arrays of pointers to the keys and values."]
    #[doc = "* rcutils_string_map_set() should still be used when assigning values."]
    #[doc = "* "]
    #[doc = "* The string_map argument should point to allocated memory and should have"]
    #[doc = "* been zero initialized with rcutils_get_zero_initialized_string_map()."]
    #[doc = "* For example:"]
    #[doc = "* "]
    #[doc = "* ```c"]
    #[doc = "* rcutils_string_map_t string_map = rcutils_get_zero_initialized_string_map();"]
    #[doc = "* rcutils_ret_t ret ="]
    #[doc = "* rcutils_string_map_init(&string_map, 10, rcutils_get_default_allocator());"]
    #[doc = "* if (ret != RCUTILS_RET_OK) {"]
    #[doc = "* // ... do error handling"]
    #[doc = "* }"]
    #[doc = "* // ... use the string map and when done:"]
    #[doc = "* ret = rcutils_string_map_fini(&string_map);"]
    #[doc = "* if (ret != RCUTILS_RET_OK) {"]
    #[doc = "* // ... do error handling"]
    #[doc = "* }"]
    #[doc = "* ```"]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_map rcutils_string_map_t to be initialized"]
    #[doc = "* \\param[in] initial_capacity the amount of initial capacity for the string map"]
    #[doc = "* \\param[in] allocator the allocator to use through out the lifetime of the map"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_ALREADY_INIT if already initialized, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_init(
        string_map: *mut rcutils_string_map_t,
        initial_capacity: size_t,
        allocator: rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize the previously initialized string map struct."]
    #[doc = "* *"]
    #[doc = "* This function will free any resources which were created when initializing"]
    #[doc = "* or when calling rcutils_string_map_set()."]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_map rcutils_string_map_t to be finalized"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_fini(string_map: *mut rcutils_string_map_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the current capacity of the string map."]
    #[doc = "* *"]
    #[doc = "* This function will return the internal capacity of the map, which is the"]
    #[doc = "* maximum number of key value pairs the map could hold."]
    #[doc = "* The capacity can be set initially with rcutils_string_map_init() or"]
    #[doc = "* with rcutils_string_map_reserve()."]
    #[doc = "* The capacity does not indicate how many key value paris are stored in the"]
    #[doc = "* map, the rcutils_string_map_get_size() function can provide that."]
    #[doc = "* "]
    #[doc = "* \\param[in] string_map rcutils_string_map_t to be queried"]
    #[doc = "* \\param[out] capacity capacity of the string map"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_get_capacity(
        string_map: *const rcutils_string_map_t,
        capacity: *mut size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the current size of the string map."]
    #[doc = "* *"]
    #[doc = "* This function will return the internal size of the map, which is the"]
    #[doc = "* current number of key value pairs in the map."]
    #[doc = "* The size is changed when calling rcutils_string_map_set_no_resize(),"]
    #[doc = "* rcutils_string_map_set(), or rcutils_string_map_unset()."]
    #[doc = "* "]
    #[doc = "* \\param[in] string_map rcutils_string_map_t to be queried"]
    #[doc = "* \\param[out] size size of the string map"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_get_size(
        string_map: *const rcutils_string_map_t,
        size: *mut size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Reserve a given amount of capacity in the map."]
    #[doc = "* *"]
    #[doc = "* Increases the capacity of the map to at least the given size."]
    #[doc = "* "]
    #[doc = "* If the current capacity is less than requested capacity then the capacity"]
    #[doc = "* is increased using the allocator given during initialization of the map in"]
    #[doc = "* rcutils_string_map_init()."]
    #[doc = "* If the requested capacity is less than the current capacity, the capacity"]
    #[doc = "* may be reduced, but no existing key value pairs will be truncated to do so."]
    #[doc = "* In effect, the capacity will be shrunk to fit the number of items in map or"]
    #[doc = "* the requested capacity, which ever is larger."]
    #[doc = "* "]
    #[doc = "* If recovering all resources is desired first call rcutils_string_map_clear()"]
    #[doc = "* and then this function with a capacity of 0."]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_map rcutils_string_map_t to have space reserved in"]
    #[doc = "* \\param[in] capacity requested size to reserve in the map"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_reserve(
        string_map: *mut rcutils_string_map_t,
        capacity: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Remove all key value pairs from the map."]
    #[doc = "* *"]
    #[doc = "* This function will remove all key value pairs from the map, and it will"]
    #[doc = "* reclaim all resources allocated as a result of setting key value pairs."]
    #[doc = "* rcutils_string_map_fini() should still be called after this."]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_map rcutils_string_map_t to be cleared"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_clear(string_map: *mut rcutils_string_map_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Set a key value pair in the map, increasing capacity if necessary."]
    #[doc = "* *"]
    #[doc = "* The capacity will be increased if needed using rcutils_string_map_reserve()."]
    #[doc = "* Otherwise it is the same as rcutils_string_map_set_no_resize()."]
    #[doc = "* "]
    #[doc = "* \\see rcutils_string_map_set_no_resize()"]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_map rcutils_string_map_t to be updated"]
    #[doc = "* \\param[in] key map key, must be null terminated c string"]
    #[doc = "* \\param[in] value value for given map key, must be null terminated c string"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_set(
        string_map: *mut rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Set a key value pair in the map but only if the map has enough capacity."]
    #[doc = "* *"]
    #[doc = "* If the map already contains the given key, the existing value will be"]
    #[doc = "* replaced with the given value."]
    #[doc = "* If the map does not contain the given key, and the map has additional"]
    #[doc = "* unused capacity, then it will store the given key and value in the map."]
    #[doc = "* If there is no unused capacity in the map, then RCUTILS_RET_NOT_ENOUGH_SPACE"]
    #[doc = "* is returned."]
    #[doc = "* "]
    #[doc = "* The given key and value c strings are copied into the map, and so storage is"]
    #[doc = "* allocated for them in the map when this function is called if necessary."]
    #[doc = "* The storage allocated for this purpose is reclaimed either when"]
    #[doc = "* rcutils_string_map_fini() is called on this map or when using this function"]
    #[doc = "* or rcutils_string_map_unset()."]
    #[doc = "* "]
    #[doc = "* Any allocation that occurs in this functions uses the allocator of the map,"]
    #[doc = "* which is given when the map is initialized in rcutils_string_map_init()."]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_map rcutils_string_map_t to be updated"]
    #[doc = "* \\param[in] key map key, must be null terminated c string"]
    #[doc = "* \\param[in] value value for given map key, must be null terminated c string"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_NOT_ENOUGH_SPACE if map is full, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_set_no_resize(
        string_map: *mut rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Unset a key value pair in the map."]
    #[doc = "* *"]
    #[doc = "* The key needs to be a null terminated c string."]
    #[doc = "* If the given key is not found, RCUTILS_RET_STRING_KEY_NOT_FOUND is returned."]
    #[doc = "* "]
    #[doc = "* \\param[inout] string_map rcutils_string_map_t to be updated"]
    #[doc = "* \\param[in] key map key, must be null terminated c string"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_KEY_NOT_FOUND if key not found, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_unset(
        string_map: *mut rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get whether or not a key exists."]
    #[doc = "* *"]
    #[doc = "* The key needs to be a null terminated c string."]
    #[doc = "* "]
    #[doc = "* This function can fail and return false if the key is not found,"]
    #[doc = "* or the string_map is NULL or invalid, or if the key is NULL."]
    #[doc = "* In all cases no error message is set."]
    #[doc = "* "]
    #[doc = "* \\param[in] string_map rcutils_string_map_t to be searched"]
    #[doc = "* \\param[in] key map key, must be null terminated c string"]
    #[doc = "* \\return `true` if key is in the map, or"]
    #[doc = "* \\return `false` if key is not in the map, or"]
    #[doc = "* \\return `false` for invalid arguments, or"]
    #[doc = "* \\return `false` if the string map is invalid."]
    #[doc = "* /"]
    pub fn rcutils_string_map_key_exists(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    #[doc = " Get whether or not a key of known length exists."]
    #[doc = "* *"]
    #[doc = "* Identical to rcutils_string_map_key_exists() but without relying on key to be"]
    #[doc = "* a null terminated c string."]
    #[doc = "* "]
    #[doc = "* \\param[in] string_map rcutils_string_map_t to be searched"]
    #[doc = "* \\param[in] key map key"]
    #[doc = "* \\param[in] key_length map key length"]
    #[doc = "* \\return `true` if key is in the map, or"]
    #[doc = "* \\return `false` if key is not in the map, or"]
    #[doc = "* \\return `false` for invalid arguments, or"]
    #[doc = "* \\return `false` if the string map is invalid."]
    #[doc = "* /"]
    pub fn rcutils_string_map_key_existsn(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
        key_length: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Get value given a key."]
    #[doc = "* *"]
    #[doc = "* The key needs to be a null terminated c string."]
    #[doc = "* "]
    #[doc = "* This function can fail, and therefore return NULL, if the key is not found,"]
    #[doc = "* or the string_map is NULL or invalid, or if the key is NULL."]
    #[doc = "* In all cases no error message is set."]
    #[doc = "* "]
    #[doc = "* The returned value string is still owned by the map, and it should not be"]
    #[doc = "* modified or free'd."]
    #[doc = "* This also means that the value pointer becomes invalid if either"]
    #[doc = "* rcutils_string_map_clear() or rcutils_string_map_fini() are called or if"]
    #[doc = "* the key value pair is updated or removed with one of rcutils_string_map_set()"]
    #[doc = "* or rcutils_string_map_set_no_resize() or rcutils_string_map_unset()."]
    #[doc = "* "]
    #[doc = "* \\param[in] string_map rcutils_string_map_t to be searched"]
    #[doc = "* \\param[in] key map key, must be null terminated c string"]
    #[doc = "* \\return value for the given key if successful, or"]
    #[doc = "* \\return `NULL` for invalid arguments, or"]
    #[doc = "* \\return `NULL` if the string map is invalid, or"]
    #[doc = "* \\return `NULL` if key not found, or"]
    #[doc = "* \\return `NULL` if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_get(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get value given a key and key length."]
    #[doc = "* *"]
    #[doc = "* Identical to rcutils_string_map_get() but without relying on key to be a"]
    #[doc = "* null terminated c string."]
    #[doc = "* "]
    #[doc = "* \\param[in] string_map rcutils_string_map_t to be searched"]
    #[doc = "* \\param[in] key map key"]
    #[doc = "* \\param[in] key_length map key length"]
    #[doc = "* \\return value for the given key if successful, or"]
    #[doc = "* \\return `NULL` for invalid arguments, or"]
    #[doc = "* \\return `NULL` if the string map is invalid, or"]
    #[doc = "* \\return `NULL` if key not found, or"]
    #[doc = "* \\return `NULL` if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_getn(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
        key_length: size_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the next key in the map, unless NULL is given, then get the first key."]
    #[doc = "* *"]
    #[doc = "* This function allows you iteratively get each key in the map."]
    #[doc = "* "]
    #[doc = "* If NULL is given for the key, then the first key in the map is returned."]
    #[doc = "* If that returned key if given to the this function, then the next key in the"]
    #[doc = "* map is returned."]
    #[doc = "* If there are no more keys in the map or if the given key is not in the map,"]
    #[doc = "* NULL is returned."]
    #[doc = "* "]
    #[doc = "* The order of the keys in the map is arbitrary and if the map is modified"]
    #[doc = "* between calls to this function the behavior is undefined."]
    #[doc = "* If the map is modifeid then iteration should begin again by passing NULL to"]
    #[doc = "* get the first key again."]
    #[doc = "* "]
    #[doc = "* This function operates based on the address of the pointer, you cannot pass"]
    #[doc = "* a copy of a key to get the next key."]
    #[doc = "* "]
    #[doc = "* Example:"]
    #[doc = "* "]
    #[doc = "* ```c"]
    #[doc = "* printf(\"keys in the map:\\n\");"]
    #[doc = "* const char * current_key = rcutils_string_map_get_next_key(&map, NULL);"]
    #[doc = "* while (current_key) {"]
    #[doc = "* printf(\"  - %s\\n\", current_key);"]
    #[doc = "* current_key = rcutils_string_map_get_next_key(&map, current_key);"]
    #[doc = "* }"]
    #[doc = "* ```"]
    #[doc = "* "]
    #[doc = "* NULL can also be returned if NULL is given for the string_map or if the"]
    #[doc = "* string_map is invalid."]
    #[doc = "* "]
    #[doc = "* \\param[in] string_map rcutils_string_map_t to be queried"]
    #[doc = "* \\param[in] key NULL to get the first key or the previous key to get the next"]
    #[doc = "* \\return value for the given key if successful, or"]
    #[doc = "* \\return `NULL` for invalid arguments, or"]
    #[doc = "* \\return `NULL` if the string map is invalid, or"]
    #[doc = "* \\return `NULL` if key not found, or"]
    #[doc = "* \\return `NULL` if there are no more keys in the map, or"]
    #[doc = "* \\return `NULL` if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_get_next_key(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Copy all the key value pairs from one map into another, overwritting and resizing if needed."]
    #[doc = "* *"]
    #[doc = "* If the destination string map does not have enough storage, then it is will"]
    #[doc = "* be resized."]
    #[doc = "* If a key value pair exists in the destination map, its value will be"]
    #[doc = "* replaced with the source map's value."]
    #[doc = "* "]
    #[doc = "* It is possible for only some of the values to be copied if an error happens"]
    #[doc = "* during the copying process, e.g. if memory allocation fails."]
    #[doc = "* "]
    #[doc = "* \\param[in] src_string_map rcutils_string_map_t to be copied from"]
    #[doc = "* \\param[inout] dst_string_map rcutils_string_map_t to be copied to"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or"]
    #[doc = "* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unknown error occurs."]
    #[doc = "* /"]
    pub fn rcutils_string_map_copy(
        src_string_map: *const rcutils_string_map_t,
        dst_string_map: *mut rcutils_string_map_t,
    ) -> rcutils_ret_t;
}
#[doc = " The structure holding the metadata for a uint8 array."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_uint8_array_t {
    #[doc = " The allocated memory for the uint8 array."]
    pub buffer: *mut u8,
    #[doc = " The number of valid elements in the uint8 array."]
    pub buffer_length: size_t,
    #[doc = " The maximum capacity of the uint8 array."]
    pub buffer_capacity: size_t,
    #[doc = " The allocator used to allocate and free memory for the uint8 array."]
    pub allocator: rcutils_allocator_t,
}
#[test]
fn bindgen_test_layout_rcutils_uint8_array_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_uint8_array_t>(),
        64usize,
        concat!("Size of: ", stringify!(rcutils_uint8_array_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_uint8_array_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_uint8_array_t))
    );
    fn test_field_buffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_uint8_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_uint8_array_t),
                "::",
                stringify!(buffer)
            )
        );
    }
    test_field_buffer();
    fn test_field_buffer_length() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_uint8_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer_length) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_uint8_array_t),
                "::",
                stringify!(buffer_length)
            )
        );
    }
    test_field_buffer_length();
    fn test_field_buffer_capacity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_uint8_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer_capacity) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_uint8_array_t),
                "::",
                stringify!(buffer_capacity)
            )
        );
    }
    test_field_buffer_capacity();
    fn test_field_allocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_uint8_array_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_uint8_array_t),
                "::",
                stringify!(allocator)
            )
        );
    }
    test_field_allocator();
}
extern "C" {
    #[doc = " Return a zero initialized uint8 array struct."]
    #[doc = "* *"]
    #[doc = "* \\return rcutils_uint8_array_t a zero initialized uint8 array struct"]
    #[doc = "* /"]
    pub fn rcutils_get_zero_initialized_uint8_array() -> rcutils_uint8_array_t;
}
extern "C" {
    #[doc = " Initialize a zero initialized uint8 array struct."]
    #[doc = "* *"]
    #[doc = "* This function may leak if the uint8 array struct is already initialized."]
    #[doc = "* If the capacity is set to 0, no memory is allocated and the internal buffer"]
    #[doc = "* is still NULL."]
    #[doc = "* "]
    #[doc = "* \\param[inout] uint8_array a pointer to the to be initialized uint8 array struct"]
    #[doc = "* \\param[in] buffer_capacity the size of the memory to allocate for the byte stream"]
    #[doc = "* \\param[in] allocator the allocator to use for the memory allocation"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or"]
    #[doc = "* \\return 'RCUTILS_RET_BAD_ALLOC` if no memory could be allocated correctly"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_uint8_array_init(
        uint8_array: *mut rcutils_uint8_array_t,
        buffer_capacity: size_t,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize a uint8 array struct."]
    #[doc = "* *"]
    #[doc = "* Cleans up and deallocates any resources used in a rcutils_uint8_array_t."]
    #[doc = "* The array passed to this function needs to have been initialized by"]
    #[doc = "* rcutils_uint8_array_init()."]
    #[doc = "* Passing an uninitialized instance to this function leads to undefined"]
    #[doc = "* behavior."]
    #[doc = "* "]
    #[doc = "* \\param[in] uint8_array pointer to the rcutils_uint8_array_t to be cleaned up"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if the uint8_array argument is invalid"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_uint8_array_fini(uint8_array: *mut rcutils_uint8_array_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Resize the internal buffer of the uint8 array."]
    #[doc = "* *"]
    #[doc = "* The internal buffer of the uint8 array can be resized dynamically if needed."]
    #[doc = "* If the new size is smaller than the current capacity, then the memory is"]
    #[doc = "* truncated."]
    #[doc = "* Be aware, that this might deallocate the memory and therefore invalidates any"]
    #[doc = "* pointers to this storage."]
    #[doc = "* "]
    #[doc = "* \\param[inout] uint8_array pointer to the instance of rcutils_uint8_array_t which is"]
    #[doc = "* being resized"]
    #[doc = "* \\param[in] new_size the new size of the internal buffer"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if new_size is set to zero"]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unexpected error occurs."]
    #[doc = "* /"]
    pub fn rcutils_uint8_array_resize(
        uint8_array: *mut rcutils_uint8_array_t,
        new_size: size_t,
    ) -> rcutils_ret_t;
}
#[doc = " A single point in time, measured in nanoseconds since the Unix epoch."]
pub type rcutils_time_point_value_t = i64;
#[doc = " A duration of time, measured in nanoseconds."]
pub type rcutils_duration_value_t = i64;
extern "C" {
    #[doc = " This function returns the time from a system clock."]
    #[doc = " The closest equivalent would be to std::chrono::system_clock::now();"]
    #[doc = ""]
    #[doc = " The resolution (e.g. nanoseconds vs microseconds) is not guaranteed."]
    #[doc = ""]
    #[doc = " The now argument must point to an allocated rcutils_time_point_value_t object,"]
    #[doc = " as the result is copied into this variable."]
    #[doc = ""]
    #[doc = " <hr>"]
    #[doc = " Attribute          | Adherence"]
    #[doc = " ------------------ | -------------"]
    #[doc = " Allocates Memory   | No"]
    #[doc = " Thread-Safe        | Yes"]
    #[doc = " Uses Atomics       | No"]
    #[doc = " Lock-Free          | Yes"]
    #[doc = ""]
    #[doc = " \\param[out] now a datafield in which the current time is stored"]
    #[doc = " \\return #RCUTILS_RET_OK if the current time was successfully obtained, or"]
    #[doc = " \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or"]
    #[doc = " \\return #RCUTILS_RET_ERROR if an unspecified error occur."]
    pub fn rcutils_system_time_now(now: *mut rcutils_time_point_value_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Retrieve the current time as a rcutils_time_point_value_t object."]
    #[doc = "* *"]
    #[doc = "* This function returns the time from a monotonically increasing clock."]
    #[doc = "* The closest equivalent would be to std::chrono::steady_clock::now();"]
    #[doc = "* "]
    #[doc = "* The resolution (e.g. nanoseconds vs microseconds) is not guaranteed."]
    #[doc = "* "]
    #[doc = "* The now argument must point to an allocated rcutils_time_point_value_t object,"]
    #[doc = "* as the result is copied into this variable."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | Yes"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[out] now a struct in which the current time is stored"]
    #[doc = "* \\return #RCUTILS_RET_OK if the current time was successfully obtained, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unspecified error occur."]
    #[doc = "* /"]
    pub fn rcutils_steady_time_now(now: *mut rcutils_time_point_value_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Return a time point as nanoseconds in a string."]
    #[doc = "* *"]
    #[doc = "* The number is always fixed width, with left padding zeros up to the maximum"]
    #[doc = "* number of digits the time point can represent."]
    #[doc = "* Right now that is 19 digits (so 19 characters) for a signed 64-bit integer."]
    #[doc = "* Negative values will have a leading `-`, so they will be one character"]
    #[doc = "* longer than the positive values."]
    #[doc = "* "]
    #[doc = "* The recommended minimum size of the input string is 32 characters, but"]
    #[doc = "* 21 (` ` or `-` for sign, 19 digits, null terminator) should be sufficiently"]
    #[doc = "* large for both positive and negative values."]
    #[doc = "* If the given string is not large enough, the result will be truncated."]
    #[doc = "* If you need a string with variable width, using `snprintf()` directly is"]
    #[doc = "* recommended."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No [1]"]
    #[doc = "* Thread-Safe        | Yes"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* <i>[1] if `snprintf()` does not allocate additional memory internally</i>"]
    #[doc = "* "]
    #[doc = "* \\param[in] time_point the time to be made into a string"]
    #[doc = "* \\param[out] str the output string in which it is stored"]
    #[doc = "* \\param[in] str_size the size of the output string"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful (even if truncated), or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unspecified error occur."]
    #[doc = "* /"]
    pub fn rcutils_time_point_value_as_nanoseconds_string(
        time_point: *const rcutils_time_point_value_t,
        str_: *mut ::std::os::raw::c_char,
        str_size: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Return a time point as floating point seconds in a string."]
    #[doc = "* *"]
    #[doc = "* The number is always fixed width, with left padding zeros up to the maximum"]
    #[doc = "* number of digits for the mantissa that the time point can represent and a"]
    #[doc = "* characteristic (fractional-part) with a fixed width of 9 digits."]
    #[doc = "* Right now that means the mantissa is always 10 digits to add up to 19 total"]
    #[doc = "* for the signed 64-bit time point type."]
    #[doc = "* Negative values will have a leading `-`, so they will be one character"]
    #[doc = "* longer then positive values."]
    #[doc = "* "]
    #[doc = "* The recommended minimum size of the input string is 32 characters, but"]
    #[doc = "* 22 (` ` or `-` for sign, 19 digits, decimal point, null terminator) should"]
    #[doc = "* be sufficient for now."]
    #[doc = "* If the given string is not large enough, the result will be truncated."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No [1]"]
    #[doc = "* Thread-Safe        | Yes"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* <i>[1] if `snprintf()` does not allocate additional memory internally</i>"]
    #[doc = "* "]
    #[doc = "* \\param[in] time_point the time to be made into a string"]
    #[doc = "* \\param[out] str the output string in which it is stored"]
    #[doc = "* \\param[in] str_size the size of the output string"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful (even if truncated), or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unspecified error occur."]
    #[doc = "* /"]
    pub fn rcutils_time_point_value_as_seconds_string(
        time_point: *const rcutils_time_point_value_t,
        str_: *mut ::std::os::raw::c_char,
        str_size: size_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " The flag if the logging system has been initialized."]
    pub static mut g_rcutils_logging_initialized: bool;
}
extern "C" {
    #[doc = " Initialize the logging system using the specified allocator."]
    #[doc = "* *"]
    #[doc = "* Initialize the logging system only if it was not in an initialized state."]
    #[doc = "* "]
    #[doc = "* If an invalid allocator is passed, the initialization will fail."]
    #[doc = "* Otherwise, this function will still set the internal state to initialized"]
    #[doc = "* even if an error occurs, to avoid repeated failing initialization attempts"]
    #[doc = "* since this function is called automatically from logging macros."]
    #[doc = "* To re-attempt initialization, call rcutils_logging_shutdown() before"]
    #[doc = "* re-calling this function."]
    #[doc = "* "]
    #[doc = "* If multiple errors occur, the error code of the last error will be returned."]
    #[doc = "* "]
    #[doc = "* The `RCUTILS_CONSOLE_OUTPUT_FORMAT` environment variable can be used to set"]
    #[doc = "* the output format of messages logged to the console."]
    #[doc = "* Available tokens are:"]
    #[doc = "* - `file_name`, the full file name of the caller including the path"]
    #[doc = "* - `function_name`, the function name of the caller"]
    #[doc = "* - `line_number`, the line number of the caller"]
    #[doc = "* - `message`, the message string after it has been formatted"]
    #[doc = "* - `name`, the full logger name"]
    #[doc = "* - `severity`, the name of the severity level, e.g. `INFO`"]
    #[doc = "* - `time`, the timestamp of log message in floating point seconds"]
    #[doc = "* - `time_as_nanoseconds`, the timestamp of log message in integer nanoseconds"]
    #[doc = "* "]
    #[doc = "* The `RCUTILS_COLORIZED_OUTPUT` environment variable allows configuring if colours"]
    #[doc = "* are used or not. Available values are:"]
    #[doc = "* - `1`: Force using colours."]
    #[doc = "* - `0`: Don't use colours."]
    #[doc = "* If it is unset, colours are used depending if the target stream is a terminal or not."]
    #[doc = "* See `isatty` documentation."]
    #[doc = "* "]
    #[doc = "* The format string can use these tokens by referencing them in curly brackets,"]
    #[doc = "* e.g. `\"[{severity}] [{name}]: {message} ({function_name}() at {file_name}:{line_number})\"`."]
    #[doc = "* Any number of tokens can be used."]
    #[doc = "* The limit of the format string is 2048 characters."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] allocator rcutils_allocator_t to be used."]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if the allocator is invalid, in which"]
    #[doc = "* case initialization will fail, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if an error occurs reading the output"]
    #[doc = "* format from the `RCUTILS_CONSOLE_OUTPUT_FORMAT` environment variable, in"]
    #[doc = "* which case the default format will be used, or"]
    #[doc = "* \\return #RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID if the internal logger"]
    #[doc = "* severity level map cannot be initialized, in which case logger severity"]
    #[doc = "* levels will not be configurable."]
    #[doc = "* /"]
    pub fn rcutils_logging_initialize_with_allocator(
        allocator: rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Initialize the logging system."]
    #[doc = "* *"]
    #[doc = "* Call rcutils_logging_initialize_with_allocator() using the default allocator."]
    #[doc = "* This function is called automatically when using the logging macros."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT if an error occurs reading the output"]
    #[doc = "* format from the `RCUTILS_CONSOLE_OUTPUT_FORMAT` environment variable, in"]
    #[doc = "* which case the default format will be used, or"]
    #[doc = "* \\return #RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID if the internal logger"]
    #[doc = "* severity level map cannot be initialized, in which case logger levels"]
    #[doc = "* will not be configurable."]
    #[doc = "* /"]
    pub fn rcutils_logging_initialize() -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Shutdown the logging system."]
    #[doc = "* *"]
    #[doc = "* Free the resources allocated for the logging system."]
    #[doc = "* This puts the system into a state equivalent to being uninitialized."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID if the internal logger"]
    #[doc = "* severity level map cannot be finalized."]
    #[doc = "* /"]
    pub fn rcutils_logging_shutdown() -> rcutils_ret_t;
}
#[doc = " The structure identifying the caller location in the source code."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_log_location_t {
    #[doc = " The name of the function containing the log call."]
    pub function_name: *const ::std::os::raw::c_char,
    #[doc = " The name of the source file containing the log call."]
    pub file_name: *const ::std::os::raw::c_char,
    #[doc = " The line number containing the log call."]
    pub line_number: size_t,
}
#[test]
fn bindgen_test_layout_rcutils_log_location_t() {
    assert_eq!(
        ::std::mem::size_of::<rcutils_log_location_t>(),
        24usize,
        concat!("Size of: ", stringify!(rcutils_log_location_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_log_location_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_log_location_t))
    );
    fn test_field_function_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_log_location_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).function_name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_log_location_t),
                "::",
                stringify!(function_name)
            )
        );
    }
    test_field_function_name();
    fn test_field_file_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_log_location_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).file_name) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_log_location_t),
                "::",
                stringify!(file_name)
            )
        );
    }
    test_field_file_name();
    fn test_field_line_number() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<rcutils_log_location_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).line_number) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(rcutils_log_location_t),
                "::",
                stringify!(line_number)
            )
        );
    }
    test_field_line_number();
}
#[doc = "< The unset log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_UNSET: RCUTILS_LOG_SEVERITY = 0;
#[doc = "< The debug log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_DEBUG: RCUTILS_LOG_SEVERITY = 10;
#[doc = "< The info log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_INFO: RCUTILS_LOG_SEVERITY = 20;
#[doc = "< The warn log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_WARN: RCUTILS_LOG_SEVERITY = 30;
#[doc = "< The error log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_ERROR: RCUTILS_LOG_SEVERITY = 40;
#[doc = "< The fatal log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_FATAL: RCUTILS_LOG_SEVERITY = 50;
#[doc = " The severity levels of log messages / loggers."]
pub type RCUTILS_LOG_SEVERITY = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " The names of severity levels."]
    pub static g_rcutils_log_severity_names: [*const ::std::os::raw::c_char; 51usize];
}
extern "C" {
    #[doc = " Get a severity value from its string representation (e.g. DEBUG)."]
    #[doc = "* *"]
    #[doc = "* String representation must match one of the values in"]
    #[doc = "* `g_rcutils_log_severity_names`, but is not case-sensitive."]
    #[doc = "* Examples: UNSET, DEBUG, INFO, WARN, Error, fatal."]
    #[doc = "* "]
    #[doc = "* \\param[in] severity_string String representation of the severity, must be a"]
    #[doc = "* null terminated c string"]
    #[doc = "* \\param[in] allocator rcutils_allocator_t to be used"]
    #[doc = "* \\param[in,out] severity The severity level as a represented by the"]
    #[doc = "* `RCUTILS_LOG_SEVERITY` enum"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful, or"]
    #[doc = "* \\return #RCUTILS_RET_INVALID_ARGUMENT on invalid arguments, or"]
    #[doc = "* \\return #RCUTILS_RET_LOGGING_SEVERITY_STRING_INVALID if unable to match"]
    #[doc = "* string, or"]
    #[doc = "* \\return #RCUTILS_RET_ERROR if an unspecified error occured."]
    #[doc = "* /"]
    pub fn rcutils_logging_severity_level_from_string(
        severity_string: *const ::std::os::raw::c_char,
        allocator: rcutils_allocator_t,
        severity: *mut ::std::os::raw::c_int,
    ) -> rcutils_ret_t;
}
#[doc = " The function signature to log messages."]
#[doc = "* *"]
#[doc = "* \\param[in] location The location information about where the log came from"]
#[doc = "* \\param[in] severity The severity of the log message expressed as an integer"]
#[doc = "* \\param[in] name The name of the logger that this message came from"]
#[doc = "* \\param[in] timestamp The time at which the log message was generated"]
#[doc = "* \\param[in] format The list of arguments to insert into the formatted log message"]
#[doc = "* \\param[in] args The variable argument list"]
#[doc = "* /"]
pub type rcutils_logging_output_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rcutils_log_location_t,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: rcutils_time_point_value_t,
        arg5: *const ::std::os::raw::c_char,
        arg6: *mut va_list,
    ),
>;
extern "C" {
    #[doc = " The function pointer of the current output handler."]
    pub static mut g_rcutils_logging_output_handler: rcutils_logging_output_handler_t;
}
extern "C" {
    #[doc = " Get the current output handler."]
    #[doc = "* *"]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, provided logging system is already initialized"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\return The function pointer of the current output handler."]
    #[doc = "* /"]
    pub fn rcutils_logging_get_output_handler() -> rcutils_logging_output_handler_t;
}
extern "C" {
    #[doc = " Set the current output handler."]
    #[doc = "* *"]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, provided logging system is already initialized"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] function The function pointer of the output handler to be used."]
    #[doc = "* /"]
    pub fn rcutils_logging_set_output_handler(function: rcutils_logging_output_handler_t);
}
extern "C" {
    #[doc = " Formats a log message according to RCUTILS_CONSOLE_OUTPUT_FORMAT"]
    #[doc = "* *"]
    #[doc = "* A formatter that is meant to be used by an output handler to format a log message to the match"]
    #[doc = "* the format specified in RCUTILS_CONSOLE_OUTPUT_FORMAT by performing token replacement."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] location The location information about where the log came from"]
    #[doc = "* \\param[in] severity The severity of the log message expressed as an integer"]
    #[doc = "* \\param[in] name The name of the logger that this message came from"]
    #[doc = "* \\param[in] timestamp The time at which the log message was generated"]
    #[doc = "* \\param[in] msg The message being logged"]
    #[doc = "* \\param[out] logging_output An output buffer for the formatted message"]
    #[doc = "* \\return #RCUTILS_RET_OK if successful."]
    #[doc = "* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation error occured"]
    #[doc = "* /"]
    pub fn rcutils_logging_format_message(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        timestamp: rcutils_time_point_value_t,
        msg: *const ::std::os::raw::c_char,
        logging_output: *mut rcutils_char_array_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " The default severity level for loggers."]
    #[doc = "* *"]
    #[doc = "* This level is used for (1) nameless log calls and (2) named log"]
    #[doc = "* calls where the effective level of the logger name is unspecified."]
    #[doc = "* "]
    #[doc = "* \\see rcutils_logging_get_logger_effective_level()"]
    #[doc = "* /"]
    pub static mut g_rcutils_logging_default_logger_level: ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the default level for loggers."]
    #[doc = "* *"]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, provided logging system is already initialized"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\return The level."]
    #[doc = "* /"]
    pub fn rcutils_logging_get_default_logger_level() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the default severity level for loggers."]
    #[doc = "* *"]
    #[doc = "* If the severity level requested is `RCUTILS_LOG_SEVERITY_UNSET`, the default"]
    #[doc = "* value for the default logger (`RCUTILS_DEFAULT_LOGGER_DEFAULT_LEVEL`)"]
    #[doc = "* will be restored instead."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, provided logging system is already initialized"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] level The level to be used."]
    #[doc = "* /"]
    pub fn rcutils_logging_set_default_logger_level(level: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " Get the severity level for a logger."]
    #[doc = "* *"]
    #[doc = "* This considers the severity level of the specifed logger only."]
    #[doc = "* To get the effective level of a logger given the severity level of its"]
    #[doc = "* ancestors, see rcutils_logging_get_logger_effective_level()."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, provided logging system is already initialized"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] name The name of the logger, must be null terminated c string"]
    #[doc = "* \\return The level of the logger if it has been set, or"]
    #[doc = "* \\return `RCUTILS_LOG_SEVERITY_UNSET` if unset, or"]
    #[doc = "* \\return `g_rcutils_logging_default_logger_level` for an empty name, or"]
    #[doc = "* \\return -1 on invalid arguments, or"]
    #[doc = "* \\return -1 if an error occurred"]
    #[doc = "* /"]
    pub fn rcutils_logging_get_logger_level(
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the level for a logger and its name length."]
    #[doc = "* *"]
    #[doc = "* Identical to rcutils_logging_get_logger_level() but without"]
    #[doc = "* relying on the logger name to be a null terminated c string."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, provided logging system is already initialized"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] name The name of the logger"]
    #[doc = "* \\param[in] name_length Logger name length"]
    #[doc = "* \\return The level of the logger if it has been set, or"]
    #[doc = "* \\return `RCUTILS_LOG_SEVERITY_UNSET` if unset, or"]
    #[doc = "* \\return `g_rcutils_logging_default_logger_level` for `name_length` of `0`, or"]
    #[doc = "* \\return -1 on invalid arguments, or"]
    #[doc = "* \\return -1 if an error occurred"]
    #[doc = "* /"]
    pub fn rcutils_logging_get_logger_leveln(
        name: *const ::std::os::raw::c_char,
        name_length: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the severity level for a logger."]
    #[doc = "* *"]
    #[doc = "* If an empty string is specified as the name, the"]
    #[doc = "* `g_rcutils_logging_default_logger_level` will be set."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | Yes"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] name The name of the logger, must be null terminated c string."]
    #[doc = "* \\param[in] level The level to be used."]
    #[doc = "* \\return `RCUTILS_RET_OK` if successful, or"]
    #[doc = "* \\return `RCUTILS_RET_INVALID_ARGUMENT` on invalid arguments, or"]
    #[doc = "* \\return `RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID` if severity map invalid, or"]
    #[doc = "* \\return `RCUTILS_RET_ERROR` if an unspecified error occured"]
    #[doc = "* /"]
    pub fn rcutils_logging_set_logger_level(
        name: *const ::std::os::raw::c_char,
        level: ::std::os::raw::c_int,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Determine if a logger is enabled for a severity level."]
    #[doc = "* *"]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, provided logging system is already initialized"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] name The name of the logger, must be null terminated c string or NULL."]
    #[doc = "* \\param[in] severity The severity level."]
    #[doc = "* "]
    #[doc = "* \\return `true` if the logger is enabled for the level, or"]
    #[doc = "* \\return `false` otherwise."]
    #[doc = "* /"]
    pub fn rcutils_logging_logger_is_enabled_for(
        name: *const ::std::os::raw::c_char,
        severity: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[doc = " Determine the effective level for a logger."]
    #[doc = "* *"]
    #[doc = "* The effective level is determined as the severity level of"]
    #[doc = "* the logger if it is set, otherwise it is the first specified severity"]
    #[doc = "* level of the logger's ancestors, starting with its closest ancestor."]
    #[doc = "* The ancestor hierarchy is signified by logger names being separated by dots:"]
    #[doc = "* a logger named `x` is an ancestor of `x.y`, and both `x` and `x.y` are"]
    #[doc = "* ancestors of `x.y.z`, etc."]
    #[doc = "* If the level has not been set for the logger nor any of its"]
    #[doc = "* ancestors, the default level is used."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, provided logging system is already initialized"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] name The name of the logger, must be null terminated c string."]
    #[doc = "* "]
    #[doc = "* \\return The level, or"]
    #[doc = "* \\return -1 on invalid arguments, or"]
    #[doc = "* \\return -1 if an error occurred."]
    #[doc = "* /"]
    pub fn rcutils_logging_get_logger_effective_level(
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Log a message."]
    #[doc = "* *"]
    #[doc = "* The attributes of this function are also being influenced by the currently"]
    #[doc = "* set output handler."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No, for formatted outputs <= 1023 characters"]
    #[doc = "* | Yes, for formatted outputs >= 1024 characters"]
    #[doc = "* Thread-Safe        | No"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] location The pointer to the location struct or NULL"]
    #[doc = "* \\param[in] severity The severity level"]
    #[doc = "* \\param[in] name The name of the logger, must be null terminated c string or NULL"]
    #[doc = "* \\param[in] format The format string"]
    #[doc = "* \\param[in] ... The variable arguments"]
    #[doc = "* /"]
    pub fn rcutils_log(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    #[doc = " The default output handler outputs log messages to the standard streams."]
    #[doc = "* *"]
    #[doc = "* The messages with a severity level `DEBUG` and `INFO` are written to `stdout`."]
    #[doc = "* The messages with a severity level `WARN`, `ERROR`, and `FATAL` are written"]
    #[doc = "* to `stderr`."]
    #[doc = "* The console output format of the logged message can be configured through"]
    #[doc = "* the `RCUTILS_CONSOLE_OUTPUT_FORMAT` environment variable: see"]
    #[doc = "* rcutils_logging_initialize_with_allocator() for details."]
    #[doc = "* For configuring if using colours or not, `RCUTILS_COLORIZED_OUTPUT` can be used:"]
    #[doc = "* see rcutils_logging_initialize_with_allocator() for details."]
    #[doc = "* "]
    #[doc = "* <hr>"]
    #[doc = "* Attribute          | Adherence"]
    #[doc = "* ------------------ | -------------"]
    #[doc = "* Allocates Memory   | No"]
    #[doc = "* Thread-Safe        | Yes, if the underlying *printf functions are"]
    #[doc = "* Uses Atomics       | No"]
    #[doc = "* Lock-Free          | Yes"]
    #[doc = "* "]
    #[doc = "* \\param[in] location The pointer to the location struct or NULL"]
    #[doc = "* \\param[in] severity The severity level"]
    #[doc = "* \\param[in] name The name of the logger, must be null terminated c string"]
    #[doc = "* \\param[in] timestamp The timestamp for when the log message was made"]
    #[doc = "* \\param[in] format The format string"]
    #[doc = "* \\param[in] args The `va_list` used by the logger"]
    #[doc = "* /"]
    pub fn rcutils_logging_console_output_handler(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        timestamp: rcutils_time_point_value_t,
        format: *const ::std::os::raw::c_char,
        args: *mut va_list,
    );
}
pub const rmw_qos_policy_kind_t_RMW_QOS_POLICY_INVALID: rmw_qos_policy_kind_t = 1;
pub const rmw_qos_policy_kind_t_RMW_QOS_POLICY_DURABILITY: rmw_qos_policy_kind_t = 2;
