/* automatically generated by rust-bindgen 0.69.4 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const RCUTILS_HAS_NONNULL: u32 = 1;
pub const RCUTILS_RET_OK: u32 = 0;
pub const RCUTILS_RET_WARN: u32 = 1;
pub const RCUTILS_RET_ERROR: u32 = 2;
pub const RCUTILS_RET_BAD_ALLOC: u32 = 10;
pub const RCUTILS_RET_INVALID_ARGUMENT: u32 = 11;
pub const RCUTILS_RET_NOT_ENOUGH_SPACE: u32 = 12;
pub const RCUTILS_RET_NOT_INITIALIZED: u32 = 13;
pub const RCUTILS_RET_NOT_FOUND: u32 = 14;
pub const RCUTILS_RET_STRING_MAP_ALREADY_INIT: u32 = 30;
pub const RCUTILS_RET_STRING_MAP_INVALID: u32 = 31;
pub const RCUTILS_RET_STRING_KEY_NOT_FOUND: u32 = 32;
pub const RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID: u32 = 40;
pub const RCUTILS_RET_LOGGING_SEVERITY_STRING_INVALID: u32 = 41;
pub const RCUTILS_RET_HASH_MAP_NO_MORE_ENTRIES: u32 = 50;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;

pub const RCL_RET_INVALID_PARAM_RULE: u32 = 1010;
pub const RCL_RET_INVALID_LOG_LEVEL_RULE: u32 = 1020;
pub const RCL_RET_EVENT_INVALID: u32 = 2000;
pub const RCL_RET_EVENT_TAKE_FAILED: u32 = 2001;
pub const RCL_RET_LIFECYCLE_STATE_REGISTERED: u32 = 3000;
pub const RCL_RET_LIFECYCLE_STATE_NOT_REGISTERED: u32 = 3001;
pub const RCL_ROS_ARGS_FLAG: &[u8; 11] = b"--ros-args\0";
pub const RCL_ROS_ARGS_EXPLICIT_END_TOKEN: &[u8; 3] = b"--\0";
pub const RCL_PARAM_FLAG: &[u8; 8] = b"--param\0";
pub const RCL_SHORT_PARAM_FLAG: &[u8; 3] = b"-p\0";
pub const RCL_PARAM_FILE_FLAG: &[u8; 14] = b"--params-file\0";
pub const RCL_REMAP_FLAG: &[u8; 8] = b"--remap\0";
pub const RCL_SHORT_REMAP_FLAG: &[u8; 3] = b"-r\0";
pub const RCL_ENCLAVE_FLAG: &[u8; 10] = b"--enclave\0";
pub const RCL_SHORT_ENCLAVE_FLAG: &[u8; 3] = b"-e\0";
pub const RCL_LOG_LEVEL_FLAG: &[u8; 12] = b"--log-level\0";
pub const RCL_EXTERNAL_LOG_CONFIG_FLAG: &[u8; 18] = b"--log-config-file\0";
pub const RCL_LOG_STDOUT_FLAG_SUFFIX: &[u8; 12] = b"stdout-logs\0";
pub const RCL_LOG_ROSOUT_FLAG_SUFFIX: &[u8; 12] = b"rosout-logs\0";
pub const RCL_LOG_EXT_LIB_FLAG_SUFFIX: &[u8; 18] = b"external-lib-logs\0";
pub const __alignas_is_defined: u32 = 1;
pub const __alignof_is_defined: u32 = 1;
pub const RCL_DEFAULT_DOMAIN_ID: i32 = -1;
pub const RCL_NODE_OPTIONS_DEFAULT_DOMAIN_ID: i32 = -1;
pub const RCUTILS_SHA256_BLOCK_SIZE: u32 = 32;
pub const ROSIDL_TYPE_HASH_VERSION_UNSET: u32 = 0;
pub const ROSIDL_TYPE_HASH_SIZE: u32 = 32;
pub const _UCHAR_H: u32 = 1;
pub const __mbstate_t_defined: u32 = 1;
pub const ROSIDL_DYNAMIC_TYPESUPPORT_SEQUENCE_TYPE_DELIMITER: u32 = 48;
pub const ROSIDL_DYNAMIC_TYPESUPPORT_ARRAY_OFFSET: u32 = 48;
pub const ROSIDL_DYNAMIC_TYPESUPPORT_UNBOUNDED_SEQUENCE_OFFSET: u32 = 96;
pub const ROSIDL_DYNAMIC_TYPESUPPORT_BOUNDED_SEQUENCE_OFFSET: u32 = 144;
pub const RCL_SERVICE_INTROSPECTION_TOPIC_POSTFIX: &[u8; 16] = b"/_service_event\0";
pub const RCL_RET_ACTION_NAME_INVALID: u32 = 2000;
pub const RCL_RET_ACTION_GOAL_ACCEPTED: u32 = 2100;
pub const RCL_RET_ACTION_GOAL_REJECTED: u32 = 2101;
pub const RCL_RET_ACTION_CLIENT_INVALID: u32 = 2102;
pub const RCL_RET_ACTION_CLIENT_TAKE_FAILED: u32 = 2103;
pub const RCL_RET_ACTION_SERVER_INVALID: u32 = 2200;
pub const RCL_RET_ACTION_SERVER_TAKE_FAILED: u32 = 2201;
pub const RCL_RET_ACTION_GOAL_HANDLE_INVALID: u32 = 2300;
pub const RCL_RET_ACTION_GOAL_EVENT_INVALID: u32 = 2301;
pub const UUID_SIZE: u32 = 16;
pub const GOAL_STATE_NUM_STATES: u32 = 7;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
#[doc = " The type that holds a return value for an rcutils operation."]
pub type rcutils_ret_t = ::std::os::raw::c_int;
#[doc = " Encapsulation of an allocator.\n**\n* The default allocator uses malloc(), free(), calloc(), and realloc().\n* It can be obtained using rcutils_get_default_allocator().\n*\n* The allocator should be trivially copyable.\n* Meaning that the struct should continue to work after being assignment\n* copied into a new struct.\n* Specifically the object pointed to by the state pointer should remain valid\n* until all uses of the allocator have been made.\n* Particular care should be taken when giving an allocator to functions like\n* rcutils_*_init() where it is stored within another object and used later.\n* Developers should note that, while the fields of a const-qualified allocator\n* struct cannot be modified, the state of the allocator can be modified.\n*/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_allocator_s {
    #[doc = " Allocate memory, given a size and the `state` pointer.\n** An error should be indicated by returning `NULL`. */"]
    pub allocate: ::std::option::Option<
        unsafe extern "C" fn(
            size: usize,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Deallocate previously allocated memory, mimicking free().\n** Also takes the `state` pointer. */"]
    pub deallocate: ::std::option::Option<
        unsafe extern "C" fn(
            pointer: *mut ::std::os::raw::c_void,
            state: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Reallocate if possible, otherwise it deallocates and allocates.\n**\n* Also takes the `state` pointer.\n*\n* If unsupported then do deallocate and then allocate.\n* This should behave as realloc() does, as opposed to posix's\n* [reallocf](https://linux.die.net/man/3/reallocf), i.e. the memory given\n* by pointer will not be free'd automatically if realloc() fails.\n* For reallocf-like behavior use rcutils_reallocf().\n* This function must be able to take an input pointer of `NULL` and succeed.\n*/"]
    pub reallocate: ::std::option::Option<
        unsafe extern "C" fn(
            pointer: *mut ::std::os::raw::c_void,
            size: usize,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Allocate memory with all elements set to zero, given a number of elements and their size.\n** An error should be indicated by returning `NULL`. */"]
    pub zero_allocate: ::std::option::Option<
        unsafe extern "C" fn(
            number_of_elements: usize,
            size_of_element: usize,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Implementation defined state storage.\n**\n* This is passed as the final parameter to other allocator functions.\n* Note that the contents of the state can be modified even in const-qualified\n* allocator objects.\n*/"]
    pub state: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rcutils_allocator_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_allocator_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_allocator_s>(),
        40usize,
        concat!("Size of: ", stringify!(rcutils_allocator_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_allocator_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_allocator_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_allocator_s),
            "::",
            stringify!(allocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deallocate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_allocator_s),
            "::",
            stringify!(deallocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reallocate) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_allocator_s),
            "::",
            stringify!(reallocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zero_allocate) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_allocator_s),
            "::",
            stringify!(zero_allocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_allocator_s),
            "::",
            stringify!(state)
        )
    );
}
#[doc = " Encapsulation of an allocator.\n**\n* The default allocator uses malloc(), free(), calloc(), and realloc().\n* It can be obtained using rcutils_get_default_allocator().\n*\n* The allocator should be trivially copyable.\n* Meaning that the struct should continue to work after being assignment\n* copied into a new struct.\n* Specifically the object pointed to by the state pointer should remain valid\n* until all uses of the allocator have been made.\n* Particular care should be taken when giving an allocator to functions like\n* rcutils_*_init() where it is stored within another object and used later.\n* Developers should note that, while the fields of a const-qualified allocator\n* struct cannot be modified, the state of the allocator can be modified.\n*/"]
pub type rcutils_allocator_t = rcutils_allocator_s;
extern "C" {
    #[doc = " Return a zero initialized allocator.\n**\n* Note that this is an invalid allocator and should only be used as a placeholder.\n*/"]
    pub fn rcutils_get_zero_initialized_allocator() -> rcutils_allocator_t;
}
extern "C" {
    #[doc = " Return a properly initialized rcutils_allocator_t with default values.\n**\n* This defaults to:\n*\n* - allocate = wraps malloc()\n* - deallocate = wraps free()\n* - reallocate = wraps realloc()\n* - zero_allocate = wraps calloc()\n* - state = `NULL`\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | Yes\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*/"]
    pub fn rcutils_get_default_allocator() -> rcutils_allocator_t;
}
extern "C" {
    #[doc = " Return true if the given allocator has non-null function pointers.\n**\n* \\param[in] allocator to be checked by the function\n* \\return `true` if the allocator is valid, `false` otherwise.\n*/"]
    pub fn rcutils_allocator_is_valid(allocator: *const rcutils_allocator_t) -> bool;
}
extern "C" {
    #[doc = " Emulate the behavior of [reallocf](https://linux.die.net/man/3/reallocf).\n**\n* This function will return `NULL` if the allocator is `NULL` or has `NULL` for\n* function pointer fields.\n* \\param[inout] pointer to the memory which will be reallocated\n* \\param[in] size in bytes\n* \\param[in] allocator to be used to allocate and deallocate memory\n*/"]
    pub fn rcutils_reallocf(
        pointer: *mut ::std::os::raw::c_void,
        size: usize,
        allocator: *mut rcutils_allocator_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Encapsulation of an allocator.\n**\n* \\sa rcutils_allocator_t\n*/"]
pub type rcl_allocator_t = rcutils_allocator_t;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[doc = " Return code for rmw functions"]
pub type rmw_ret_t = i32;
#[doc = " The discovery range has not been set"]
pub const rmw_automatic_discovery_range_e_RMW_AUTOMATIC_DISCOVERY_RANGE_NOT_SET:
    rmw_automatic_discovery_range_e = 0;
#[doc = " Force discovery off"]
pub const rmw_automatic_discovery_range_e_RMW_AUTOMATIC_DISCOVERY_RANGE_OFF:
    rmw_automatic_discovery_range_e = 1;
#[doc = " Allows discovering nodes on the same host"]
pub const rmw_automatic_discovery_range_e_RMW_AUTOMATIC_DISCOVERY_RANGE_LOCALHOST:
    rmw_automatic_discovery_range_e = 2;
#[doc = " Allows discovering nodes on the same subnet"]
pub const rmw_automatic_discovery_range_e_RMW_AUTOMATIC_DISCOVERY_RANGE_SUBNET:
    rmw_automatic_discovery_range_e = 3;
#[doc = " Use discovery settings configured directly with the middleware"]
pub const rmw_automatic_discovery_range_e_RMW_AUTOMATIC_DISCOVERY_RANGE_SYSTEM_DEFAULT:
    rmw_automatic_discovery_range_e = 4;
#[doc = " Used to control the range that nodes will be discovered"]
pub type rmw_automatic_discovery_range_e = ::std::os::raw::c_uint;
#[doc = " Used to control the range that nodes will be discovered"]
pub use self::rmw_automatic_discovery_range_e as rmw_automatic_discovery_range_t;
#[doc = " Struct to typedef some of the peer addresses"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_peer_address_s {
    pub peer_address: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_rmw_peer_address_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_peer_address_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_peer_address_s>(),
        256usize,
        concat!("Size of: ", stringify!(rmw_peer_address_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_peer_address_s>(),
        1usize,
        concat!("Alignment of ", stringify!(rmw_peer_address_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).peer_address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_peer_address_s),
            "::",
            stringify!(peer_address)
        )
    );
}
#[doc = " Struct to typedef some of the peer addresses"]
pub type rmw_peer_address_t = rmw_peer_address_s;
#[doc = " Used to specify the options that control how discovery is performed"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_discovery_options_s {
    #[doc = " How far to allow discovering nodes\n**\n* This needs to be set to something other than RMW_AUTOMATIC_DISCOVERY_RANGE_NOT_SET,\n* because that is just a sentinel value to see if this was set, but rmw\n* implementations should error if this is what is given during context init.\n*/"]
    pub automatic_discovery_range: rmw_automatic_discovery_range_t,
    #[doc = " The list of manually-specified peers to perform static discovery with\n**\n* Each peer is specified as a hostname or an IP address (IPv4 and IPv6 are both acceptable), or\n* a subnet, e.g. 192.168.0.0/24.\n*/"]
    pub static_peers: *mut rmw_peer_address_t,
    #[doc = " The number of manually-specified peers"]
    pub static_peers_count: usize,
    #[doc = " The allocator used to allocate static_peers"]
    pub allocator: rcutils_allocator_t,
}
#[test]
fn bindgen_test_layout_rmw_discovery_options_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_discovery_options_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_discovery_options_s>(),
        64usize,
        concat!("Size of: ", stringify!(rmw_discovery_options_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_discovery_options_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_discovery_options_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).automatic_discovery_range) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_discovery_options_s),
            "::",
            stringify!(automatic_discovery_range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).static_peers) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_discovery_options_s),
            "::",
            stringify!(static_peers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).static_peers_count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_discovery_options_s),
            "::",
            stringify!(static_peers_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_discovery_options_s),
            "::",
            stringify!(allocator)
        )
    );
}
#[doc = " Used to specify the options that control how discovery is performed"]
pub type rmw_discovery_options_t = rmw_discovery_options_s;
extern "C" {
    #[doc = " Return a zero-initialized discovery options structure."]
    pub fn rmw_get_zero_initialized_discovery_options() -> rmw_discovery_options_t;
}
extern "C" {
    #[doc = " Initialize a discovery options structure with a set number of static peers.\n**\n* This function initializes rmw_discovery_options_t with space for a set number of static peers.\n*\n* \\param[in] discovery_options Pointer to a zero initialized option structure to be initialized on\n* success, but left unchanged on failure.\n* \\param[in] size Number of static peers to allocate space for.\n* \\param[in] allocator Allocator to be used to allocate memory.\n* \\returns `RMW_RET_OK` if successful, or\n* \\returns `RMW_RET_INVALID_ARGUMENT` if `discovery_options` is NULL, or\n* \\returns `RMW_RET_INVALID_ARGUMENT` if `discovery_options` is not\n*   zero initialized, or\n* \\returns `RMW_RET_INVALID_ARGUMENT` if `allocator` is invalid,\n*   by rcutils_allocator_is_valid() definition, or\n* \\returns `RMW_BAD_ALLOC` if memory allocation fails, or\n* \\returns `RMW_RET_ERROR` when an unspecified error occurs.\n* \\remark This function sets the RMW error state on failure.\n*/"]
    pub fn rmw_discovery_options_init(
        discovery_options: *mut rmw_discovery_options_t,
        size: usize,
        allocator: *mut rcutils_allocator_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Compare two discovery parameter instances for equality.\n**\n* Equality means the automatic_discovery_range values are equal, they have the same\n* static_peers_count value, and each entry in static_peers is evaluated as\n* equal using strncmp.\n*\n* NOTE: If the two parameter structs list the static peers in different orders\n* then this will evaulate as NOT equal.\n*\n* \\param[in] left - The first set of options to compare\n* \\param[in] right - The second set of options to compare\n* \\param[out] result - The result of the calculation.\n*\n* \\return RMW_RET_OK when the input arguments are valid.\n* \\return RMW_RET_INVALID_ARGUMENT will be returned when any input is a nullptr,\n* or if something in either struct was malformed, such as static_peers being\n* a nullptr while static_peers_count is non-zero.\n*/"]
    pub fn rmw_discovery_options_equal(
        left: *const rmw_discovery_options_t,
        right: *const rmw_discovery_options_t,
        result: *mut bool,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Perform a deep copy of the discovery options from src into dst using the\n given allocator.\n**\n* The dst will be left with an owned copy of the static peers array whose\n* string values match the src.\n* If successful, src and dst will evaluate as equal using\n* rmw_discovery_options_equal.\n*\n* \\param[in] src discovery options to be copied.\n* \\param[in] allocator to use.\n* \\param[out] dst Destination options to use.\n* \\return RMW_RET_OK if success.\n* \\return RMW_RET_INVALID_ARGUMENT if either the src, allocator or dst is null, or\n* \\return RMW_RET_INVALID_ARUGMENT if src and dst are the same object.\n* \\return RMW_RET_BAD_ALLOC if allocation fails.\n*/"]
    pub fn rmw_discovery_options_copy(
        src: *const rmw_discovery_options_t,
        allocator: *mut rcutils_allocator_t,
        dst: *mut rmw_discovery_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Destructor for rmw_discovery_options_t\n**\n* \\param[in] discovery_options to destroy\n* \\param[in] allocator to be used for destruction.\n* \\return RMW_RET_OK if success.\n* \\return RMW_RET_INVALID_ARGUMENT if allocator is invalid\n* or discovery_options is null.\n*/"]
    pub fn rmw_discovery_options_fini(discovery_options: *mut rmw_discovery_options_t)
        -> rmw_ret_t;
}
#[doc = " Uses ROS_LOCALHOST_ONLY environment variable."]
pub const rmw_localhost_only_e_RMW_LOCALHOST_ONLY_DEFAULT: rmw_localhost_only_e = 0;
#[doc = " Forces using only localhost."]
pub const rmw_localhost_only_e_RMW_LOCALHOST_ONLY_ENABLED: rmw_localhost_only_e = 1;
#[doc = " Forces disabling localhost only."]
pub const rmw_localhost_only_e_RMW_LOCALHOST_ONLY_DISABLED: rmw_localhost_only_e = 2;
#[doc = " Used to specify if the context can only communicate through localhost."]
pub type rmw_localhost_only_e = ::std::os::raw::c_uint;
#[doc = " Used to specify if the context can only communicate through localhost."]
pub use self::rmw_localhost_only_e as rmw_localhost_only_t;
pub const rmw_security_enforcement_policy_e_RMW_SECURITY_ENFORCEMENT_PERMISSIVE:
    rmw_security_enforcement_policy_e = 0;
pub const rmw_security_enforcement_policy_e_RMW_SECURITY_ENFORCEMENT_ENFORCE:
    rmw_security_enforcement_policy_e = 1;
pub type rmw_security_enforcement_policy_e = ::std::os::raw::c_uint;
pub use self::rmw_security_enforcement_policy_e as rmw_security_enforcement_policy_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_security_options_s {
    pub enforce_security: rmw_security_enforcement_policy_t,
    pub security_root_path: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_rmw_security_options_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_security_options_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_security_options_s>(),
        16usize,
        concat!("Size of: ", stringify!(rmw_security_options_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_security_options_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_security_options_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enforce_security) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_security_options_s),
            "::",
            stringify!(enforce_security)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).security_root_path) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_security_options_s),
            "::",
            stringify!(security_root_path)
        )
    );
}
pub type rmw_security_options_t = rmw_security_options_s;
extern "C" {
    #[doc = " Get zero initialized security options."]
    pub fn rmw_get_zero_initialized_security_options() -> rmw_security_options_t;
}
extern "C" {
    #[doc = " Get default initialized security options."]
    pub fn rmw_get_default_security_options() -> rmw_security_options_t;
}
extern "C" {
    #[doc = " Copy the given security options.\n**\n* \\param[in] src security options to be copied.\n* \\param[in] allocator allocator used when copying data to the new security options.\n* \\param[out] dst security options to be set.\n* \\returns RMW_RET_BAD_ALLOC, or\n* \\returns RMW_RET_OK\n*/"]
    pub fn rmw_security_options_copy(
        src: *const rmw_security_options_t,
        allocator: *const rcutils_allocator_t,
        dst: *mut rmw_security_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Set the security root path for the given security options.\n**\n* The provided `security_root_path` will be copied into allocated memory.\n*\n* \\param[in] security_root_path path to be set.\n* \\param[in] allocator allocator used to allocate the new path.\n* \\param[inout] security_options security options to be set.\n* \\returns RMW_RET_BAD_ALLOC, or\n* \\returns RMW_RET_OK\n*/"]
    pub fn rmw_security_options_set_root_path(
        security_root_path: *const ::std::os::raw::c_char,
        allocator: *const rcutils_allocator_t,
        security_options: *mut rmw_security_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Finalize the given security_options.\n**\n* \\param[in] security_options security options to be finalized.\n* \\param[in] allocator allocator used to deallocate the root path.\n* \\returns RMW_RET_ERROR, or\n* \\returns RMW_RET_OK\n*/"]
    pub fn rmw_security_options_fini(
        security_options: *mut rmw_security_options_t,
        allocator: *const rcutils_allocator_t,
    ) -> rmw_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_init_options_impl_s {
    _unused: [u8; 0],
}
#[doc = " Implementation defined options structure used during rmw_init().\n**\n* This should be defined by the rmw implementation.\n*/"]
pub type rmw_init_options_impl_t = rmw_init_options_impl_s;
#[doc = " Options structure used during rmw_init()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_init_options_s {
    #[doc = " Locally (process local) unique ID that represents this init/shutdown cycle.\n**\n* This should be set by the caller of `rmw_init()` to a number that is\n* unique within this process.\n* It is designed to be used with `rcl_init()` and `rcl_get_instance_id()`.\n*/"]
    pub instance_id: u64,
    #[doc = " Implementation identifier, used to ensure two different implementations are not being mixed."]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " ROS domain id"]
    pub domain_id: usize,
    #[doc = " Security options"]
    pub security_options: rmw_security_options_t,
    #[doc = " Enable localhost only"]
    pub localhost_only: rmw_localhost_only_t,
    #[doc = " Configure discovery"]
    pub discovery_options: rmw_discovery_options_t,
    #[doc = " Enclave, name used to find security artifacts in a sros2 keystore."]
    pub enclave: *mut ::std::os::raw::c_char,
    #[doc = " Allocator used during internal allocation of init options, if needed."]
    pub allocator: rcutils_allocator_t,
    #[doc = " Implementation defined init options.\n** May be NULL if there are no implementation defined options. */"]
    pub impl_: *mut rmw_init_options_impl_t,
}
#[test]
fn bindgen_test_layout_rmw_init_options_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_init_options_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_init_options_s>(),
        168usize,
        concat!("Size of: ", stringify!(rmw_init_options_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_init_options_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_init_options_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instance_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(instance_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domain_id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(domain_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).security_options) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(security_options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).localhost_only) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(localhost_only)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).discovery_options) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(discovery_options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enclave) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(enclave)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(allocator)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_init_options_s),
            "::",
            stringify!(impl_)
        )
    );
}
#[doc = " Options structure used during rmw_init()."]
pub type rmw_init_options_t = rmw_init_options_s;
extern "C" {
    #[doc = " Return a zero initialized init options structure."]
    pub fn rmw_get_zero_initialized_init_options() -> rmw_init_options_t;
}
extern "C" {
    #[doc = " Initialize given init options with the default values and implementation specific values.\n**\n* The given allocator is used, if required, during setup of the init options,\n* but is also used during initialization.\n*\n* In either case the given allocator is stored in the returned init options.\n*\n* The `impl` pointer should not be changed manually.\n*\n* \\pre The given init options must be zero initialized.\n*\n* \\post If initialization fails, init options will remain zero initialized.\n*\n* \\remark Giving an already initialized init options will result\n*   in a failure with return code `RMW_RET_INVALID_ARGUMENT`.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | Yes\n* Lock-Free          | Yes\n*\n* This should be defined by the rmw implementation.\n*\n* \\param[inout] init_options object to be setup\n* \\param[in] allocator to be used during setup and during initialization\n* \\return `RMW_RET_OK` if setup is successful, or\n* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or\n* \\return `RMW_RET_BAD_ALLOC` if allocating memory failed, or\n* \\return `RMW_RET_ERROR` if an unspecified error occurs.\n*/"]
    pub fn rmw_init_options_init(
        init_options: *mut rmw_init_options_t,
        allocator: rcutils_allocator_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Copy the given source init options to the destination init options.\n**\n* The allocator from the source is used for any allocations and stored in the\n* destination.\n*\n* \\pre The source init options must have been initialized\n*   i.e. had `rmw_init_options_init()` called on.\n* \\pre The destination init options must be zero initialized.\n*\n* \\post If copy fails, destination init options will remain zero initialized.\n*\n* \\remark Giving an zero initialized init options as a source will result\n*   in a failure with return code `RMW_RET_INVALID_ARGUMENT`.\n* \\remark Giving an already initialized init options for the destination will result\n*   in a failure with return code `RMW_RET_INVALID_ARGUMENT`.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | Yes\n* Lock-Free          | Yes\n*\n* This should be defined by the rmw implementation.\n*\n* \\param[in] src rcl_init_options_t object to be copied from\n* \\param[out] dst rcl_init_options_t object to be copied into\n* \\return `RMW_RET_OK` if the copy is successful, or\n* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation\n*   identifier for src does not match the implementation of this function, or\n* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or\n* \\return `RMW_RET_BAD_ALLOC` if allocating memory failed, or\n* \\return `RMW_RET_ERROR` if an unspecified error occurs.\n*/"]
    pub fn rmw_init_options_copy(
        src: *const rmw_init_options_t,
        dst: *mut rmw_init_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Finalize the given init options.\n**\n* This function will return early if a logical error, such as `RMW_RET_INVALID_ARGUMENT`\n* or `RMW_RET_INCORRECT_RMW_IMPLEMENTATION`, ensues, leaving the given init options\n* unchanged.\n* Otherwise, it will proceed despite errors, freeing as much resources as it can and zero\n* initializing the given init options.\n*\n* \\pre The given init options must have been initialized\n*   i.e. had `rmw_init_options_init()` called on.\n*\n* \\remarks If init options are zero initialized,\n*   then `RMW_RET_INVALID_ARGUMENT` is returned.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | Yes\n* Lock-Free          | Yes\n*\n* This should be defined by the rmw implementation.\n*\n* \\param[inout] init_options object to finalized\n* \\return `RMW_RET_OK` if finalization is successful, or\n* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or\n* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation\n*   identifier does not match the implementation of this function, or\n* \\return `RMW_RET_ERROR` if an unspecified error occurs.\n*/"]
    pub fn rmw_init_options_fini(init_options: *mut rmw_init_options_t) -> rmw_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_context_impl_s {
    _unused: [u8; 0],
}
#[doc = " Implementation defined context structure returned by rmw_init().\n**\n* This should be defined by the rmw implementation.\n*/"]
pub type rmw_context_impl_t = rmw_context_impl_s;
#[doc = " Initialization context structure which is used to store init specific information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_context_s {
    #[doc = " Locally (process local) unique ID that represents this init/shutdown cycle."]
    pub instance_id: u64,
    #[doc = " Implementation identifier, used to ensure two different implementations are not being mixed."]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Options used to initialize the context."]
    pub options: rmw_init_options_t,
    #[doc = " Domain id that is being used."]
    pub actual_domain_id: usize,
    #[doc = " Implementation defined context information.\n** May be NULL if there is no implementation defined context information. */"]
    pub impl_: *mut rmw_context_impl_t,
}
#[test]
fn bindgen_test_layout_rmw_context_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_context_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_context_s>(),
        200usize,
        concat!("Size of: ", stringify!(rmw_context_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_context_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_context_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instance_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_context_s),
            "::",
            stringify!(instance_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_context_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_context_s),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actual_domain_id) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_context_s),
            "::",
            stringify!(actual_domain_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_context_s),
            "::",
            stringify!(impl_)
        )
    );
}
#[doc = " Initialization context structure which is used to store init specific information."]
pub type rmw_context_t = rmw_context_s;
extern "C" {
    #[doc = " Return a zero initialized context structure."]
    pub fn rmw_get_zero_initialized_context() -> rmw_context_t;
}
extern "C" {
    #[doc = " Initialize the middleware with the given options, and yielding an context.\n**\n* Context is filled with middleware specific data upon success of this function.\n* The context is used when initializing some entities like nodes and\n* guard conditions, and is also required to properly call `rmw_shutdown()`.\n*\n* \\pre The given options must have been initialized\n*   i.e. `rmw_init_options_init()` called on it and\n*   an enclave set.\n* \\pre The given context must be zero initialized.\n*\n* \\post If initialization fails, context will remain zero initialized.\n* \\post `context->actual_domain_id` will be set with the domain id the rmw implementation is using.\n*  This matches `options->domain_id` if it is not RMW_DEFAULT_DOMAIN_ID.\n*  In other case, the value is rmw implementation dependent.\n*\n* \\remarks If options are zero-initialized, then `RMW_RET_INVALID_ARGUMENT` is returned.\n*   If options are initialized but no enclave is provided, then `RMW_RET_INVALID_ARGUMENT`\n*   is returned.\n*   If context has been already initialized (`rmw_init()` was called on it), then\n*   `RMW_RET_INVALID_ARGUMENT` is returned.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* This should be defined by the rmw implementation.\n*\n* \\param[in] options initialization options to be used during initialization\n* \\param[out] context resulting context struct\n* \\return `RMW_RET_OK` if successful, or\n* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or\n* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation\n*   identifier does not match, or\n* \\return `RMW_RET_ERROR` if an unexpected error occurs.\n*/"]
    pub fn rmw_init(options: *const rmw_init_options_t, context: *mut rmw_context_t) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Shutdown the middleware for a given context.\n**\n* \\pre The given context must be a valid context which has been initialized with `rmw_init()`.\n*\n* \\remarks If context is zero initialized, then `RMW_RET_INVALID_ARGUMENT` is returned.\n*   If context has been already invalidated (`rmw_shutdown()` was called on it), then\n*   this function is a no-op and `RMW_RET_OK` is returned.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* This should be defined by the rmw implementation.\n*\n* \\param[in] context resulting context struct\n* \\return `RMW_RET_OK` if successful, or\n* \\return `RMW_RET_INVALID_ARGUMENT` if any argument are invalid, or\n* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation\n*   identifier does not match, or\n* \\return `RMW_RET_ERROR` if an unexpected error occurs.\n*/"]
    pub fn rmw_shutdown(context: *mut rmw_context_t) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Finalize a context.\n**\n* This function will return early if a logical error, such as `RMW_RET_INVALID_ARGUMENT`\n* or `RMW_RET_INCORRECT_RMW_IMPLEMENTATION`, ensues, leaving the given context unchanged.\n* Otherwise, it will proceed despite errors, freeing as much resources as it can and zero\n* initializing the given context.\n*\n* \\pre The context to be finalized must have been previously initialized with\n*   `rmw_init()`, and then later invalidated with `rmw_shutdown()`.\n*\n* \\remarks If context is zero initialized, then `RMW_RET_INVALID_ARGUMENT` is returned.\n*   If context is initialized and valid (`rmw_shutdown()` was not called on it), then\n*   `RMW_RET_INVALID_ARGUMENT` is returned.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | Yes\n* Lock-Free          | Yes [1]\n* <i>[1] if `atomic_is_lock_free()` returns true for `atomic_uint_least64_t`</i>\n*\n* This should be defined by the rmw implementation.\n*\n* \\return `RMW_RET_OK` if successful, or\n* \\return `RMW_RET_INVALID_ARGUMENT` if any arguments are invalid, or\n* \\return `RMW_RET_INCORRECT_RMW_IMPLEMENTATION` if the implementation\n*   identifier does not match, or\n* \\return `RMW_RET_ERROR` if an unspecified error occur.\n*/"]
    pub fn rmw_context_fini(context: *mut rmw_context_t) -> rmw_ret_t;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __assert_fail(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    ) -> !;
}
extern "C" {
    pub fn __assert_perror_fail(
        __errnum: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    ) -> !;
}
extern "C" {
    pub fn __assert(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_int,
    ) -> !;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::std::mem::MaybeUninit<div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::std::mem::MaybeUninit<__once_flag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    const UNINIT: ::std::mem::MaybeUninit<random_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    const UNINIT: ::std::mem::MaybeUninit<drand48_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__c) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__init) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__a) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: usize,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Format a string.\n**\n* This function just wraps snprintf() as defined in C11 in a portable way.\n*\n* On Windows this defaults to the _TRUNCATE behavior of _snprintf_s(), but\n* only returns -1 if errno is not 0.\n* Unlike _snprintf_s() which returns -1 when truncation occurs, this function\n* behaves like snprintf() (http://en.cppreference.com/w/cpp/io/c/fprintf):\n*\n* > Number of characters written if successful or negative value if an error\n* > occurred.\n* > If the resulting string gets truncated due to buf_size limit, function\n* > returns the total number of characters (not including the terminating\n* > null-byte) which would have been written, if the limit was not imposed.\n*\n* If `NULL` and `0` are given for buffer and buffer_size respectively, the\n* size of the string that would be generated is returned.\n* Either snprintf() or _vscprintf() is used to calculate this value.\n*\n* \\see snprintf()\n* \\see _snprintf_s()\n* \\return the number of bytes that would have been written given enough space, or\n* \\return a negative number if there is an error, but unlike _snprintf_s(),\n*   -1 is not returned if there is truncation.\n*/"]
    pub fn rcutils_snprintf(
        buffer: *mut ::std::os::raw::c_char,
        buffer_size: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Format a string with va_list for arguments, see rcutils_snprintf()."]
    pub fn rcutils_vsnprintf(
        buffer: *mut ::std::os::raw::c_char,
        buffer_size: usize,
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rcutils_fault_injection_is_test_complete() -> bool;
}
extern "C" {
    #[doc = " \\brief Atomically set the fault injection counter.\n\n This is typically not the preferred method of interacting directly with the fault injection\n logic, instead use `RCUTILS_FAULT_INJECTION_TEST` instead.\n\n This function may also be used for pausing code inside of a `RCUTILS_FAULT_INJECTION_TEST` with\n something like the following:\n\n RCUTILS_FAULT_INJECTION_TEST({\n     ...  // code to run with fault injection\n     int64_t count = rcutils_fault_injection_get_count();\n     rcutils_fault_injection_set_count(RCUTILS_FAULT_INJECTION_NEVER_FAIL);\n     ...  // code to run without fault injection\n     rcutils_fault_injection_set_count(count);\n     ...  // code to run with fault injection\n });\n\n \\param count The count to set the fault injection counter to. If count is negative, then fault\n injection errors will be disabled. The counter is globally initialized to\n RCUTILS_FAULT_INJECTION_NEVER_FAIL."]
    pub fn rcutils_fault_injection_set_count(count: int_least64_t);
}
extern "C" {
    #[doc = " \\brief Atomically get the fault injection counter value\n\n This function is typically not used directly but instead indirectly inside an\n `RCUTILS_FAULT_INJECTION_TEST`"]
    pub fn rcutils_fault_injection_get_count() -> int_least64_t;
}
extern "C" {
    #[doc = " \\brief Implementation of fault injection decrementer\n\n This is included inside of macros, so it needs to be exported as a public function, but it\n should not be used directly."]
    pub fn _rcutils_fault_injection_maybe_fail() -> int_least64_t;
}
#[doc = " Struct wrapping a fixed-size c string used for returning the formatted error string."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_error_string_s {
    #[doc = " The fixed-size C string used for returning the formatted error string."]
    pub str_: [::std::os::raw::c_char; 1024usize],
}
#[test]
fn bindgen_test_layout_rcutils_error_string_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_error_string_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_error_string_s>(),
        1024usize,
        concat!("Size of: ", stringify!(rcutils_error_string_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_error_string_s>(),
        1usize,
        concat!("Alignment of ", stringify!(rcutils_error_string_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_error_string_s),
            "::",
            stringify!(str_)
        )
    );
}
#[doc = " Struct wrapping a fixed-size c string used for returning the formatted error string."]
pub type rcutils_error_string_t = rcutils_error_string_s;
#[doc = " Struct which encapsulates the error state set by RCUTILS_SET_ERROR_MSG()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_error_state_s {
    #[doc = " User message storage, limited to RCUTILS_ERROR_STATE_MESSAGE_MAX_LENGTH characters."]
    pub message: [::std::os::raw::c_char; 768usize],
    #[doc = " File name, limited to what's left from RCUTILS_ERROR_STATE_MAX_SIZE characters\n after subtracting storage for others."]
    pub file: [::std::os::raw::c_char; 229usize],
    #[doc = " Line number of error."]
    pub line_number: u64,
}
#[test]
fn bindgen_test_layout_rcutils_error_state_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_error_state_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_error_state_s>(),
        1008usize,
        concat!("Size of: ", stringify!(rcutils_error_state_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_error_state_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_error_state_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_error_state_s),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_error_state_s),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line_number) as usize - ptr as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_error_state_s),
            "::",
            stringify!(line_number)
        )
    );
}
#[doc = " Struct which encapsulates the error state set by RCUTILS_SET_ERROR_MSG()."]
pub type rcutils_error_state_t = rcutils_error_state_s;
extern "C" {
    #[doc = " Forces initialization of thread-local storage if called in a newly created thread.\n**\n* If this function is not called beforehand, then the first time the error\n* state is set or the first time the error message is retrieved, the default\n* allocator will be used to allocate thread-local storage.\n*\n* This function may or may not allocate memory.\n* The system's thread-local storage implementation may need to allocate\n* memory, since it usually has no way of knowing how much storage is needed\n* without knowing how many threads will be created.\n* Most implementations (e.g. C11, C++11, and pthread) do not have ways to\n* specify how this memory is allocated, but if the implementation allows, the\n* given allocator to this function will be used, but is otherwise unused.\n* This only occurs when creating and destroying threads, which can be avoided\n* in the \"steady\" state by reusing pools of threads.\n*\n* It is worth considering that repeated thread creation and destruction will\n* result in repeated memory allocations and could result in memory\n* fragmentation.\n* This is typically avoided anyways by using pools of threads.\n*\n* In case an error is indicated by the return code, no error message will have\n* been set.\n*\n* If called more than once in a thread, or after implicitly initialized by\n* setting the error state, it will still return `RCUTILS_RET_OK`, even\n* if the given allocator is invalid.\n* Essentially this function does nothing if thread-local storage has already\n* been called.\n* If already initialized, the given allocator is ignored, even if it does not\n* match the allocator used originally to initialize the thread-local storage.\n*\n* \\param[in] allocator to be used to allocate and deallocate memory\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if the allocator is invalid, or\n* \\return #RCUTILS_RET_BAD_ALLOC if allocating memory fails, or\n* \\return #RCUTILS_RET_ERROR if an unspecified error occurs.\n*/"]
    pub fn rcutils_initialize_error_handling_thread_local_storage(
        allocator: rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Set the error message, as well as the file and line on which it occurred.\n**\n* This is not meant to be used directly, but instead via the\n* RCUTILS_SET_ERROR_MSG(msg) macro.\n*\n* The error_msg parameter is copied into the internal error storage and must\n* be null terminated.\n* The file parameter is copied into the internal error storage and must\n* be null terminated.\n*\n* \\param[in] error_string The error message to set.\n* \\param[in] file The path to the file in which the error occurred.\n* \\param[in] line_number The line number on which the error occurred.\n*/"]
    pub fn rcutils_set_error_state(
        error_string: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line_number: usize,
    );
}
extern "C" {
    #[doc = " Return `true` if the error is set, otherwise `false`."]
    pub fn rcutils_error_is_set() -> bool;
}
extern "C" {
    #[doc = " Return an rcutils_error_state_t which was set with rcutils_set_error_state().\n**\n* The returned pointer will be NULL if no error has been set in this thread.\n*\n* The returned pointer is valid until RCUTILS_SET_ERROR_MSG, rcutils_set_error_state,\n* or rcutils_reset_error are called in the same thread.\n*\n* \\return A pointer to the current error state struct.\n*/"]
    pub fn rcutils_get_error_state() -> *const rcutils_error_state_t;
}
extern "C" {
    #[doc = " Return the error message followed by `, at <file>:<line>` if set, else \"error not set\".\n**\n* This function is \"safe\" because it returns a copy of the current error\n* string or one containing the string \"error not set\" if no error was set.\n* This ensures that the copy is owned by the calling thread and is therefore\n* never invalidated by other error handling calls, and that the C string\n* inside is always valid and null terminated.\n*\n* \\return The current error string, with file and line number, or \"error not set\" if not set.\n*/"]
    pub fn rcutils_get_error_string() -> rcutils_error_string_t;
}
extern "C" {
    #[doc = " Reset the error state by clearing any previously set error state."]
    pub fn rcutils_reset_error();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_array_list_impl_s {
    _unused: [u8; 0],
}
#[doc = " The structure holding the metadata for an array list."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_array_list_s {
    #[doc = " A pointer to the PIMPL implementation type."]
    pub impl_: *mut rcutils_array_list_impl_s,
}
#[test]
fn bindgen_test_layout_rcutils_array_list_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_array_list_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_array_list_s>(),
        8usize,
        concat!("Size of: ", stringify!(rcutils_array_list_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_array_list_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_array_list_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_array_list_s),
            "::",
            stringify!(impl_)
        )
    );
}
#[doc = " The structure holding the metadata for an array list."]
pub type rcutils_array_list_t = rcutils_array_list_s;
extern "C" {
    #[doc = " Return an empty array_list struct.\n**\n* This function returns an empty and zero initialized array_list struct.\n* Calling rcutils_array_list_fini() on any non-initialized instance leads\n* to undefined behavior.\n* Every instance of array_list_t has to either be zero_initialized with this\n* function or manually allocated.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | Yes\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* Example:\n*\n* ```c\n* rcutils_array_list_t foo;\n* rcutils_array_list_fini(&foo); // undefined behavior!\n*\n* rcutils_array_list_t bar = rcutils_get_zero_initialized_array_list();\n* rcutils_array_list_fini(&bar); // ok\n* ```\n*/"]
    pub fn rcutils_get_zero_initialized_array_list() -> rcutils_array_list_t;
}
extern "C" {
    #[doc = " Initialize an array list with a given initial capacity.\n**\n* This function will initialize a given, zero initialized, array_list to\n* a given size.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* Example:\n*\n* ```c\n* rcutils_allocator_t allocator = rcutils_get_default_allocator();\n* rcutils_array_list_t array_list = rcutils_get_zero_initialized_array_list();\n* rcutils_ret_t ret = rcutils_array_list_init(&array_list, 2, sizeof(int), &allocator);\n* if (ret != RCUTILS_RET_OK) {\n*   // ... error handling\n* }\n* int data = 42;\n* int out_data = 0;\n* ret = rcutils_array_list_add(&array_list, &data);\n* data++;\n* ret = rcutils_array_list_get(&array_list, 0, &out_data);\n* assert(42 == out_data);\n* ret = rcutils_array_list_fini(&array_list);\n* ```\n*\n* \\param[inout] array_list object to be initialized\n* \\param[in] initial_capacity the initial capacity to allocate in the list\n* \\param[in] data_size the size (in bytes) of the data object being stored in the list\n* \\param[in] allocator to be used to allocate and deallocate memory\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_array_list_init(
        array_list: *mut rcutils_array_list_t,
        initial_capacity: usize,
        data_size: usize,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize an array list, reclaiming all resources.\n**\n* This function reclaims any memory owned by the array list.\n*\n* The allocator used to initialize the array list is used to deallocate each\n* entry in the list and the list itself.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[inout] array_list object to be finalized\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_array_list_fini(array_list: *mut rcutils_array_list_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Adds an entry to the list\n**\n* This function adds the provided data to the end of the list. A shallow copy of\n* the provided data is made to store in the list instead of just storing\n* the pointer to the provided data.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] array_list to add the data to\n* \\param[in] data a pointer to the data to add to the list\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_array_list_add(
        array_list: *mut rcutils_array_list_t,
        data: *const ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Sets an entry in the list to the provided data\n**\n* This function sets the provided data at the specified index in the list.\n* A shallow copy of the provided data is made to store in the list instead\n* of just storing the pointer to the provided data.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] array_list to add the data to\n* \\param[in] index the position in the list to set the data\n* \\param[in] data a pointer to the data that will be set in the list\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if index out of bounds, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_array_list_set(
        array_list: *mut rcutils_array_list_t,
        index: usize,
        data: *const ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Removes an entry in the list at the provided index\n**\n* This function removes data from the list at the specified index. The capacity\n* of the list will never decrease when entries are removed.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] array_list to add the data to\n* \\param[in] index the index of the item to remove from the list\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if index out of bounds, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_array_list_remove(
        array_list: *mut rcutils_array_list_t,
        index: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Retrieves an entry in the list at the provided index\n**\n* This function retrieves a copy of the data stored in the list at the provided index.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n*\n* \\param[in] array_list to add the data to\n* \\param[in] index the index at which to get the data\n* \\param[out] data a copy of the data stored in the list\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_array_list_get(
        array_list: *const rcutils_array_list_t,
        index: usize,
        data: *mut ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Retrieves the size of the provided array_list\n**\n* This function retrieves the number of items in the provided array list\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n*\n* \\param[in] array_list list to get the size of\n* \\param[out] size The number of items currently stored in the list\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_array_list_get_size(
        array_list: *const rcutils_array_list_t,
        size: *mut usize,
    ) -> rcutils_ret_t;
}
#[doc = " The structure holding the metadata for a char array."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_char_array_s {
    #[doc = " A pointer to the allocated memory for this char array."]
    pub buffer: *mut ::std::os::raw::c_char,
    #[doc = " if this is true, we may safely free/realloc the buffer as needed;\n otherwise we will leave the buffer alone and alloc new memory if\n more space is needed"]
    pub owns_buffer: bool,
    #[doc = " The length of the data stored in the buffer pointer."]
    pub buffer_length: usize,
    #[doc = " The maximum capacity of the buffer pointer."]
    pub buffer_capacity: usize,
    #[doc = " The allocator used to allocate and free the data in the pointer."]
    pub allocator: rcutils_allocator_t,
}
#[test]
fn bindgen_test_layout_rcutils_char_array_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_char_array_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_char_array_s>(),
        72usize,
        concat!("Size of: ", stringify!(rcutils_char_array_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_char_array_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_char_array_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_char_array_s),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).owns_buffer) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_char_array_s),
            "::",
            stringify!(owns_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer_length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_char_array_s),
            "::",
            stringify!(buffer_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer_capacity) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_char_array_s),
            "::",
            stringify!(buffer_capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_char_array_s),
            "::",
            stringify!(allocator)
        )
    );
}
#[doc = " The structure holding the metadata for a char array."]
pub type rcutils_char_array_t = rcutils_char_array_s;
extern "C" {
    #[doc = " Return a zero initialized char array struct.\n**\n* \\return rcutils_char_array_t a zero initialized char array struct\n*/"]
    pub fn rcutils_get_zero_initialized_char_array() -> rcutils_char_array_t;
}
extern "C" {
    #[doc = " Initialize a zero initialized char array struct.\n**\n* This function may leak if the char array struct is already\n* pre-initialized.\n* If the capacity is set to 0, no memory is allocated and the internal buffer\n* is still NULL.\n*\n* \\param[in] char_array a pointer to the to be initialized char array struct\n* \\param[in] buffer_capacity the size of the memory to allocate for the byte stream\n* \\param[in] allocator the allocator to use for the memory allocation\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or\n* \\return #RCUTILS_RET_BAD_ALLOC if no memory could be allocated correctly\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_init(
        char_array: *mut rcutils_char_array_t,
        buffer_capacity: usize,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize a char array struct.\n**\n* Cleans up and deallocates any resources owned by rcutils_char_array_t.\n* The array passed to this function needs to have been initialized by\n* rcutils_char_array_init().\n* If .owns_buffer is false, this function has no effect because that\n* implies that the char_array does not own the internal buffer.\n* Passing an uninitialized instance to this function leads to undefined\n* behavior.\n*\n* \\param[in] char_array pointer to the rcutils_char_array_t to be cleaned up\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if the char_array argument is invalid\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_fini(char_array: *mut rcutils_char_array_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Resize the internal buffer of the char array.\n**\n* The internal buffer of the char array can be resized dynamically if needed.\n* If the new size is smaller than the current capacity, then the memory is\n* truncated.\n* Be aware, that this will deallocate the memory and therefore invalidates any\n* pointers to this storage.\n* If the new size is larger, new memory is getting allocated and the existing\n* content is copied over.\n* Note that if the array doesn't own the current buffer the function just\n* allocates a new block of memory and copies the contents of the old buffer\n* instead of resizing the existing buffer.\n*\n* \\param[in] char_array pointer to the instance of rcutils_char_array_t which is being resized\n* \\param[in] new_size the new size of the internal buffer\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if new_size is set to zero\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_resize(
        char_array: *mut rcutils_char_array_t,
        new_size: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Expand the internal buffer of the char array.\n**\n* This function is equivalent to `rcutils_char_array_resize` except that it resizes\n* the internal buffer only when it is not big enough.\n* If the buffer is already big enough for `new_size`, it returns `RCUTILS_RET_OK` without\n* doing anything.\n*\n* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being resized\n* \\param[in] new_size the new size of the internal buffer\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_expand_as_needed(
        char_array: *mut rcutils_char_array_t,
        new_size: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Produce output according to format and args.\n**\n* This function is equivalent to `vsprintf(char_array->buffer, format, args)`\n* except that the buffer grows as needed so a user doesn't have to deal with\n* memory management.\n* The `va_list args` will be cloned before being used, so a user can safely\n* use it again after calling this function.\n*\n* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being\n* written to\n* \\param[in] format the format string used by the underlying `vsnprintf`\n* \\param[in] args the `va_list` used by the underlying `vsnprintf`\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_vsprintf(
        char_array: *mut rcutils_char_array_t,
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Append a string (or part of it) to the string in buffer.\n**\n* This function treats the internal buffer as a string and appends the src string to it.\n* If src is longer than n, n bytes will be used and an extra null byte will be appended.\n* It is virtually equivalent to `strncat(char_array->buffer, src, n)` except that the buffer\n* grows as needed so a user doesn't have to deal with memory management.\n*\n* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being appended to\n* \\param[in] src the string to be appended to the end of the string in buffer\n* \\param[in] n it uses at most n bytes from the src string\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_strncat(
        char_array: *mut rcutils_char_array_t,
        src: *const ::std::os::raw::c_char,
        n: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Append a string to the string in buffer.\n**\n* This function treats the internal buffer as a string and appends the src string to it.\n* It is virtually equivalent to `strcat(char_array->buffer, src)` except that the buffer\n* grows as needed. That is to say, a user can safely use it without doing calculation or\n* checks on the sizes of the src and buffer.\n*\n* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being\n* appended to\n* \\param[in] src the string to be appended to the end of the string in buffer\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_strcat(
        char_array: *mut rcutils_char_array_t,
        src: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Copy memory to buffer.\n**\n* This function is equivalent to `memcpy(char_array->buffer, src, n)` except that the buffer\n* grows as needed so a user doesn't have to worry about overflow.\n*\n* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being resized\n* \\param[in] src the memory to be copied from\n* \\param[in] n a total of n bytes will be copied\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_memcpy(
        char_array: *mut rcutils_char_array_t,
        src: *const ::std::os::raw::c_char,
        n: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Copy a string to buffer.\n**\n* This function is equivalent to `strcpy(char_array->buffer, src)` except that the buffer\n* grows as needed so that `src` will fit without overflow.\n*\n* \\param[inout] char_array pointer to the instance of rcutils_char_array_t which is being\n* copied to\n* \\param[in] src the string to be copied from\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_char_array_strcpy(
        char_array: *mut rcutils_char_array_t,
        src: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_hash_map_impl_s {
    _unused: [u8; 0],
}
#[doc = " The structure holding the metadata for a hash map."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_hash_map_s {
    #[doc = " A pointer to the PIMPL implementation type."]
    pub impl_: *mut rcutils_hash_map_impl_s,
}
#[test]
fn bindgen_test_layout_rcutils_hash_map_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_hash_map_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_hash_map_s>(),
        8usize,
        concat!("Size of: ", stringify!(rcutils_hash_map_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_hash_map_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_hash_map_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_hash_map_s),
            "::",
            stringify!(impl_)
        )
    );
}
#[doc = " The structure holding the metadata for a hash map."]
pub type rcutils_hash_map_t = rcutils_hash_map_s;
#[doc = " The function signature for a key hashing function.\n**\n* \\param[in] key The key that needs to be hashed\n* \\return A hash value for the provided string\n*/"]
pub type rcutils_hash_map_key_hasher_t =
    ::std::option::Option<unsafe extern "C" fn(key: *const ::std::os::raw::c_void) -> usize>;
#[doc = " The function signature for a key comparison function.\n**\n* \\param[in] val1 The first value to compare\n* \\param[in] val2 The second value to compare\n* \\return A negative number if val1 < val2, or\n* \\return A positve number if val1 > val2, or\n* \\return Zero if val1 == val2.\n*/"]
pub type rcutils_hash_map_key_cmp_t = ::std::option::Option<
    unsafe extern "C" fn(
        val1: *const ::std::os::raw::c_void,
        val2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = " A hashing function for a null terminated c string.\n**\n* A hashing function for a null terminated c string.\n* Should be used when your key is just a pointer to a c-string\n*/"]
    pub fn rcutils_hash_map_string_hash_func(key_str: *const ::std::os::raw::c_void) -> usize;
}
extern "C" {
    #[doc = " A comparison function for a null terminated c string.\n**\n* A comparison function for a null terminated c string.\n* Should be used when your key is just a pointer to a c-string\n*/"]
    pub fn rcutils_hash_map_string_cmp_func(
        val1: *const ::std::os::raw::c_void,
        val2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Return an empty hash_map struct.\n**\n* This function returns an empty and zero initialized hash_map struct.\n* All hash maps should be initialized with this or manually initialized\n* before being used.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* Example:\n* ```c\n* // Do not do this:\n* // rcutils_hash_map_t foo;\n* // rcutils_hash_map_fini(&foo); // undefined behavior!\n*\n* // Do this instead:\n* rcutils_hash_map_t bar = rcutils_get_zero_initialized_hash_map();\n* rcutils_hash_map_fini(&bar); // ok\n* ```\n* */"]
    pub fn rcutils_get_zero_initialized_hash_map() -> rcutils_hash_map_t;
}
extern "C" {
    #[doc = " Initialize a rcutils_hash_map_t, allocating space for given capacity.\n**\n* This function initializes the rcutils_hash_map_t with a given initial\n* capacity for entries.\n* Note this does not allocate space for keys or values in the hash_map, just the\n* arrays of pointers to the keys and values.\n* rcutils_hash_map_set() should still be used when assigning values.\n*\n* The hash_map argument should point to allocated memory and should have\n* been zero initialized with rcutils_get_zero_initialized_hash_map().\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* Example:\n* ```c\n* rcutils_hash_map_t hash_map = rcutils_get_zero_initialized_hash_map();\n* rcutils_ret_t ret =\n*   rcutils_hash_map_init(&hash_map, 2, rcutils_get_default_allocator());\n* if (ret != RCUTILS_RET_OK) {\n*   // ... do error handling\n* }\n* // ... use the hash_map and when done:\n* ret = rcutils_hash_map_fini(&hash_map);\n* if (ret != RCUTILS_RET_OK) {\n*   // ... do error handling\n* }\n* ```\n*\n* \\param[inout] hash_map rcutils_hash_map_t to be initialized\n* \\param[in] initial_capacity the amount of initial capacity for the hash_map - this must be\n*                             greater than zero and will be automatically rounded up to the next power of 2\n* \\param[in] key_size the size (in bytes) of the key used to index the data\n* \\param[in] data_size the size (in bytes) of the data being stored\n* \\param[in] key_hashing_func a function that returns a hashed value for a key\n* \\param[in] key_cmp_func a function used to compare keys\n* \\param[in] allocator the allocator to use through out the lifetime of the hash_map\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_STRING_MAP_ALREADY_INIT if alread initialized, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_hash_map_init(
        hash_map: *mut rcutils_hash_map_t,
        initial_capacity: usize,
        key_size: usize,
        data_size: usize,
        key_hashing_func: rcutils_hash_map_key_hasher_t,
        key_cmp_func: rcutils_hash_map_key_cmp_t,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize the previously initialized hash_map struct.\n**\n* This function will free any resources which were created when initializing\n* or when calling rcutils_hash_map_set().\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[inout] hash_map rcutils_hash_map_t to be finalized\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_hash_map_fini(hash_map: *mut rcutils_hash_map_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the current capacity of the hash_map.\n**\n* This function will return the internal capacity of the hash_map, which is the\n* number of buckets the hash_map uses to sort the keys.\n* The capacity does not indicate how many key value pairs are stored in the\n* hash_map, the rcutils_hash_map_get_size() function can provide that, nor the\n* maximum number that can be stored without increasing the capacity.\n* The capacity can be set initially with rcutils_hash_map_init().\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] hash_map rcutils_hash_map_t to be queried\n* \\param[out] capacity capacity of the hash_map\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_hash_map_get_capacity(
        hash_map: *const rcutils_hash_map_t,
        capacity: *mut usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the current size of the hash_map.\n**\n* This function will return the internal size of the hash_map, which is the\n* current number of key value pairs in the hash_map.\n* The size is changed when calling rcutils_hash_map_set() or rcutils_hash_map_unset().\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] hash_map rcutils_hash_map_t to be queried\n* \\param[out] size size of the hash_map\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_hash_map_get_size(
        hash_map: *const rcutils_hash_map_t,
        size: *mut usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Set a key value pair in the hash_map, increasing capacity if necessary.\n**\n* If the key already exists in the map then the value is updated to the new value\n* provided. If it does not already exist then a new entry is added for the new key\n* and value. The capacity will be increased if needed.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[inout] hash_map rcutils_hash_map_t to be updated\n* \\param[in] key hash_map key\n* \\param[in] value value for given hash_map key\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_hash_map_set(
        hash_map: *mut rcutils_hash_map_t,
        key: *const ::std::os::raw::c_void,
        value: *const ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Unset a key value pair in the hash_map.\n**\n* Unsets the key value pair in the hash_map and frees any internal resources allocated\n* for the entry. This function will never decrease the capacity when removing keys.\n* If the given key is not found, RCUTILS_RET_STRING_KEY_NOT_FOUND is returned.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[inout] hash_map rcutils_hash_map_t to be updated\n* \\param[in] key hash_map key, must be null terminated c string\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or\n* \\return #RCUTILS_RET_STRING_KEY_NOT_FOUND if the key is not found in the map, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_hash_map_unset(
        hash_map: *mut rcutils_hash_map_t,
        key: *const ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get whether or not a key exists.\n**\n* Returns true if the provided key exists in the hash_map or false if it does not or\n* if the hash_map or key are invalid.\n* In all cases no error message is set.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] hash_map rcutils_hash_map_t to be searched\n* \\param[in] key hash_map key, must be null terminated c string\n* \\return `true` if key is in the hash_map, or\n* \\return `false` if key is not in the hash_map, or\n* \\return `false` for invalid arguments, or\n* \\return `false` if the hash_map is invalid.\n*/"]
    pub fn rcutils_hash_map_key_exists(
        hash_map: *const rcutils_hash_map_t,
        key: *const ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[doc = " Get value given a key.\n**\n* This function can be used to retrieve a shallow copy of the stored data. The data\n* pointer must point to a section of memory large enough to copy the full size of\n* the data being stored, which is specified when the hash_map in initialized.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] hash_map rcutils_hash_map_t to be searched\n* \\param[in] key hash_map key to look up the data for\n* \\param[out] data A copy of the data stored in the map\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or\n* \\return #RCUTILS_RET_NOT_FOUND if the key doesn't exist in the map, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_hash_map_get(
        hash_map: *const rcutils_hash_map_t,
        key: *const ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the next key in the hash_map, unless NULL is given, then get the first key.\n**\n* This function allows you to iteratively get each key/value pair in the hash_map.\n*\n* If NULL is given for the previous_key, then the first key in the hash_map is returned.\n* If that returned key is given as the previous_key for the next call to this function,\n* then the next key in the hash_map is returned.\n* If there are no more keys in the hash_map or if the given key is not in the hash_map,\n* an error will be returned.\n*\n* The order of the keys in the hash_map is arbitrary and if the hash_map is modified\n* between calls to this function the behavior is undefined.\n* If the hash_map is modified then iteration should begin again by passing NULL to\n* get the first key again.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* Example:\n* ```c\n* printf(\"entries in the hash_map:\\n\");\n* int key = 0, data = 0;\n* rcutils_ret_t status = rcutils_hash_map_get_next_key(&hash_map, NULL, &key, &data);\n* while (RCUTILS_RET_OK == status) {\n*   printf(\"%i: %i\\n\", key, data);\n*   status = rcutils_hash_map_get_next_key(&hash_map, &key, &key, &data);\n* }\n* ```\n*\n* \\param[in] hash_map rcutils_hash_map_t to be queried\n* \\param[in] previous_key NULL to get the first key or the previous key to get the next for\n* \\param[out] key A copy of the next key in the sequence\n* \\param[out] data A copy of the next data in the sequence\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_NOT_INITIALIZED if the hash_map is invalid, or\n* \\return #RCUTILS_RET_NOT_FOUND if the previous_key doesn't exist in the map, or\n* \\return #RCUTILS_RET_HASH_MAP_NO_MORE_ENTRIES if there is no more data beyound the previous_key, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_hash_map_get_next_key_and_data(
        hash_map: *const rcutils_hash_map_t,
        previous_key: *const ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Interface to qsort with rcutils-style argument validation.\n**\n* This function changes the order of the elements in the array so that they\n* are in ascending order according to the given comparison function.\n*\n* This function is thread-safe.\n*\n* \\param[inout] ptr object whose elements should be sorted.\n* \\param[in] count number of elements present in the object.\n* \\param[in] size size of each element, in bytes.\n* \\param[in] comp function used to compare two elements.\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_qsort(
        ptr: *mut ::std::os::raw::c_void,
        count: usize,
        size: usize,
        comp: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> rcutils_ret_t;
}
#[doc = " The structure holding the metadata for a string array."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_string_array_s {
    #[doc = " The number of strings that can be stored in the string array."]
    pub size: usize,
    #[doc = " The allocated memory for the string array."]
    pub data: *mut *mut ::std::os::raw::c_char,
    #[doc = " The allocator used to allocate and free memory for the string array."]
    pub allocator: rcutils_allocator_t,
}
#[test]
fn bindgen_test_layout_rcutils_string_array_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_string_array_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_string_array_s>(),
        56usize,
        concat!("Size of: ", stringify!(rcutils_string_array_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_string_array_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_string_array_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_string_array_s),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_string_array_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_string_array_s),
            "::",
            stringify!(allocator)
        )
    );
}
#[doc = " The structure holding the metadata for a string array."]
pub type rcutils_string_array_t = rcutils_string_array_s;
extern "C" {
    #[doc = " Return an empty string array struct.\n**\n* This function returns an empty and zero initialized string array struct.\n* Calling rcutils_string_array_fini() on any non-initialized instance leads\n* to undefined behavior.\n* Every instance of string_array_t has to either be zero_initialized with this\n* function or manually allocated.\n*\n* Example:\n*\n* ```c\n* rcutils_string_array_t foo;\n* rcutils_string_array_fini(&foo); // undefined behavior!\n*\n* rcutils_string_array_t bar = rcutils_get_zero_initialized_string_array();\n* rcutils_string_array_fini(&bar); // ok\n* ```\n*/"]
    pub fn rcutils_get_zero_initialized_string_array() -> rcutils_string_array_t;
}
extern "C" {
    #[doc = " Initialize a string array with a given size.\n**\n* This function will initialize a given, zero initialized, string array to\n* a given size.\n*\n* Note that putting a string into the array gives owenship to the array.\n*\n* Example:\n*\n* ```c\n* rcutils_allocator_t allocator = rcutils_get_default_allocator();\n* rcutils_string_array_t string_array = rcutils_get_zero_initialized_string_array();\n* rcutils_ret_t ret = rcutils_string_array_init(&string_array, 2, &allocator);\n* if (ret != RCUTILS_RET_OK) {\n*   // ... error handling\n* }\n* string_array.data[0] = rcutils_strdup(\"Hello\", &allocator);\n* string_array.data[1] = rcutils_strdup(\"World\", &allocator);\n* ret = rcutils_string_array_fini(&string_array);\n* ```\n*\n* \\param[inout] string_array object to be initialized\n* \\param[in] size the size the array should be\n* \\param[in] allocator to be used to allocate and deallocate memory\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_array_init(
        string_array: *mut rcutils_string_array_t,
        size: usize,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize a string array, reclaiming all resources.\n**\n* This function reclaims any memory owned by the string array, including the\n* strings it references.\n*\n* The allocator used to initialize the string array is used to deallocate each\n* string in the array and the array of strings itself.\n*\n* \\param[inout] string_array object to be finalized\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_array_fini(string_array: *mut rcutils_string_array_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Compare two string arrays.\n**\n* The two string arrays are compared according to lexicographical order.\n*\n* \\param[in] lhs The first string array.\n* \\param[in] rhs The second string array.\n* \\param[out] res Negative value if `lhs` appears before `rhs` in lexicographical order.\n*   Zero if `lhs` and `rhs` are equal.\n*   Positive value if `lhs` appears after `rhs` in lexographical order.\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if any argument is `NULL, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if `lhs->data` or `rhs->data` is `NULL, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_array_cmp(
        lhs: *const rcutils_string_array_t,
        rhs: *const rcutils_string_array_t,
        res: *mut ::std::os::raw::c_int,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Resize a string array, reclaiming removed resources.\n**\n* This function changes the size of an existing string array.\n* If the new size is larger, new entries are added to the end of the array and\n* are zero- initialized.\n* If the new size is smaller, entries are removed from the end of the array\n* and their resources reclaimed.\n*\n* \\par Note:\n* Resizing to 0 is not a substitute for calling ::rcutils_string_array_fini.\n*\n* \\par Note:\n* If this function fails, \\p string_array remains unchanged and should still\n* be reclaimed with ::rcutils_string_array_fini.\n*\n* \\param[inout] string_array object to be resized.\n* \\param[in] new_size the size the array should be changed to.\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_array_resize(
        string_array: *mut rcutils_string_array_t,
        new_size: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Lexicographic comparer for pointers to string pointers.\n**\n* This functions compares pointers to string pointers lexicographically\n* ascending.\n*\n* \\param[in] lhs pointer to the first string pointer.\n* \\param[in] rhs pointer to the second string pointer.\n* \\return <0 if lhs is lexicographically lower, or\n* \\return 0 if the strings are the same, or\n* \\return >0 if lhs is lexicographically higher.\n*/"]
    pub fn rcutils_string_array_sort_compare(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_string_map_impl_s {
    _unused: [u8; 0],
}
#[doc = " The structure holding the metadata for a string map."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_string_map_s {
    #[doc = " A pointer to the PIMPL implementation type."]
    pub impl_: *mut rcutils_string_map_impl_s,
}
#[test]
fn bindgen_test_layout_rcutils_string_map_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_string_map_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_string_map_s>(),
        8usize,
        concat!("Size of: ", stringify!(rcutils_string_map_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_string_map_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_string_map_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).impl_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_string_map_s),
            "::",
            stringify!(impl_)
        )
    );
}
#[doc = " The structure holding the metadata for a string map."]
pub type rcutils_string_map_t = rcutils_string_map_s;
extern "C" {
    #[doc = " Return an empty string map struct.\n**\n* This function returns an empty and zero initialized string map struct.\n*\n* Example:\n*\n* ```c\n* // Do not do this:\n* // rcutils_string_map_t foo;\n* // rcutils_string_map_fini(&foo); // undefined behavior!\n*\n* // Do this instead:\n* rcutils_string_map_t bar = rcutils_get_zero_initialized_string_map();\n* rcutils_string_map_fini(&bar); // ok\n* ```\n* */"]
    pub fn rcutils_get_zero_initialized_string_map() -> rcutils_string_map_t;
}
extern "C" {
    #[doc = " Initialize a rcutils_string_map_t, allocating space for given capacity.\n**\n* This function initializes the rcutils_string_map_t with a given initial\n* capacity for entries.\n* Note this does not allocate space for keys or values in the map, just the\n* arrays of pointers to the keys and values.\n* rcutils_string_map_set() should still be used when assigning values.\n*\n* The string_map argument should point to allocated memory and should have\n* been zero initialized with rcutils_get_zero_initialized_string_map().\n* For example:\n*\n* ```c\n* rcutils_string_map_t string_map = rcutils_get_zero_initialized_string_map();\n* rcutils_ret_t ret =\n*   rcutils_string_map_init(&string_map, 10, rcutils_get_default_allocator());\n* if (ret != RCUTILS_RET_OK) {\n*   // ... do error handling\n* }\n* // ... use the string map and when done:\n* ret = rcutils_string_map_fini(&string_map);\n* if (ret != RCUTILS_RET_OK) {\n*   // ... do error handling\n* }\n* ```\n*\n* \\param[inout] string_map rcutils_string_map_t to be initialized\n* \\param[in] initial_capacity the amount of initial capacity for the string map\n* \\param[in] allocator the allocator to use through out the lifetime of the map\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_STRING_MAP_ALREADY_INIT if already initialized, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_init(
        string_map: *mut rcutils_string_map_t,
        initial_capacity: usize,
        allocator: rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize the previously initialized string map struct.\n**\n* This function will free any resources which were created when initializing\n* or when calling rcutils_string_map_set().\n*\n* \\param[inout] string_map rcutils_string_map_t to be finalized\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_fini(string_map: *mut rcutils_string_map_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the current capacity of the string map.\n**\n* This function will return the internal capacity of the map, which is the\n* maximum number of key value pairs the map could hold.\n* The capacity can be set initially with rcutils_string_map_init() or\n* with rcutils_string_map_reserve().\n* The capacity does not indicate how many key value paris are stored in the\n* map, the rcutils_string_map_get_size() function can provide that.\n*\n* \\param[in] string_map rcutils_string_map_t to be queried\n* \\param[out] capacity capacity of the string map\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_get_capacity(
        string_map: *const rcutils_string_map_t,
        capacity: *mut usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the current size of the string map.\n**\n* This function will return the internal size of the map, which is the\n* current number of key value pairs in the map.\n* The size is changed when calling rcutils_string_map_set_no_resize(),\n* rcutils_string_map_set(), or rcutils_string_map_unset().\n*\n* \\param[in] string_map rcutils_string_map_t to be queried\n* \\param[out] size size of the string map\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_get_size(
        string_map: *const rcutils_string_map_t,
        size: *mut usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Reserve a given amount of capacity in the map.\n**\n* Increases the capacity of the map to at least the given size.\n*\n* If the current capacity is less than requested capacity then the capacity\n* is increased using the allocator given during initialization of the map in\n* rcutils_string_map_init().\n* If the requested capacity is less than the current capacity, the capacity\n* may be reduced, but no existing key value pairs will be truncated to do so.\n* In effect, the capacity will be shrunk to fit the number of items in map or\n* the requested capacity, which ever is larger.\n*\n* If recovering all resources is desired first call rcutils_string_map_clear()\n* and then this function with a capacity of 0.\n*\n* \\param[inout] string_map rcutils_string_map_t to have space reserved in\n* \\param[in] capacity requested size to reserve in the map\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_reserve(
        string_map: *mut rcutils_string_map_t,
        capacity: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Remove all key value pairs from the map.\n**\n* This function will remove all key value pairs from the map, and it will\n* reclaim all resources allocated as a result of setting key value pairs.\n* rcutils_string_map_fini() should still be called after this.\n*\n* \\param[inout] string_map rcutils_string_map_t to be cleared\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_clear(string_map: *mut rcutils_string_map_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Set a key value pair in the map, increasing capacity if necessary.\n**\n* The capacity will be increased if needed using rcutils_string_map_reserve().\n* Otherwise it is the same as rcutils_string_map_set_no_resize().\n*\n* \\see rcutils_string_map_set_no_resize()\n*\n* \\param[inout] string_map rcutils_string_map_t to be updated\n* \\param[in] key map key, must be null terminated c string\n* \\param[in] value value for given map key, must be null terminated c string\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_set(
        string_map: *mut rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Set a key value pair in the map but only if the map has enough capacity.\n**\n* If the map already contains the given key, the existing value will be\n* replaced with the given value.\n* If the map does not contain the given key, and the map has additional\n* unused capacity, then it will store the given key and value in the map.\n* If there is no unused capacity in the map, then RCUTILS_RET_NOT_ENOUGH_SPACE\n* is returned.\n*\n* The given key and value c strings are copied into the map, and so storage is\n* allocated for them in the map when this function is called if necessary.\n* The storage allocated for this purpose is reclaimed either when\n* rcutils_string_map_fini() is called on this map or when using this function\n* or rcutils_string_map_unset().\n*\n* Any allocation that occurs in this functions uses the allocator of the map,\n* which is given when the map is initialized in rcutils_string_map_init().\n*\n* \\param[inout] string_map rcutils_string_map_t to be updated\n* \\param[in] key map key, must be null terminated c string\n* \\param[in] value value for given map key, must be null terminated c string\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or\n* \\return #RCUTILS_RET_NOT_ENOUGH_SPACE if map is full, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_set_no_resize(
        string_map: *mut rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Unset a key value pair in the map.\n**\n* The key needs to be a null terminated c string.\n* If the given key is not found, RCUTILS_RET_STRING_KEY_NOT_FOUND is returned.\n*\n* \\param[inout] string_map rcutils_string_map_t to be updated\n* \\param[in] key map key, must be null terminated c string\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or\n* \\return #RCUTILS_RET_STRING_KEY_NOT_FOUND if key not found, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_unset(
        string_map: *mut rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get whether or not a key exists.\n**\n* The key needs to be a null terminated c string.\n*\n* This function can fail and return false if the key is not found,\n* or the string_map is NULL or invalid, or if the key is NULL.\n* In all cases no error message is set.\n*\n* \\param[in] string_map rcutils_string_map_t to be searched\n* \\param[in] key map key, must be null terminated c string\n* \\return `true` if key is in the map, or\n* \\return `false` if key is not in the map, or\n* \\return `false` for invalid arguments, or\n* \\return `false` if the string map is invalid.\n*/"]
    pub fn rcutils_string_map_key_exists(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    #[doc = " Get whether or not a key of known length exists.\n**\n* Identical to rcutils_string_map_key_exists() but without relying on key to be\n* a null terminated c string.\n*\n* \\param[in] string_map rcutils_string_map_t to be searched\n* \\param[in] key map key\n* \\param[in] key_length map key length\n* \\return `true` if key is in the map, or\n* \\return `false` if key is not in the map, or\n* \\return `false` for invalid arguments, or\n* \\return `false` if the string map is invalid.\n*/"]
    pub fn rcutils_string_map_key_existsn(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
        key_length: usize,
    ) -> bool;
}
extern "C" {
    #[doc = " Get value given a key.\n**\n* The key needs to be a null terminated c string.\n*\n* This function can fail, and therefore return NULL, if the key is not found,\n* or the string_map is NULL or invalid, or if the key is NULL.\n* In all cases no error message is set.\n*\n* The returned value string is still owned by the map, and it should not be\n* modified or free'd.\n* This also means that the value pointer becomes invalid if either\n* rcutils_string_map_clear() or rcutils_string_map_fini() are called or if\n* the key value pair is updated or removed with one of rcutils_string_map_set()\n* or rcutils_string_map_set_no_resize() or rcutils_string_map_unset().\n*\n* \\param[in] string_map rcutils_string_map_t to be searched\n* \\param[in] key map key, must be null terminated c string\n* \\return value for the given key if successful, or\n* \\return `NULL` for invalid arguments, or\n* \\return `NULL` if the string map is invalid, or\n* \\return `NULL` if key not found, or\n* \\return `NULL` if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_get(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get value given a key and key length.\n**\n* Identical to rcutils_string_map_get() but without relying on key to be a\n* null terminated c string.\n*\n* \\param[in] string_map rcutils_string_map_t to be searched\n* \\param[in] key map key\n* \\param[in] key_length map key length\n* \\return value for the given key if successful, or\n* \\return `NULL` for invalid arguments, or\n* \\return `NULL` if the string map is invalid, or\n* \\return `NULL` if key not found, or\n* \\return `NULL` if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_getn(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
        key_length: usize,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the next key in the map, unless NULL is given, then get the first key.\n**\n* This function allows you iteratively get each key in the map.\n*\n* If NULL is given for the key, then the first key in the map is returned.\n* If that returned key if given to the this function, then the next key in the\n* map is returned.\n* If there are no more keys in the map or if the given key is not in the map,\n* NULL is returned.\n*\n* The order of the keys in the map is arbitrary and if the map is modified\n* between calls to this function the behavior is undefined.\n* If the map is modifeid then iteration should begin again by passing NULL to\n* get the first key again.\n*\n* This function operates based on the address of the pointer, you cannot pass\n* a copy of a key to get the next key.\n*\n* Example:\n*\n* ```c\n* printf(\"keys in the map:\\n\");\n* const char * current_key = rcutils_string_map_get_next_key(&map, NULL);\n* while (current_key) {\n*   printf(\"  - %s\\n\", current_key);\n*   current_key = rcutils_string_map_get_next_key(&map, current_key);\n* }\n* ```\n*\n* NULL can also be returned if NULL is given for the string_map or if the\n* string_map is invalid.\n*\n* \\param[in] string_map rcutils_string_map_t to be queried\n* \\param[in] key NULL to get the first key or the previous key to get the next\n* \\return value for the given key if successful, or\n* \\return `NULL` for invalid arguments, or\n* \\return `NULL` if the string map is invalid, or\n* \\return `NULL` if key not found, or\n* \\return `NULL` if there are no more keys in the map, or\n* \\return `NULL` if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_get_next_key(
        string_map: *const rcutils_string_map_t,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Copy all the key value pairs from one map into another, overwritting and resizing if needed.\n**\n* If the destination string map does not have enough storage, then it is will\n* be resized.\n* If a key value pair exists in the destination map, its value will be\n* replaced with the source map's value.\n*\n* It is possible for only some of the values to be copied if an error happens\n* during the copying process, e.g. if memory allocation fails.\n*\n* \\param[in] src_string_map rcutils_string_map_t to be copied from\n* \\param[inout] dst_string_map rcutils_string_map_t to be copied to\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT for invalid arguments, or\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation fails, or\n* \\return #RCUTILS_RET_STRING_MAP_INVALID if the string map is invalid, or\n* \\return #RCUTILS_RET_ERROR if an unknown error occurs.\n*/"]
    pub fn rcutils_string_map_copy(
        src_string_map: *const rcutils_string_map_t,
        dst_string_map: *mut rcutils_string_map_t,
    ) -> rcutils_ret_t;
}
#[doc = " The structure holding the metadata for a uint8 array."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_uint8_array_s {
    #[doc = " The allocated memory for the uint8 array."]
    pub buffer: *mut u8,
    #[doc = " The number of valid elements in the uint8 array."]
    pub buffer_length: usize,
    #[doc = " The maximum capacity of the uint8 array."]
    pub buffer_capacity: usize,
    #[doc = " The allocator used to allocate and free memory for the uint8 array."]
    pub allocator: rcutils_allocator_t,
}
#[test]
fn bindgen_test_layout_rcutils_uint8_array_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_uint8_array_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_uint8_array_s>(),
        64usize,
        concat!("Size of: ", stringify!(rcutils_uint8_array_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_uint8_array_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_uint8_array_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_uint8_array_s),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer_length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_uint8_array_s),
            "::",
            stringify!(buffer_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer_capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_uint8_array_s),
            "::",
            stringify!(buffer_capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_uint8_array_s),
            "::",
            stringify!(allocator)
        )
    );
}
#[doc = " The structure holding the metadata for a uint8 array."]
pub type rcutils_uint8_array_t = rcutils_uint8_array_s;
extern "C" {
    #[doc = " Return a zero initialized uint8 array struct.\n**\n* \\return rcutils_uint8_array_t a zero initialized uint8 array struct\n*/"]
    pub fn rcutils_get_zero_initialized_uint8_array() -> rcutils_uint8_array_t;
}
extern "C" {
    #[doc = " Initialize a zero initialized uint8 array struct.\n**\n* This function may leak if the uint8 array struct is already initialized.\n* If the capacity is set to 0, no memory is allocated and the internal buffer\n* is still NULL.\n*\n* \\param[inout] uint8_array a pointer to the to be initialized uint8 array struct\n* \\param[in] buffer_capacity the size of the memory to allocate for the byte stream\n* \\param[in] allocator the allocator to use for the memory allocation\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or\n* \\return 'RCUTILS_RET_BAD_ALLOC` if no memory could be allocated correctly\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_uint8_array_init(
        uint8_array: *mut rcutils_uint8_array_t,
        buffer_capacity: usize,
        allocator: *const rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Finalize a uint8 array struct.\n**\n* Cleans up and deallocates any resources used in a rcutils_uint8_array_t.\n* The array passed to this function needs to have been initialized by\n* rcutils_uint8_array_init().\n* Passing an uninitialized instance to this function leads to undefined\n* behavior.\n*\n* \\param[in] uint8_array pointer to the rcutils_uint8_array_t to be cleaned up\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if the uint8_array argument is invalid\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_uint8_array_fini(uint8_array: *mut rcutils_uint8_array_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Resize the internal buffer of the uint8 array.\n**\n* The internal buffer of the uint8 array can be resized dynamically if needed.\n* If the new size is smaller than the current capacity, then the memory is\n* truncated.\n* Be aware, that this might deallocate the memory and therefore invalidates any\n* pointers to this storage.\n*\n* \\param[inout] uint8_array pointer to the instance of rcutils_uint8_array_t which is\n* being resized\n* \\param[in] new_size the new size of the internal buffer\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if new_size is set to zero\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation failed, or\n* \\return #RCUTILS_RET_ERROR if an unexpected error occurs.\n*/"]
    pub fn rcutils_uint8_array_resize(
        uint8_array: *mut rcutils_uint8_array_t,
        new_size: usize,
    ) -> rcutils_ret_t;
}
#[doc = " A single point in time, measured in nanoseconds since the Unix epoch."]
pub type rcutils_time_point_value_t = i64;
#[doc = " A duration of time, measured in nanoseconds."]
pub type rcutils_duration_value_t = i64;
extern "C" {
    #[doc = " This function returns the time from a system clock.\n The closest equivalent would be to std::chrono::system_clock::now();\n\n The resolution (e.g. nanoseconds vs microseconds) is not guaranteed.\n\n The now argument must point to an allocated rcutils_time_point_value_t object,\n as the result is copied into this variable.\n\n <hr>\n Attribute          | Adherence\n ------------------ | -------------\n Allocates Memory   | No\n Thread-Safe        | Yes\n Uses Atomics       | No\n Lock-Free          | Yes\n\n \\param[out] now a datafield in which the current time is stored\n \\return #RCUTILS_RET_OK if the current time was successfully obtained, or\n \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or\n \\return #RCUTILS_RET_ERROR if an unspecified error occur."]
    pub fn rcutils_system_time_now(now: *mut rcutils_time_point_value_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Retrieve the current time as a rcutils_time_point_value_t object.\n**\n* This function returns the time from a monotonically increasing clock.\n* The closest equivalent would be to std::chrono::steady_clock::now();\n*\n* The resolution (e.g. nanoseconds vs microseconds) is not guaranteed.\n*\n* The now argument must point to an allocated rcutils_time_point_value_t object,\n* as the result is copied into this variable.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | Yes\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[out] now a struct in which the current time is stored\n* \\return #RCUTILS_RET_OK if the current time was successfully obtained, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or\n* \\return #RCUTILS_RET_ERROR if an unspecified error occur.\n*/"]
    pub fn rcutils_steady_time_now(now: *mut rcutils_time_point_value_t) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Return a time point as nanoseconds in a string.\n**\n* The number is always fixed width, with left padding zeros up to the maximum\n* number of digits the time point can represent.\n* Right now that is 19 digits (so 19 characters) for a signed 64-bit integer.\n* Negative values will have a leading `-`, so they will be one character\n* longer than the positive values.\n*\n* The recommended minimum size of the input string is 32 characters, but\n* 21 (` ` or `-` for sign, 19 digits, null terminator) should be sufficiently\n* large for both positive and negative values.\n* If the given string is not large enough, the result will be truncated.\n* If you need a string with variable width, using `snprintf()` directly is\n* recommended.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No [1]\n* Thread-Safe        | Yes\n* Uses Atomics       | No\n* Lock-Free          | Yes\n* <i>[1] if `snprintf()` does not allocate additional memory internally</i>\n*\n* \\param[in] time_point the time to be made into a string\n* \\param[out] str the output string in which it is stored\n* \\param[in] str_size the size of the output string\n* \\return #RCUTILS_RET_OK if successful (even if truncated), or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or\n* \\return #RCUTILS_RET_ERROR if an unspecified error occur.\n*/"]
    pub fn rcutils_time_point_value_as_nanoseconds_string(
        time_point: *const rcutils_time_point_value_t,
        str_: *mut ::std::os::raw::c_char,
        str_size: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Return a time point as floating point seconds in a string.\n**\n* The number is always fixed width, with left padding zeros up to the maximum\n* number of digits for the mantissa that the time point can represent and a\n* characteristic (fractional-part) with a fixed width of 9 digits.\n* Right now that means the mantissa is always 10 digits to add up to 19 total\n* for the signed 64-bit time point type.\n* Negative values will have a leading `-`, so they will be one character\n* longer then positive values.\n*\n* The recommended minimum size of the input string is 32 characters, but\n* 22 (` ` or `-` for sign, 19 digits, decimal point, null terminator) should\n* be sufficient for now.\n* If the given string is not large enough, the result will be truncated.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No [1]\n* Thread-Safe        | Yes\n* Uses Atomics       | No\n* Lock-Free          | Yes\n* <i>[1] if `snprintf()` does not allocate additional memory internally</i>\n*\n* \\param[in] time_point the time to be made into a string\n* \\param[out] str the output string in which it is stored\n* \\param[in] str_size the size of the output string\n* \\return #RCUTILS_RET_OK if successful (even if truncated), or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if any arguments are invalid, or\n* \\return #RCUTILS_RET_ERROR if an unspecified error occur.\n*/"]
    pub fn rcutils_time_point_value_as_seconds_string(
        time_point: *const rcutils_time_point_value_t,
        str_: *mut ::std::os::raw::c_char,
        str_size: usize,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " The flag if the logging system has been initialized."]
    pub static mut g_rcutils_logging_initialized: bool;
}
extern "C" {
    #[doc = " Initialize the logging system using the specified allocator.\n**\n* Initialize the logging system only if it was not in an initialized state.\n*\n* If an invalid allocator is passed, the initialization will fail.\n* Otherwise, this function will still set the internal state to initialized\n* even if an error occurs, to avoid repeated failing initialization attempts\n* since this function is called automatically from logging macros.\n* To re-attempt initialization, call rcutils_logging_shutdown() before\n* re-calling this function.\n*\n* If multiple errors occur, the error code of the last error will be returned.\n*\n* The `RCUTILS_CONSOLE_OUTPUT_FORMAT` environment variable can be used to set\n* the output format of messages logged to the console.\n* Available tokens are:\n*   - `file_name`, the full file name of the caller including the path\n*   - `function_name`, the function name of the caller\n*   - `line_number`, the line number of the caller\n*   - `message`, the message string after it has been formatted\n*   - `name`, the full logger name\n*   - `severity`, the name of the severity level, e.g. `INFO`\n*   - `time`, the timestamp of log message in floating point seconds\n*   - `time_as_nanoseconds`, the timestamp of log message in integer nanoseconds\n*\n* The `RCUTILS_COLORIZED_OUTPUT` environment variable allows configuring if colours\n* are used or not. Available values are:\n*  - `1`: Force using colours.\n*  - `0`: Don't use colours.\n* If it is unset, colours are used depending if the target stream is a terminal or not.\n* See `isatty` documentation.\n*\n* The format string can use these tokens by referencing them in curly brackets,\n* e.g. `\"[{severity}] [{name}]: {message} ({function_name}() at {file_name}:{line_number})\"`.\n* Any number of tokens can be used.\n* The limit of the format string is 2048 characters.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] allocator rcutils_allocator_t to be used.\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if the allocator is invalid, in which\n*   case initialization will fail, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if an error occurs reading the output\n*   format from the `RCUTILS_CONSOLE_OUTPUT_FORMAT` environment variable, in\n*   which case the default format will be used, or\n* \\return #RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID if the internal logger\n*   severity level map cannot be initialized, in which case logger severity\n*   levels will not be configurable.\n*/"]
    pub fn rcutils_logging_initialize_with_allocator(
        allocator: rcutils_allocator_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Initialize the logging system.\n**\n* Call rcutils_logging_initialize_with_allocator() using the default allocator.\n* This function is called automatically when using the logging macros.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT if an error occurs reading the output\n*   format from the `RCUTILS_CONSOLE_OUTPUT_FORMAT` environment variable, in\n*   which case the default format will be used, or\n* \\return #RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID if the internal logger\n*   severity level map cannot be initialized, in which case logger levels\n*   will not be configurable.\n*/"]
    pub fn rcutils_logging_initialize() -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Shutdown the logging system.\n**\n* Free the resources allocated for the logging system.\n* This puts the system into a state equivalent to being uninitialized.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID if the internal logger\n*   severity level map cannot be finalized.\n*/"]
    pub fn rcutils_logging_shutdown() -> rcutils_ret_t;
}
#[doc = " The structure identifying the caller location in the source code."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_log_location_s {
    #[doc = " The name of the function containing the log call."]
    pub function_name: *const ::std::os::raw::c_char,
    #[doc = " The name of the source file containing the log call."]
    pub file_name: *const ::std::os::raw::c_char,
    #[doc = " The line number containing the log call."]
    pub line_number: usize,
}
#[test]
fn bindgen_test_layout_rcutils_log_location_s() {
    const UNINIT: ::std::mem::MaybeUninit<rcutils_log_location_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rcutils_log_location_s>(),
        24usize,
        concat!("Size of: ", stringify!(rcutils_log_location_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rcutils_log_location_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rcutils_log_location_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).function_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_log_location_s),
            "::",
            stringify!(function_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_log_location_s),
            "::",
            stringify!(file_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line_number) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rcutils_log_location_s),
            "::",
            stringify!(line_number)
        )
    );
}
#[doc = " The structure identifying the caller location in the source code."]
pub type rcutils_log_location_t = rcutils_log_location_s;
#[doc = "< The unset log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_UNSET: RCUTILS_LOG_SEVERITY = 0;
#[doc = "< The debug log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_DEBUG: RCUTILS_LOG_SEVERITY = 10;
#[doc = "< The info log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_INFO: RCUTILS_LOG_SEVERITY = 20;
#[doc = "< The warn log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_WARN: RCUTILS_LOG_SEVERITY = 30;
#[doc = "< The error log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_ERROR: RCUTILS_LOG_SEVERITY = 40;
#[doc = "< The fatal log level"]
pub const RCUTILS_LOG_SEVERITY_RCUTILS_LOG_SEVERITY_FATAL: RCUTILS_LOG_SEVERITY = 50;
#[doc = " The severity levels of log messages / loggers.\n**\n* Note: all logging levels have their Least Significant Bit as 0, which is used as an\n* optimization.  If adding new logging levels, ensure that the new levels keep this property.\n*/"]
pub type RCUTILS_LOG_SEVERITY = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " The names of severity levels."]
    pub static g_rcutils_log_severity_names: [*const ::std::os::raw::c_char; 51usize];
}
extern "C" {
    #[doc = " Get a severity value from its string representation (e.g. DEBUG).\n**\n* String representation must match one of the values in\n* `g_rcutils_log_severity_names`, but is not case-sensitive.\n* Examples: UNSET, DEBUG, INFO, WARN, Error, fatal.\n*\n* \\param[in] severity_string String representation of the severity, must be a\n*   null terminated c string\n* \\param[in] allocator rcutils_allocator_t to be used\n* \\param[in,out] severity The severity level as a represented by the\n*   `RCUTILS_LOG_SEVERITY` enum\n* \\return #RCUTILS_RET_OK if successful, or\n* \\return #RCUTILS_RET_INVALID_ARGUMENT on invalid arguments, or\n* \\return #RCUTILS_RET_LOGGING_SEVERITY_STRING_INVALID if unable to match\n*   string, or\n* \\return #RCUTILS_RET_ERROR if an unspecified error occured.\n*/"]
    pub fn rcutils_logging_severity_level_from_string(
        severity_string: *const ::std::os::raw::c_char,
        allocator: rcutils_allocator_t,
        severity: *mut ::std::os::raw::c_int,
    ) -> rcutils_ret_t;
}
#[doc = " The function signature to log messages.\n**\n* \\param[in] location The location information about where the log came from\n* \\param[in] severity The severity of the log message expressed as an integer\n* \\param[in] name The name of the logger that this message came from\n* \\param[in] timestamp The time at which the log message was generated\n* \\param[in] format The list of arguments to insert into the formatted log message\n* \\param[in] args The variable argument list\n*/"]
pub type rcutils_logging_output_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        timestamp: rcutils_time_point_value_t,
        format: *const ::std::os::raw::c_char,
        args: *mut va_list,
    ),
>;
extern "C" {
    #[doc = " Get the current output handler.\n**\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, provided logging system is already initialized\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\return The function pointer of the current output handler.\n*/"]
    pub fn rcutils_logging_get_output_handler() -> rcutils_logging_output_handler_t;
}
extern "C" {
    #[doc = " Set the current output handler.\n**\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, provided logging system is already initialized\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] function The function pointer of the output handler to be used.\n*/"]
    pub fn rcutils_logging_set_output_handler(function: rcutils_logging_output_handler_t);
}
extern "C" {
    #[doc = " Formats a log message according to RCUTILS_CONSOLE_OUTPUT_FORMAT\n**\n* A formatter that is meant to be used by an output handler to format a log message to the match\n* the format specified in RCUTILS_CONSOLE_OUTPUT_FORMAT by performing token replacement.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] location The location information about where the log came from\n* \\param[in] severity The severity of the log message expressed as an integer\n* \\param[in] name The name of the logger that this message came from\n* \\param[in] timestamp The time at which the log message was generated\n* \\param[in] msg The message being logged\n* \\param[out] logging_output An output buffer for the formatted message\n* \\return #RCUTILS_RET_OK if successful.\n* \\return #RCUTILS_RET_BAD_ALLOC if memory allocation error occured\n*/"]
    pub fn rcutils_logging_format_message(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        timestamp: rcutils_time_point_value_t,
        msg: *const ::std::os::raw::c_char,
        logging_output: *mut rcutils_char_array_t,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Get the default level for loggers.\n**\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, provided logging system is already initialized\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\return The level.\n*/"]
    pub fn rcutils_logging_get_default_logger_level() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the default severity level for loggers.\n**\n* If the severity level requested is `RCUTILS_LOG_SEVERITY_UNSET`, the default\n* value for the default logger (`RCUTILS_DEFAULT_LOGGER_DEFAULT_LEVEL`)\n* will be restored instead.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, provided logging system is already initialized\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] level The level to be used.\n*/"]
    pub fn rcutils_logging_set_default_logger_level(level: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " Get the severity level for a logger.\n**\n* This considers the severity level of the specifed logger only.\n* To get the effective level of a logger given the severity level of its\n* ancestors, see rcutils_logging_get_logger_effective_level().\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, provided logging system is already initialized\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] name The name of the logger, must be null terminated c string\n* \\return The level of the logger if it has been set, or\n* \\return `RCUTILS_LOG_SEVERITY_UNSET` if unset, or\n* \\return the default logger level for an empty name, or\n* \\return -1 on invalid arguments, or\n* \\return -1 if an error occurred\n*/"]
    pub fn rcutils_logging_get_logger_level(
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the level for a logger and its name length.\n**\n* Identical to rcutils_logging_get_logger_level() but without\n* relying on the logger name to be a null terminated c string.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, provided logging system is already initialized\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] name The name of the logger\n* \\param[in] name_length Logger name length\n* \\return The level of the logger if it has been set, or\n* \\return `RCUTILS_LOG_SEVERITY_UNSET` if unset, or\n* \\return the default logger level for an empty name, or\n* \\return -1 on invalid arguments, or\n* \\return -1 if an error occurred\n*/"]
    pub fn rcutils_logging_get_logger_leveln(
        name: *const ::std::os::raw::c_char,
        name_length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the severity level for a logger.\n**\n* If an empty string is specified as the name, the default logger level will be set.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | Yes\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] name The name of the logger, must be null terminated c string.\n* \\param[in] level The level to be used.\n* \\return `RCUTILS_RET_OK` if successful, or\n* \\return `RCUTILS_RET_INVALID_ARGUMENT` on invalid arguments, or\n* \\return `RCUTILS_RET_LOGGING_SEVERITY_MAP_INVALID` if severity map invalid, or\n* \\return `RCUTILS_RET_ERROR` if an unspecified error occured\n*/"]
    pub fn rcutils_logging_set_logger_level(
        name: *const ::std::os::raw::c_char,
        level: ::std::os::raw::c_int,
    ) -> rcutils_ret_t;
}
extern "C" {
    #[doc = " Determine if a logger is enabled for a severity level.\n**\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, provided logging system is already initialized\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] name The name of the logger, must be null terminated c string or NULL.\n* \\param[in] severity The severity level.\n*\n* \\return `true` if the logger is enabled for the level, or\n* \\return `false` otherwise.\n*/"]
    pub fn rcutils_logging_logger_is_enabled_for(
        name: *const ::std::os::raw::c_char,
        severity: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[doc = " Determine the effective level for a logger.\n**\n* The effective level is determined as the severity level of\n* the logger if it is set, otherwise it is the first specified severity\n* level of the logger's ancestors, starting with its closest ancestor.\n* The ancestor hierarchy is signified by logger names being separated by dots:\n* a logger named `x` is an ancestor of `x.y`, and both `x` and `x.y` are\n* ancestors of `x.y.z`, etc.\n* If the level has not been set for the logger nor any of its\n* ancestors, the default level is used.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, provided logging system is already initialized\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] name The name of the logger, must be null terminated c string.\n*\n* \\return The level, or\n* \\return -1 on invalid arguments, or\n* \\return -1 if an error occurred.\n*/"]
    pub fn rcutils_logging_get_logger_effective_level(
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Internal call to log a message.\n**\n* Unconditionally log a message.\n* This is an internal function, and assumes that the caller has already called\n* rcutils_logging_logger_is_enabled_for().\n* End-user software should never call this, and instead should call rcutils_log()\n* or one of the RCUTILS_LOG_ macros.\n*\n* The attributes of this function are influenced by the currently set output handler.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, for formatted outputs <= 1023 characters\n*                    | Yes, for formatted outputs >= 1024 characters\n* Thread-Safe        | No\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] location The pointer to the location struct or NULL\n* \\param[in] severity The severity level\n* \\param[in] name The name of the logger, must be null terminated c string or NULL\n* \\param[in] format The format string\n* \\param[in] ... The variable arguments\n*/"]
    pub fn rcutils_log_internal(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    #[doc = " Log a message.\n**\n* The attributes of this function are influenced by the currently set output handler.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No, for formatted outputs <= 1023 characters\n*                    | Yes, for formatted outputs >= 1024 characters\n* Thread-Safe        | Yes, with itself [1]\n* Uses Atomics       | No\n* Lock-Free          | Yes\n* <i>[1] should be thread-safe with itself but not with other logging functions</i>\n*\n* This should be thread-safe with itself, but is not thread-safe with other\n* logging functions that do things like set logger levels.\n*\n* \\todo There are no thread-safety gurantees between this function and other\n*   logging functions in rcutils, even though it is likely users are calling\n*   them concurrently today.\n*   We need to revisit these functions with respect to this issue and make\n*   guarantees where we can, and change functions higher in the stack to\n*   provide the thread-safety where we cannot.\n*\n* \\param[in] location The pointer to the location struct or NULL\n* \\param[in] severity The severity level\n* \\param[in] name The name of the logger, must be null terminated c string or NULL\n* \\param[in] format The format string\n* \\param[in] ... The variable arguments\n*/"]
    pub fn rcutils_log(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    #[doc = " The default output handler outputs log messages to the standard streams.\n**\n* The messages with a severity level `DEBUG` and `INFO` are written to `stdout`.\n* The messages with a severity level `WARN`, `ERROR`, and `FATAL` are written\n* to `stderr`.\n* The console output format of the logged message can be configured through\n* the `RCUTILS_CONSOLE_OUTPUT_FORMAT` environment variable: see\n* rcutils_logging_initialize_with_allocator() for details.\n* For configuring if using colours or not, `RCUTILS_COLORIZED_OUTPUT` can be used:\n* see rcutils_logging_initialize_with_allocator() for details.\n*\n* <hr>\n* Attribute          | Adherence\n* ------------------ | -------------\n* Allocates Memory   | No\n* Thread-Safe        | Yes, if the underlying *printf functions are\n* Uses Atomics       | No\n* Lock-Free          | Yes\n*\n* \\param[in] location The pointer to the location struct or NULL\n* \\param[in] severity The severity level\n* \\param[in] name The name of the logger, must be null terminated c string\n* \\param[in] timestamp The timestamp for when the log message was made\n* \\param[in] format The format string\n* \\param[in] args The `va_list` used by the logger\n*/"]
    pub fn rcutils_logging_console_output_handler(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        timestamp: rcutils_time_point_value_t,
        format: *const ::std::os::raw::c_char,
        args: *mut va_list,
    );
}
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_INVALID: rmw_qos_policy_kind_e = 1;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_DURABILITY: rmw_qos_policy_kind_e = 2;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_DEADLINE: rmw_qos_policy_kind_e = 4;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_LIVELINESS: rmw_qos_policy_kind_e = 8;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_RELIABILITY: rmw_qos_policy_kind_e = 16;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_HISTORY: rmw_qos_policy_kind_e = 32;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_LIFESPAN: rmw_qos_policy_kind_e = 64;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_DEPTH: rmw_qos_policy_kind_e = 128;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_LIVELINESS_LEASE_DURATION: rmw_qos_policy_kind_e =
    256;
pub const rmw_qos_policy_kind_e_RMW_QOS_POLICY_AVOID_ROS_NAMESPACE_CONVENTIONS:
    rmw_qos_policy_kind_e = 512;
#[doc = " QoS Policy Kinds"]
pub type rmw_qos_policy_kind_e = ::std::os::raw::c_uint;
#[doc = " QoS Policy Kinds"]
pub use self::rmw_qos_policy_kind_e as rmw_qos_policy_kind_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_qos_incompatible_event_status_s {
    #[doc = " Total cumulative number of times the concerned subscription discovered a\n publisher for the same topic with an offered QoS that was incompatible\n with that requested by the subscription."]
    pub total_count: i32,
    #[doc = " The change in total_count since the last time the status was read."]
    pub total_count_change: i32,
    #[doc = " The Qos Policy Kind of one of the policies that was found to be\n incompatible the last time an incompatibility was detected."]
    pub last_policy_kind: rmw_qos_policy_kind_t,
}
#[test]
fn bindgen_test_layout_rmw_qos_incompatible_event_status_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_qos_incompatible_event_status_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_qos_incompatible_event_status_s>(),
        12usize,
        concat!("Size of: ", stringify!(rmw_qos_incompatible_event_status_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_qos_incompatible_event_status_s>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(rmw_qos_incompatible_event_status_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_qos_incompatible_event_status_s),
            "::",
            stringify!(total_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count_change) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_qos_incompatible_event_status_s),
            "::",
            stringify!(total_count_change)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_policy_kind) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_qos_incompatible_event_status_s),
            "::",
            stringify!(last_policy_kind)
        )
    );
}
pub type rmw_qos_incompatible_event_status_t = rmw_qos_incompatible_event_status_s;
#[doc = " Event state for a subscription's 'RMW_EVENT_REQUESTED_QOS_INCOMPATIBLE' events."]
pub type rmw_requested_qos_incompatible_event_status_t = rmw_qos_incompatible_event_status_t;
#[doc = " Event state for a publisher's 'RMW_EVENT_OFFERED_QOS_INCOMPATIBLE' events."]
pub type rmw_offered_qos_incompatible_event_status_t = rmw_qos_incompatible_event_status_t;
#[doc = " Incompatible type information provided by a topic."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_incompatible_type_status_s {
    #[doc = " Lifetime cumulative number of incompatible types detected."]
    pub total_count: i32,
    #[doc = " The incremental number of incompatible types detected since the status was read."]
    pub total_count_change: i32,
}
#[test]
fn bindgen_test_layout_rmw_incompatible_type_status_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_incompatible_type_status_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_incompatible_type_status_s>(),
        8usize,
        concat!("Size of: ", stringify!(rmw_incompatible_type_status_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_incompatible_type_status_s>(),
        4usize,
        concat!("Alignment of ", stringify!(rmw_incompatible_type_status_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_incompatible_type_status_s),
            "::",
            stringify!(total_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count_change) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_incompatible_type_status_s),
            "::",
            stringify!(total_count_change)
        )
    );
}
#[doc = " Incompatible type information provided by a topic."]
pub type rmw_incompatible_type_status_t = rmw_incompatible_type_status_s;
#[doc = " QoS Liveliness Changed information provided by a subscription."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_liveliness_changed_status_s {
    #[doc = " The total number of currently active Publishers which publish to the topic associated with\n the Subscription.\n This count increases when a newly matched Publisher asserts its liveliness for the first time\n or when a Publisher previously considered to be not alive reasserts its liveliness.\n The count decreases when a Publisher considered alive fails to assert its liveliness and\n becomes not alive, whether because it was deleted normally or for some other reason."]
    pub alive_count: i32,
    #[doc = " The total count of current Publishers which publish to the topic associated with the\n Subscription that are no longer asserting their liveliness.\n This count increases when a Publisher considered alive fails to assert its liveliness and\n becomes not alive for some reason other than the normal deletion of that Publisher.\n It decreases when a previously not alive Publisher either reasserts its liveliness or is\n deleted normally."]
    pub not_alive_count: i32,
    #[doc = " The change in the alive_count since the status was last read."]
    pub alive_count_change: i32,
    #[doc = " The change in the not_alive_count since the status was last read."]
    pub not_alive_count_change: i32,
}
#[test]
fn bindgen_test_layout_rmw_liveliness_changed_status_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_liveliness_changed_status_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_liveliness_changed_status_s>(),
        16usize,
        concat!("Size of: ", stringify!(rmw_liveliness_changed_status_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_liveliness_changed_status_s>(),
        4usize,
        concat!("Alignment of ", stringify!(rmw_liveliness_changed_status_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alive_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_liveliness_changed_status_s),
            "::",
            stringify!(alive_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).not_alive_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_liveliness_changed_status_s),
            "::",
            stringify!(not_alive_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alive_count_change) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_liveliness_changed_status_s),
            "::",
            stringify!(alive_count_change)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).not_alive_count_change) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_liveliness_changed_status_s),
            "::",
            stringify!(not_alive_count_change)
        )
    );
}
#[doc = " QoS Liveliness Changed information provided by a subscription."]
pub type rmw_liveliness_changed_status_t = rmw_liveliness_changed_status_s;
#[doc = " QoS Liveliness Lost information provided by a publisher."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_liveliness_lost_status_s {
    #[doc = " Lifetime cumulative number of times that a previously-alive Publisher became not alive due to\n a failure to actively signal its liveliness within its offered liveliness period.\n This count does not change when an already not alive Publisher simply remains not alive for\n another liveliness period."]
    pub total_count: i32,
    #[doc = " The change in total_count since the last time the status was last read."]
    pub total_count_change: i32,
}
#[test]
fn bindgen_test_layout_rmw_liveliness_lost_status_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_liveliness_lost_status_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_liveliness_lost_status_s>(),
        8usize,
        concat!("Size of: ", stringify!(rmw_liveliness_lost_status_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_liveliness_lost_status_s>(),
        4usize,
        concat!("Alignment of ", stringify!(rmw_liveliness_lost_status_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_liveliness_lost_status_s),
            "::",
            stringify!(total_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count_change) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_liveliness_lost_status_s),
            "::",
            stringify!(total_count_change)
        )
    );
}
#[doc = " QoS Liveliness Lost information provided by a publisher."]
pub type rmw_liveliness_lost_status_t = rmw_liveliness_lost_status_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_matched_status_s {
    #[doc = " For publisher, the total cumulative count of subscribers matched to the concerned publisher.\n\n For subscriber, the total cumulative count of publishers matched to the concerned subscriber."]
    pub total_count: usize,
    #[doc = " total_count change since last time the status was read."]
    pub total_count_change: usize,
    #[doc = " For publisher, the number of subscribers currently matched to the concerned publisher.\n\n For subscriber, the number of publishers currently matched to the concerned subscriber."]
    pub current_count: usize,
    #[doc = " The current_count change since last time the status was read."]
    pub current_count_change: i32,
}
#[test]
fn bindgen_test_layout_rmw_matched_status_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_matched_status_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_matched_status_s>(),
        32usize,
        concat!("Size of: ", stringify!(rmw_matched_status_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_matched_status_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_matched_status_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_matched_status_s),
            "::",
            stringify!(total_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count_change) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_matched_status_s),
            "::",
            stringify!(total_count_change)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current_count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_matched_status_s),
            "::",
            stringify!(current_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current_count_change) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_matched_status_s),
            "::",
            stringify!(current_count_change)
        )
    );
}
pub type rmw_matched_status_t = rmw_matched_status_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_message_lost_status_s {
    #[doc = " Total number of messages lost."]
    pub total_count: usize,
    #[doc = " Number of messages lost since last callback."]
    pub total_count_change: usize,
}
#[test]
fn bindgen_test_layout_rmw_message_lost_status_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_message_lost_status_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_message_lost_status_s>(),
        16usize,
        concat!("Size of: ", stringify!(rmw_message_lost_status_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_message_lost_status_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_message_lost_status_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_message_lost_status_s),
            "::",
            stringify!(total_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count_change) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_message_lost_status_s),
            "::",
            stringify!(total_count_change)
        )
    );
}
pub type rmw_message_lost_status_t = rmw_message_lost_status_s;
#[doc = " QoS Deadline Missed information provided by a publisher."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_offered_deadline_missed_status_s {
    #[doc = " Lifetime cumulative number of offered deadline periods elapsed during which a Publisher failed\n to provide data.\n Missed deadlines accumulate; that is, each deadline period the total_count will be incremented\n by one."]
    pub total_count: i32,
    #[doc = " The change in total_count since the last time the status was last read."]
    pub total_count_change: i32,
}
#[test]
fn bindgen_test_layout_rmw_offered_deadline_missed_status_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_offered_deadline_missed_status_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_offered_deadline_missed_status_s>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(rmw_offered_deadline_missed_status_s)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_offered_deadline_missed_status_s>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(rmw_offered_deadline_missed_status_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_offered_deadline_missed_status_s),
            "::",
            stringify!(total_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count_change) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_offered_deadline_missed_status_s),
            "::",
            stringify!(total_count_change)
        )
    );
}
#[doc = " QoS Deadline Missed information provided by a publisher."]
pub type rmw_offered_deadline_missed_status_t = rmw_offered_deadline_missed_status_s;
#[doc = " QoS Requested Deadline Missed information provided by a subscription."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_requested_deadline_missed_status_s {
    #[doc = " Lifetime cumulative number of missed deadlines detected for any instance read by the\n subscription.\n Missed deadlines accumulate; that is, each deadline period the total_count will be incremented\n by one for each instance for which data was not received."]
    pub total_count: i32,
    #[doc = " The incremental number of deadlines detected since the status was read."]
    pub total_count_change: i32,
}
#[test]
fn bindgen_test_layout_rmw_requested_deadline_missed_status_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_requested_deadline_missed_status_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_requested_deadline_missed_status_s>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(rmw_requested_deadline_missed_status_s)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_requested_deadline_missed_status_s>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(rmw_requested_deadline_missed_status_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_requested_deadline_missed_status_s),
            "::",
            stringify!(total_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_count_change) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_requested_deadline_missed_status_s),
            "::",
            stringify!(total_count_change)
        )
    );
}
#[doc = " QoS Requested Deadline Missed information provided by a subscription."]
pub type rmw_requested_deadline_missed_status_t = rmw_requested_deadline_missed_status_s;
#[doc = " \\brief Serialized message as a string of bytes.\n\n It includes (but it is not limited to) the following members:\n   \\e \\c buffer the reference to internal storage, as a pointer\n   \\e \\c buffer_length the size of stored contents, as an unsigned integer\n   \\e \\c buffer_capacity the capacity of internal storage, as an unsigned integer"]
pub type rmw_serialized_message_t = rcutils_uint8_array_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_subscription_content_filter_options_s {
    #[doc = " Specify the criteria to select the data samples of interest.\n\n It is similar to the WHERE part of an SQL clause."]
    pub filter_expression: *mut ::std::os::raw::c_char,
    #[doc = " Give values to the tokens placeholder parameters (i.e., \"%n\" tokens begin from 0) in the\n filter_expression. The number of supplied parameters must fit with the requested values.\n\n It can be NULL if there is no \"%n\" tokens placeholder in filter_expression.\n The maximum index number must be smaller than 100."]
    pub expression_parameters: rcutils_string_array_t,
}
#[test]
fn bindgen_test_layout_rmw_subscription_content_filter_options_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_subscription_content_filter_options_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_subscription_content_filter_options_s>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(rmw_subscription_content_filter_options_s)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_subscription_content_filter_options_s>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rmw_subscription_content_filter_options_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filter_expression) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_content_filter_options_s),
            "::",
            stringify!(filter_expression)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expression_parameters) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_content_filter_options_s),
            "::",
            stringify!(expression_parameters)
        )
    );
}
pub type rmw_subscription_content_filter_options_t = rmw_subscription_content_filter_options_s;
extern "C" {
    #[doc = " Get zero initialized content filter options."]
    pub fn rmw_get_zero_initialized_content_filter_options(
    ) -> rmw_subscription_content_filter_options_t;
}
extern "C" {
    #[doc = " Initialize the given content filter options.\n**\n* \\param[in] filter_expression The filter expression.\n* \\param[in] expression_parameters_argc The expression parameters argc.\n* \\param[in] expression_parameter_argv The expression parameters argv.\n* \\param[in] allocator The allocator used when copying data to the content filter options.\n* \\param[out] options The content filter options to be set.\n* \\returns RMW_RET_INVALID_ARGUMENT, or\n* \\returns RMW_RET_BAD_ALLOC, or\n* \\returns RMW_RET_OK\n*/"]
    pub fn rmw_subscription_content_filter_options_init(
        filter_expression: *const ::std::os::raw::c_char,
        expression_parameters_argc: usize,
        expression_parameter_argv: *mut *const ::std::os::raw::c_char,
        allocator: *const rcutils_allocator_t,
        options: *mut rmw_subscription_content_filter_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Set the given content filter options.\n**\n* \\param[in] filter_expression The filter expression.\n* \\param[in] expression_parameters_argc The expression parameters argc.\n* \\param[in] expression_parameter_argv The expression parameters argv.\n* \\param[in] allocator The allocator used when copying data to the content filter options.\n* \\param[out] options The content filter options to be set.\n* \\returns RMW_RET_INVALID_ARGUMENT, or\n* \\returns RMW_RET_BAD_ALLOC, or\n* \\returns RMW_RET_OK\n*/"]
    pub fn rmw_subscription_content_filter_options_set(
        filter_expression: *const ::std::os::raw::c_char,
        expression_parameters_argc: usize,
        expression_parameter_argv: *mut *const ::std::os::raw::c_char,
        allocator: *const rcutils_allocator_t,
        options: *mut rmw_subscription_content_filter_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Copy the given content filter options.\n**\n* \\param[in] src content filter options to be copied.\n* \\param[in] allocator allocator used when copying data to the new content filter options.\n* \\param[out] dst content filter options to be set.\n* \\returns RMW_RET_INVALID_ARGUMENT, or\n* \\returns RMW_RET_BAD_ALLOC, or\n* \\returns RMW_RET_OK\n*/"]
    pub fn rmw_subscription_content_filter_options_copy(
        src: *const rmw_subscription_content_filter_options_t,
        allocator: *const rcutils_allocator_t,
        dst: *mut rmw_subscription_content_filter_options_t,
    ) -> rmw_ret_t;
}
extern "C" {
    #[doc = " Finalize the content filter options.\n**\n* \\param[in] options content filter options to be finalized.\n* \\param[in] allocator allocator used to deallocate the content filter options.\n* \\returns RMW_RET_INVALID_ARGUMENT, or\n* \\returns RMW_RET_ERROR, or\n* \\returns RMW_RET_OK\n*/"]
    pub fn rmw_subscription_content_filter_options_fini(
        options: *mut rmw_subscription_content_filter_options_t,
        allocator: *const rcutils_allocator_t,
    ) -> rmw_ret_t;
}
#[doc = " A struct representing a duration or relative time in RMW - does not encode an origin."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_time_s {
    #[doc = " Seconds component"]
    pub sec: u64,
    #[doc = " Nanoseconds component"]
    pub nsec: u64,
}
#[test]
fn bindgen_test_layout_rmw_time_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_time_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_time_s>(),
        16usize,
        concat!("Size of: ", stringify!(rmw_time_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_time_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_time_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_time_s),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_time_s),
            "::",
            stringify!(nsec)
        )
    );
}
#[doc = " A struct representing a duration or relative time in RMW - does not encode an origin."]
pub type rmw_time_t = rmw_time_s;
pub type rmw_time_point_value_t = rcutils_time_point_value_t;
pub type rmw_duration_t = rcutils_duration_value_t;
extern "C" {
    #[doc = " Check whether two rmw_time_t represent the same time."]
    pub fn rmw_time_equal(left: rmw_time_t, right: rmw_time_t) -> bool;
}
extern "C" {
    #[doc = " Return the total nanosecond representation of a time.\n**\n* \\return INT64_MAX if input is too large to store in 64 bits\n*/"]
    pub fn rmw_time_total_nsec(time: rmw_time_t) -> rmw_duration_t;
}
extern "C" {
    #[doc = " Construct rmw_time_t from a total nanoseconds representation.\n**\n* rmw_time_t only specifies relative time, so the origin is not relevant for this calculation.\n* \\return RMW_DURATION_INFINITE if input is negative, which is not representable in rmw_time_t\n*/"]
    pub fn rmw_time_from_nsec(nanoseconds: rmw_duration_t) -> rmw_time_t;
}
extern "C" {
    #[doc = " Ensure that an rmw_time_t does not have nanoseconds > 1 second."]
    pub fn rmw_time_normalize(time: rmw_time_t) -> rmw_time_t;
}
#[doc = " Structure which encapsulates an rmw node"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_node_s {
    #[doc = " Name of the rmw implementation"]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Type erased pointer to this node's data"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " A concise name of this rmw node for identification"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = " The namespace of this rmw node"]
    pub namespace_: *const ::std::os::raw::c_char,
    #[doc = " Context information about node's init specific information"]
    pub context: *mut rmw_context_t,
}
#[test]
fn bindgen_test_layout_rmw_node_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_node_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_node_s>(),
        40usize,
        concat!("Size of: ", stringify!(rmw_node_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_node_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_node_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_node_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_node_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_node_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).namespace_) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_node_s),
            "::",
            stringify!(namespace_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_node_s),
            "::",
            stringify!(context)
        )
    );
}
#[doc = " Structure which encapsulates an rmw node"]
pub type rmw_node_t = rmw_node_s;
#[doc = " Endpoint type has not yet been set"]
pub const rmw_endpoint_type_e_RMW_ENDPOINT_INVALID: rmw_endpoint_type_e = 0;
#[doc = " Creates and publishes messages to the ROS topic"]
pub const rmw_endpoint_type_e_RMW_ENDPOINT_PUBLISHER: rmw_endpoint_type_e = 1;
#[doc = " Listens for and receives messages from a topic"]
pub const rmw_endpoint_type_e_RMW_ENDPOINT_SUBSCRIPTION: rmw_endpoint_type_e = 2;
#[doc = " Endpoint enumeration type"]
pub type rmw_endpoint_type_e = ::std::os::raw::c_uint;
#[doc = " Endpoint enumeration type"]
pub use self::rmw_endpoint_type_e as rmw_endpoint_type_t;
#[doc = " Unique network flow endpoints not required"]
pub const rmw_unique_network_flow_endpoints_requirement_e_RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_NOT_REQUIRED : rmw_unique_network_flow_endpoints_requirement_e = 0 ;
#[doc = " Unique network flow endpoins strictly required.\n Error if not provided by RMW implementation."]
pub const rmw_unique_network_flow_endpoints_requirement_e_RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_STRICTLY_REQUIRED : rmw_unique_network_flow_endpoints_requirement_e = 1 ;
#[doc = " Unique network flow endpoints optionally required.\n No error if not provided RMW implementation."]
pub const rmw_unique_network_flow_endpoints_requirement_e_RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_OPTIONALLY_REQUIRED : rmw_unique_network_flow_endpoints_requirement_e = 2 ;
#[doc = " Unique network flow endpoints requirement decided by system."]
pub const rmw_unique_network_flow_endpoints_requirement_e_RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_SYSTEM_DEFAULT : rmw_unique_network_flow_endpoints_requirement_e = 3 ;
#[doc = " Unique network flow endpoints requirement enumeration"]
pub type rmw_unique_network_flow_endpoints_requirement_e = ::std::os::raw::c_uint;
#[doc = " Unique network flow endpoints requirement enumeration"]
pub use self::rmw_unique_network_flow_endpoints_requirement_e as rmw_unique_network_flow_endpoints_requirement_t;
#[doc = " Options that can be used to configure the creation of a publisher in rmw."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_publisher_options_s {
    #[doc = " Used to pass rmw implementation specific resources during publisher creation.\n**\n* This field is type erased (rather than forward declared) because it will\n* usually be a non-owned reference to an language specific object, e.g.\n* C++ it may be a polymorphic class that only the rmw implementation can use.\n*\n* The resource pointed to here needs to outlive this options structure, and\n* any rmw_publisher objects that are created using it, as they copy this\n* structure and may use this payload throughout their lifetime.\n*/"]
    pub rmw_specific_publisher_payload: *mut ::std::os::raw::c_void,
    #[doc = " Require middleware to generate unique network flow endpoints.\n**\n* Unique network flow endpoints are required to differentiate the QoS provided by\n* networks for flows between publishers and subscribers in communicating\n* nodes.\n* Default value is RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_NOT_REQUIRED.\n*/"]
    pub require_unique_network_flow_endpoints: rmw_unique_network_flow_endpoints_requirement_t,
}
#[test]
fn bindgen_test_layout_rmw_publisher_options_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_publisher_options_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_publisher_options_s>(),
        16usize,
        concat!("Size of: ", stringify!(rmw_publisher_options_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_publisher_options_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_publisher_options_s))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).rmw_specific_publisher_payload) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_options_s),
            "::",
            stringify!(rmw_specific_publisher_payload)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).require_unique_network_flow_endpoints) as usize
                - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_options_s),
            "::",
            stringify!(require_unique_network_flow_endpoints)
        )
    );
}
#[doc = " Options that can be used to configure the creation of a publisher in rmw."]
pub type rmw_publisher_options_t = rmw_publisher_options_s;
#[doc = " Structure which encapsulates an rmw publisher"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_publisher_s {
    #[doc = " Name of the rmw implementation"]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Type erased pointer to this publisher's data"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " The name of the ROS topic this publisher publishes to"]
    pub topic_name: *const ::std::os::raw::c_char,
    #[doc = " Publisher options.\n**\n* The options structure passed to rmw_create_publisher() should be\n* assigned to this field by the rmw implementation.\n* The fields should not be modified after creation, but\n* the contents of the options structure may or may not be const, i.e.\n* shallow const-ness.\n* This field is not marked const to avoid any const casting during setup.\n*/"]
    pub options: rmw_publisher_options_t,
    #[doc = " Indicate whether this publisher supports loaning messages"]
    pub can_loan_messages: bool,
}
#[test]
fn bindgen_test_layout_rmw_publisher_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_publisher_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_publisher_s>(),
        48usize,
        concat!("Size of: ", stringify!(rmw_publisher_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_publisher_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_publisher_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).topic_name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_s),
            "::",
            stringify!(topic_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_s),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).can_loan_messages) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_s),
            "::",
            stringify!(can_loan_messages)
        )
    );
}
#[doc = " Structure which encapsulates an rmw publisher"]
pub type rmw_publisher_t = rmw_publisher_s;
#[doc = " Options that can be used to configure the creation of a subscription in rmw."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_subscription_options_s {
    #[doc = " Used to pass rmw implementation specific resources during subscription creation.\n**\n* All the same details and restrictions of this field in\n* rmw_publisher_options_t apply to this struct as well.\n*\n* \\sa rmw_publisher_options_t.rmw_specific_publisher_payload\n*/"]
    pub rmw_specific_subscription_payload: *mut ::std::os::raw::c_void,
    #[doc = " If true then the middleware should not deliver data from local publishers.\n**\n* This setting is most often used when data should only be received from\n* remote nodes, especially to avoid \"double delivery\" when both intra- and\n* inter- process communication is taking place.\n*\n* \\todo(wjwwood): nail this down when participant mapping is sorted out.\n*   See: https://github.com/ros2/design/pull/250\n*\n* The definition of local is somewhat vague at the moment.\n* Right now it means local to the node, and that definition works best, but\n* may become more complicated when/if participants map to a context instead.\n*/"]
    pub ignore_local_publications: bool,
    #[doc = " Require middleware to generate unique network flow endpoints.\n**\n* Unique network flow endpoints are required to differentiate the QoS provided by\n* networks for flows between publishers and subscribers in communicating\n* nodes.\n* Default value is RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_NOT_REQUIRED.\n*/"]
    pub require_unique_network_flow_endpoints: rmw_unique_network_flow_endpoints_requirement_t,
    #[doc = " Used to create a content filter options during subscription creation."]
    pub content_filter_options: *mut rmw_subscription_content_filter_options_t,
}
#[test]
fn bindgen_test_layout_rmw_subscription_options_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_subscription_options_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_subscription_options_s>(),
        24usize,
        concat!("Size of: ", stringify!(rmw_subscription_options_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_subscription_options_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_subscription_options_s))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).rmw_specific_subscription_payload) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_options_s),
            "::",
            stringify!(rmw_specific_subscription_payload)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ignore_local_publications) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_options_s),
            "::",
            stringify!(ignore_local_publications)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).require_unique_network_flow_endpoints) as usize
                - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_options_s),
            "::",
            stringify!(require_unique_network_flow_endpoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).content_filter_options) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_options_s),
            "::",
            stringify!(content_filter_options)
        )
    );
}
#[doc = " Options that can be used to configure the creation of a subscription in rmw."]
pub type rmw_subscription_options_t = rmw_subscription_options_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_subscription_s {
    #[doc = " Name of the rmw implementation"]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Type erased pointer to this subscription"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " Name of the ros topic this subscription listens to"]
    pub topic_name: *const ::std::os::raw::c_char,
    #[doc = " Subscription options.\n**\n* The options structure passed to rmw_create_subscription() should be\n* assigned to this field by the rmw implementation.\n* The fields should not be modified after creation, but\n* the contents of the options structure may or may not be const, i.e.\n* shallow const-ness.\n* This field is not marked const to avoid any const casting during setup.\n*/"]
    pub options: rmw_subscription_options_t,
    #[doc = " Indicates whether this subscription can loan messages"]
    pub can_loan_messages: bool,
    #[doc = " Indicates whether content filtered topic of this subscription is enabled"]
    pub is_cft_enabled: bool,
}
#[test]
fn bindgen_test_layout_rmw_subscription_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_subscription_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_subscription_s>(),
        56usize,
        concat!("Size of: ", stringify!(rmw_subscription_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_subscription_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_subscription_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).topic_name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_s),
            "::",
            stringify!(topic_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_s),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).can_loan_messages) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_s),
            "::",
            stringify!(can_loan_messages)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_cft_enabled) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_s),
            "::",
            stringify!(is_cft_enabled)
        )
    );
}
pub type rmw_subscription_t = rmw_subscription_s;
#[doc = " A handle to an rmw service"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_service_s {
    #[doc = " The name of the rmw implementation"]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Type erased pointer to this service"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " The name of this service as exposed to the ros graph"]
    pub service_name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_rmw_service_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_service_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_service_s>(),
        24usize,
        concat!("Size of: ", stringify!(rmw_service_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_service_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_service_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_service_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_service_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).service_name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_service_s),
            "::",
            stringify!(service_name)
        )
    );
}
#[doc = " A handle to an rmw service"]
pub type rmw_service_t = rmw_service_s;
#[doc = " A handle to an rmw service client"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_client_s {
    #[doc = " The name of the rmw implementation"]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Type erased pointer to this service client"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " The name of this service as exposed to the ros graph"]
    pub service_name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_rmw_client_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_client_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_client_s>(),
        24usize,
        concat!("Size of: ", stringify!(rmw_client_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_client_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_client_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_client_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_client_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).service_name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_client_s),
            "::",
            stringify!(service_name)
        )
    );
}
#[doc = " A handle to an rmw service client"]
pub type rmw_client_t = rmw_client_s;
#[doc = " Handle for an rmw guard condition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_guard_condition_s {
    #[doc = " The name of the rmw implementation"]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Type erased pointer to this guard condition"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " rmw context associated with this guard condition"]
    pub context: *mut rmw_context_t,
}
#[test]
fn bindgen_test_layout_rmw_guard_condition_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_guard_condition_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_guard_condition_s>(),
        24usize,
        concat!("Size of: ", stringify!(rmw_guard_condition_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_guard_condition_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_guard_condition_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_guard_condition_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_guard_condition_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_guard_condition_s),
            "::",
            stringify!(context)
        )
    );
}
#[doc = " Handle for an rmw guard condition"]
pub type rmw_guard_condition_t = rmw_guard_condition_s;
#[doc = " Allocation of memory for an rmw publisher"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_publisher_allocation_s {
    #[doc = " The name of the rmw implementation"]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Type erased pointer to this allocation"]
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rmw_publisher_allocation_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_publisher_allocation_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_publisher_allocation_s>(),
        16usize,
        concat!("Size of: ", stringify!(rmw_publisher_allocation_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_publisher_allocation_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_publisher_allocation_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_allocation_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_publisher_allocation_s),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " Allocation of memory for an rmw publisher"]
pub type rmw_publisher_allocation_t = rmw_publisher_allocation_s;
#[doc = " Allocation of memory for an rmw subscription"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_subscription_allocation_s {
    #[doc = " The name of the rmw implementation"]
    pub implementation_identifier: *const ::std::os::raw::c_char,
    #[doc = " Type erased pointer to this allocation"]
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rmw_subscription_allocation_s() {
    const UNINIT: ::std::mem::MaybeUninit<rmw_subscription_allocation_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rmw_subscription_allocation_s>(),
        16usize,
        concat!("Size of: ", stringify!(rmw_subscription_allocation_s))
    );
    assert_eq!(
        ::std::mem::align_of::<rmw_subscription_allocation_s>(),
        8usize,
        concat!("Alignment of ", stringify!(rmw_subscription_allocation_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementation_identifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_allocation_s),
            "::",
            stringify!(implementation_identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rmw_subscription_allocation_s),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " Allocation of memory for an rmw subscription"]
pub type rmw_subscription_allocation_t = rmw_subscription_allocation_s;
