use crate::rcl::{rosidl_message_type_support_t, rosidl_service_type_support_t};
/* automatically generated by rust-bindgen 0.59.2 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;

pub const __WCOREFLAG: u32 = 128;
pub const __HAVE_FLOAT128: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT128: u32 = 0;
pub const __HAVE_FLOAT64X: u32 = 1;
pub const __HAVE_FLOAT64X_LONG_DOUBLE: u32 = 1;
pub const __HAVE_FLOAT16: u32 = 0;
pub const __HAVE_FLOAT32: u32 = 1;
pub const __HAVE_FLOAT64: u32 = 1;
pub const __HAVE_FLOAT32X: u32 = 1;
pub const __HAVE_FLOAT128X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT16: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT32: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT64: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT32X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT64X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT128X: u32 = 0;
pub const __HAVE_FLOATN_NOT_TYPEDEF: u32 = 0;
pub const __ldiv_t_defined: u32 = 1;
pub const __lldiv_t_defined: u32 = 1;
pub const RAND_MAX: u32 = 2147483647;
pub const EXIT_FAILURE: u32 = 1;
pub const EXIT_SUCCESS: u32 = 0;
pub const _SYS_TYPES_H: u32 = 1;
pub const __clock_t_defined: u32 = 1;
pub const __clockid_t_defined: u32 = 1;
pub const __time_t_defined: u32 = 1;
pub const __timer_t_defined: u32 = 1;
pub const __BIT_TYPES_DEFINED__: u32 = 1;
pub const _ENDIAN_H: u32 = 1;
pub const _BITS_ENDIAN_H: u32 = 1;
pub const __LITTLE_ENDIAN: u32 = 1234;
pub const __BIG_ENDIAN: u32 = 4321;
pub const __PDP_ENDIAN: u32 = 3412;
pub const _BITS_ENDIANNESS_H: u32 = 1;
pub const __BYTE_ORDER: u32 = 1234;
pub const __FLOAT_WORD_ORDER: u32 = 1234;
pub const LITTLE_ENDIAN: u32 = 1234;
pub const BIG_ENDIAN: u32 = 4321;
pub const PDP_ENDIAN: u32 = 3412;
pub const BYTE_ORDER: u32 = 1234;
pub const _BITS_BYTESWAP_H: u32 = 1;
pub const _BITS_UINTN_IDENTITY_H: u32 = 1;
pub const _SYS_SELECT_H: u32 = 1;
pub const __FD_ZERO_STOS: &[u8; 6usize] = b"stosq\0";
pub const __sigset_t_defined: u32 = 1;
pub const __timeval_defined: u32 = 1;
pub const _STRUCT_TIMESPEC: u32 = 1;
pub const FD_SETSIZE: u32 = 1024;
pub const _BITS_PTHREADTYPES_COMMON_H: u32 = 1;
pub const _THREAD_SHARED_TYPES_H: u32 = 1;
pub const _BITS_PTHREADTYPES_ARCH_H: u32 = 1;
pub const __SIZEOF_PTHREAD_MUTEX_T: u32 = 40;
pub const __SIZEOF_PTHREAD_ATTR_T: u32 = 56;
pub const __SIZEOF_PTHREAD_RWLOCK_T: u32 = 56;
pub const __SIZEOF_PTHREAD_BARRIER_T: u32 = 32;
pub const __SIZEOF_PTHREAD_MUTEXATTR_T: u32 = 4;
pub const __SIZEOF_PTHREAD_COND_T: u32 = 48;
pub const __SIZEOF_PTHREAD_CONDATTR_T: u32 = 4;
pub const __SIZEOF_PTHREAD_RWLOCKATTR_T: u32 = 8;
pub const __SIZEOF_PTHREAD_BARRIERATTR_T: u32 = 4;
pub const _THREAD_MUTEX_INTERNAL_H: u32 = 1;
pub const __PTHREAD_MUTEX_HAVE_PREV: u32 = 1;
pub const __have_pthread_attr_t: u32 = 1;
pub const _ALLOCA_H: u32 = 1;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Bool {
    pub data: bool,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Bool() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Bool>(),
        1usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Bool))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Bool>(),
        1usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Bool))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Bool>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Bool),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Bool__Sequence {
    pub data: *mut std_msgs__msg__Bool,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Bool__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Bool__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Bool__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Bool__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Bool__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Bool__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Bool__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Bool__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Bool__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Bool__Sequence>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Bool__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub type idtype_t = ::std::os::raw::c_uint;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(
        __pwcs: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcstombs(
        __s: *mut ::std::os::raw::c_char,
        __pwcs: *const wchar_t,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Initialize msg/Bool message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Bool"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Bool__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__init(msg: *mut std_msgs__msg__Bool) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Bool message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__fini(msg: *mut std_msgs__msg__Bool);
}
extern "C" {
    #[doc = " Create msg/Bool message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Bool__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__create() -> *mut std_msgs__msg__Bool;
}
extern "C" {
    #[doc = " Destroy msg/Bool message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Bool__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__destroy(msg: *mut std_msgs__msg__Bool);
}
extern "C" {
    #[doc = " Check for msg/Bool message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__are_equal(
        lhs: *const std_msgs__msg__Bool,
        rhs: *const std_msgs__msg__Bool,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Bool message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__copy(
        input: *const std_msgs__msg__Bool,
        output: *mut std_msgs__msg__Bool,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Bool messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Bool__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__Sequence__init(
        array: *mut std_msgs__msg__Bool__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Bool messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Bool__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__Sequence__fini(array: *mut std_msgs__msg__Bool__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Bool messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Bool__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Bool__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Bool messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Bool__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__Sequence__destroy(array: *mut std_msgs__msg__Bool__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Bool message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__Sequence__are_equal(
        lhs: *const std_msgs__msg__Bool__Sequence,
        rhs: *const std_msgs__msg__Bool__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Bool messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Bool__Sequence__copy(
        input: *const std_msgs__msg__Bool__Sequence,
        output: *mut std_msgs__msg__Bool__Sequence,
    ) -> bool;
}
pub type rosidl_message_typesupport_handle_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_message_type_support_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const rosidl_message_type_support_t,
>;
#[doc = " Contains rosidl message type support data"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
struct rosidl_message_type_support_t_ {
    #[doc = " String identifier for the type_support."]
    pub typesupport_identifier: *const ::std::os::raw::c_char,
    #[doc = " Pointer to the message type support library"]
    pub data: *const ::std::os::raw::c_void,
    #[doc = " Pointer to the message type support handler function"]
    pub func: rosidl_message_typesupport_handle_function,
}
#[test]
fn bindgen_test_layout_rosidl_message_type_support_t() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_message_type_support_t>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_message_type_support_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_message_type_support_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rosidl_message_type_support_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_message_type_support_t>())).typesupport_identifier
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_message_type_support_t),
            "::",
            stringify!(typesupport_identifier)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_message_type_support_t>())).data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_message_type_support_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_message_type_support_t>())).func as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_message_type_support_t),
            "::",
            stringify!(func)
        )
    );
}
extern "C" {
    #[doc = " Get the message type support handle specific to this identifier."]
    #[doc = "**"]
    #[doc = "* The handle's message typesupport identifier function is returned or if the parameters are NULL"]
    #[doc = "* then an assert will happen."]
    #[doc = "*"]
    #[doc = "* \\param handle Handle to message type support"]
    #[doc = "* \\param identifier The typesupport identifier to get the handle function for"]
    #[doc = "* \\return The associated message typesupport handle function."]
    #[doc = "*/"]
    pub fn get_message_typesupport_handle(
        handle: *const rosidl_message_type_support_t,
        identifier: *const ::std::os::raw::c_char,
    ) -> *const rosidl_message_type_support_t;
}
extern "C" {
    #[doc = " If the identifier is the same as this handle's typesupport_identifier the handle is simply"]
    #[doc = " returned or if the parameters are NULL then an assert will happen."]
    #[doc = ""]
    #[doc = " \\param handle Handle to message type support"]
    #[doc = " \\param identifier The typesupport identifier to get the handle function for"]
    #[doc = " \\return if the identifier match's the handle's identifier then the handle's function"]
    #[doc = "   is returned."]
    pub fn get_message_typesupport_handle_function(
        handle: *const rosidl_message_type_support_t,
        identifier: *const ::std::os::raw::c_char,
    ) -> *const rosidl_message_type_support_t;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Bool(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Byte {
    pub data: u8,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Byte() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Byte>(),
        1usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Byte))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Byte>(),
        1usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Byte))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Byte>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Byte),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Byte__Sequence {
    pub data: *mut std_msgs__msg__Byte,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Byte__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Byte__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Byte__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Byte__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Byte__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Byte__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Byte__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Byte__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Byte__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Byte__Sequence>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Byte__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Byte message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Byte"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Byte__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__init(msg: *mut std_msgs__msg__Byte) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Byte message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__fini(msg: *mut std_msgs__msg__Byte);
}
extern "C" {
    #[doc = " Create msg/Byte message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Byte__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__create() -> *mut std_msgs__msg__Byte;
}
extern "C" {
    #[doc = " Destroy msg/Byte message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Byte__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__destroy(msg: *mut std_msgs__msg__Byte);
}
extern "C" {
    #[doc = " Check for msg/Byte message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__are_equal(
        lhs: *const std_msgs__msg__Byte,
        rhs: *const std_msgs__msg__Byte,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Byte message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__copy(
        input: *const std_msgs__msg__Byte,
        output: *mut std_msgs__msg__Byte,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Byte messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Byte__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__Sequence__init(
        array: *mut std_msgs__msg__Byte__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Byte messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Byte__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__Sequence__fini(array: *mut std_msgs__msg__Byte__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Byte messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Byte__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Byte__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Byte messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Byte__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__Sequence__destroy(array: *mut std_msgs__msg__Byte__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Byte message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__Sequence__are_equal(
        lhs: *const std_msgs__msg__Byte__Sequence,
        rhs: *const std_msgs__msg__Byte__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Byte messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Byte__Sequence__copy(
        input: *const std_msgs__msg__Byte__Sequence,
        output: *mut std_msgs__msg__Byte__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Byte(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__float__Sequence {
    pub data: *mut f32,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__float__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__float__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__float__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__float__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__float__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__float__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__float__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__float__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__float__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__float__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__float__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__double__Sequence {
    pub data: *mut f64,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__double__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__double__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__double__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__double__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__double__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__double__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__double__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__double__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__double__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__double__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__double__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__long_double__Sequence {
    pub data: *mut u128,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__long_double__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__long_double__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(rosidl_runtime_c__long_double__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__long_double__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__long_double__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__long_double__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__long_double__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__long_double__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__long_double__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__long_double__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__long_double__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__char__Sequence {
    pub data: *mut ::std::os::raw::c_schar,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__char__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__char__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__char__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__char__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__char__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__char__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__char__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__char__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__char__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__char__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__char__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__wchar__Sequence {
    pub data: *mut u16,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__wchar__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__wchar__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__wchar__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__wchar__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__wchar__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__wchar__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__wchar__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__wchar__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__wchar__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__wchar__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__wchar__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__boolean__Sequence {
    pub data: *mut bool,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__boolean__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__boolean__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__boolean__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__boolean__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__boolean__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__boolean__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__boolean__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__boolean__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__boolean__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__boolean__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__boolean__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__octet__Sequence {
    pub data: *mut u8,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__octet__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__octet__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__octet__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__octet__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__octet__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__octet__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__octet__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__octet__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__octet__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__octet__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__octet__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__uint8__Sequence {
    pub data: *mut u8,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__uint8__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__uint8__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__uint8__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__uint8__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__uint8__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint8__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint8__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint8__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint8__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint8__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint8__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__int8__Sequence {
    pub data: *mut i8,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__int8__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__int8__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__int8__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__int8__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__int8__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int8__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int8__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int8__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int8__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int8__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int8__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__uint16__Sequence {
    pub data: *mut u16,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__uint16__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__uint16__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__uint16__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__uint16__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__uint16__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint16__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint16__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint16__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint16__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint16__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint16__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__int16__Sequence {
    pub data: *mut i16,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__int16__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__int16__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__int16__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__int16__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__int16__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int16__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int16__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int16__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int16__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int16__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int16__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__uint32__Sequence {
    pub data: *mut u32,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__uint32__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__uint32__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__uint32__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__uint32__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__uint32__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint32__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint32__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint32__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint32__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint32__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint32__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__int32__Sequence {
    pub data: *mut i32,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__int32__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__int32__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__int32__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__int32__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__int32__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int32__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int32__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int32__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int32__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int32__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int32__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__uint64__Sequence {
    pub data: *mut u64,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__uint64__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__uint64__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__uint64__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__uint64__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__uint64__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint64__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint64__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint64__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint64__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__uint64__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__uint64__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__int64__Sequence {
    pub data: *mut i64,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__int64__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__int64__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__int64__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__int64__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__int64__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int64__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int64__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int64__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int64__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__int64__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__int64__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
pub type rosidl_runtime_c__bool__Sequence = rosidl_runtime_c__boolean__Sequence;
pub type rosidl_runtime_c__byte__Sequence = rosidl_runtime_c__octet__Sequence;
pub type rosidl_runtime_c__float32__Sequence = rosidl_runtime_c__float__Sequence;
pub type rosidl_runtime_c__float64__Sequence = rosidl_runtime_c__double__Sequence;
#[doc = " An array of 8-bit characters terminated by a null byte."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__String {
    #[doc = " The pointer to the first character, the sequence ends with a null byte."]
    pub data: *mut ::std::os::raw::c_char,
    #[doc = " The length of the string (excluding the null byte)."]
    pub size: size_t,
    #[doc = " The capacity represents the number of allocated bytes (including the null byte)."]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__String() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__String>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__String))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__String>(),
        8usize,
        concat!("Alignment of ", stringify!(rosidl_runtime_c__String))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rosidl_runtime_c__String>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__String),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rosidl_runtime_c__String>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__String),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__String>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__String),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_runtime_c__String__Sequence {
    pub data: *mut rosidl_runtime_c__String,
    pub size: size_t,
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_rosidl_runtime_c__String__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<rosidl_runtime_c__String__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(rosidl_runtime_c__String__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<rosidl_runtime_c__String__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(rosidl_runtime_c__String__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__String__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__String__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__String__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__String__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rosidl_runtime_c__String__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rosidl_runtime_c__String__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__MultiArrayDimension {
    pub label: rosidl_runtime_c__String,
    pub size: u32,
    pub stride: u32,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__MultiArrayDimension() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__MultiArrayDimension>(),
        32usize,
        concat!("Size of: ", stringify!(std_msgs__msg__MultiArrayDimension))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__MultiArrayDimension>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__MultiArrayDimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayDimension>())).label as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayDimension),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayDimension>())).size as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayDimension),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayDimension>())).stride as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayDimension),
            "::",
            stringify!(stride)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__MultiArrayDimension__Sequence {
    pub data: *mut std_msgs__msg__MultiArrayDimension,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__MultiArrayDimension__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__MultiArrayDimension__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__MultiArrayDimension__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__MultiArrayDimension__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__MultiArrayDimension__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayDimension__Sequence>())).data
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayDimension__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayDimension__Sequence>())).size
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayDimension__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayDimension__Sequence>())).capacity
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayDimension__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__MultiArrayLayout {
    pub dim: std_msgs__msg__MultiArrayDimension__Sequence,
    pub data_offset: u32,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__MultiArrayLayout() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__MultiArrayLayout>(),
        32usize,
        concat!("Size of: ", stringify!(std_msgs__msg__MultiArrayLayout))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__MultiArrayLayout>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__MultiArrayLayout))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayLayout>())).dim as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayLayout),
            "::",
            stringify!(dim)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayLayout>())).data_offset as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayLayout),
            "::",
            stringify!(data_offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__MultiArrayLayout__Sequence {
    pub data: *mut std_msgs__msg__MultiArrayLayout,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__MultiArrayLayout__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__MultiArrayLayout__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__MultiArrayLayout__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__MultiArrayLayout__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__MultiArrayLayout__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayLayout__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayLayout__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayLayout__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayLayout__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__MultiArrayLayout__Sequence>())).capacity
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__MultiArrayLayout__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__ByteMultiArray {
    pub layout: std_msgs__msg__MultiArrayLayout,
    pub data: rosidl_runtime_c__octet__Sequence,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__ByteMultiArray() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__ByteMultiArray>(),
        56usize,
        concat!("Size of: ", stringify!(std_msgs__msg__ByteMultiArray))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__ByteMultiArray>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__ByteMultiArray))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__ByteMultiArray>())).layout as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ByteMultiArray),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__ByteMultiArray>())).data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ByteMultiArray),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__ByteMultiArray__Sequence {
    pub data: *mut std_msgs__msg__ByteMultiArray,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__ByteMultiArray__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__ByteMultiArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__ByteMultiArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__ByteMultiArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__ByteMultiArray__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__ByteMultiArray__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ByteMultiArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__ByteMultiArray__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ByteMultiArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__ByteMultiArray__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ByteMultiArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/ByteMultiArray message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__ByteMultiArray"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__ByteMultiArray__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__init(msg: *mut std_msgs__msg__ByteMultiArray) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/ByteMultiArray message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__fini(msg: *mut std_msgs__msg__ByteMultiArray);
}
extern "C" {
    #[doc = " Create msg/ByteMultiArray message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__ByteMultiArray__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__create() -> *mut std_msgs__msg__ByteMultiArray;
}
extern "C" {
    #[doc = " Destroy msg/ByteMultiArray message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__ByteMultiArray__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__destroy(msg: *mut std_msgs__msg__ByteMultiArray);
}
extern "C" {
    #[doc = " Check for msg/ByteMultiArray message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__are_equal(
        lhs: *const std_msgs__msg__ByteMultiArray,
        rhs: *const std_msgs__msg__ByteMultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/ByteMultiArray message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__copy(
        input: *const std_msgs__msg__ByteMultiArray,
        output: *mut std_msgs__msg__ByteMultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/ByteMultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__ByteMultiArray__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__Sequence__init(
        array: *mut std_msgs__msg__ByteMultiArray__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/ByteMultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__ByteMultiArray__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__Sequence__fini(
        array: *mut std_msgs__msg__ByteMultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Create array of msg/ByteMultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__ByteMultiArray__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__ByteMultiArray__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/ByteMultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__ByteMultiArray__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__Sequence__destroy(
        array: *mut std_msgs__msg__ByteMultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Check for msg/ByteMultiArray message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__Sequence__are_equal(
        lhs: *const std_msgs__msg__ByteMultiArray__Sequence,
        rhs: *const std_msgs__msg__ByteMultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/ByteMultiArray messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ByteMultiArray__Sequence__copy(
        input: *const std_msgs__msg__ByteMultiArray__Sequence,
        output: *mut std_msgs__msg__ByteMultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__ByteMultiArray(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Char {
    pub data: u8,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Char() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Char>(),
        1usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Char))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Char>(),
        1usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Char))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Char>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Char),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Char__Sequence {
    pub data: *mut std_msgs__msg__Char,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Char__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Char__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Char__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Char__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Char__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Char__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Char__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Char__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Char__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Char__Sequence>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Char__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Char message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Char"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Char__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__init(msg: *mut std_msgs__msg__Char) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Char message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__fini(msg: *mut std_msgs__msg__Char);
}
extern "C" {
    #[doc = " Create msg/Char message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Char__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__create() -> *mut std_msgs__msg__Char;
}
extern "C" {
    #[doc = " Destroy msg/Char message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Char__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__destroy(msg: *mut std_msgs__msg__Char);
}
extern "C" {
    #[doc = " Check for msg/Char message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__are_equal(
        lhs: *const std_msgs__msg__Char,
        rhs: *const std_msgs__msg__Char,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Char message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__copy(
        input: *const std_msgs__msg__Char,
        output: *mut std_msgs__msg__Char,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Char messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Char__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__Sequence__init(
        array: *mut std_msgs__msg__Char__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Char messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Char__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__Sequence__fini(array: *mut std_msgs__msg__Char__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Char messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Char__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Char__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Char messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Char__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__Sequence__destroy(array: *mut std_msgs__msg__Char__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Char message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__Sequence__are_equal(
        lhs: *const std_msgs__msg__Char__Sequence,
        rhs: *const std_msgs__msg__Char__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Char messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Char__Sequence__copy(
        input: *const std_msgs__msg__Char__Sequence,
        output: *mut std_msgs__msg__Char__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Char(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__ColorRGBA {
    pub r: f32,
    pub g: f32,
    pub b: f32,
    pub a: f32,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__ColorRGBA() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__ColorRGBA>(),
        16usize,
        concat!("Size of: ", stringify!(std_msgs__msg__ColorRGBA))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__ColorRGBA>(),
        4usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__ColorRGBA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__ColorRGBA>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ColorRGBA),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__ColorRGBA>())).g as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ColorRGBA),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__ColorRGBA>())).b as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ColorRGBA),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__ColorRGBA>())).a as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ColorRGBA),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__ColorRGBA__Sequence {
    pub data: *mut std_msgs__msg__ColorRGBA,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__ColorRGBA__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__ColorRGBA__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__ColorRGBA__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__ColorRGBA__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__ColorRGBA__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__ColorRGBA__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ColorRGBA__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__ColorRGBA__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ColorRGBA__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__ColorRGBA__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__ColorRGBA__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/ColorRGBA message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__ColorRGBA"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__ColorRGBA__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__init(msg: *mut std_msgs__msg__ColorRGBA) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/ColorRGBA message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__fini(msg: *mut std_msgs__msg__ColorRGBA);
}
extern "C" {
    #[doc = " Create msg/ColorRGBA message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__ColorRGBA__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__create() -> *mut std_msgs__msg__ColorRGBA;
}
extern "C" {
    #[doc = " Destroy msg/ColorRGBA message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__ColorRGBA__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__destroy(msg: *mut std_msgs__msg__ColorRGBA);
}
extern "C" {
    #[doc = " Check for msg/ColorRGBA message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__are_equal(
        lhs: *const std_msgs__msg__ColorRGBA,
        rhs: *const std_msgs__msg__ColorRGBA,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/ColorRGBA message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__copy(
        input: *const std_msgs__msg__ColorRGBA,
        output: *mut std_msgs__msg__ColorRGBA,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/ColorRGBA messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__ColorRGBA__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__Sequence__init(
        array: *mut std_msgs__msg__ColorRGBA__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/ColorRGBA messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__ColorRGBA__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__Sequence__fini(array: *mut std_msgs__msg__ColorRGBA__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/ColorRGBA messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__ColorRGBA__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__ColorRGBA__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/ColorRGBA messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__ColorRGBA__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__Sequence__destroy(
        array: *mut std_msgs__msg__ColorRGBA__Sequence,
    );
}
extern "C" {
    #[doc = " Check for msg/ColorRGBA message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__Sequence__are_equal(
        lhs: *const std_msgs__msg__ColorRGBA__Sequence,
        rhs: *const std_msgs__msg__ColorRGBA__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/ColorRGBA messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__ColorRGBA__Sequence__copy(
        input: *const std_msgs__msg__ColorRGBA__Sequence,
        output: *mut std_msgs__msg__ColorRGBA__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__ColorRGBA(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Empty {
    pub structure_needs_at_least_one_member: u8,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Empty() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Empty>(),
        1usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Empty))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Empty>(),
        1usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Empty))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Empty>())).structure_needs_at_least_one_member
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Empty),
            "::",
            stringify!(structure_needs_at_least_one_member)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Empty__Sequence {
    pub data: *mut std_msgs__msg__Empty,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Empty__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Empty__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Empty__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Empty__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Empty__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Empty__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Empty__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Empty__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Empty__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Empty__Sequence>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Empty__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Empty message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Empty"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Empty__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__init(msg: *mut std_msgs__msg__Empty) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Empty message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__fini(msg: *mut std_msgs__msg__Empty);
}
extern "C" {
    #[doc = " Create msg/Empty message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Empty__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__create() -> *mut std_msgs__msg__Empty;
}
extern "C" {
    #[doc = " Destroy msg/Empty message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Empty__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__destroy(msg: *mut std_msgs__msg__Empty);
}
extern "C" {
    #[doc = " Check for msg/Empty message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__are_equal(
        lhs: *const std_msgs__msg__Empty,
        rhs: *const std_msgs__msg__Empty,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Empty message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__copy(
        input: *const std_msgs__msg__Empty,
        output: *mut std_msgs__msg__Empty,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Empty messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Empty__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__Sequence__init(
        array: *mut std_msgs__msg__Empty__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Empty messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Empty__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__Sequence__fini(array: *mut std_msgs__msg__Empty__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Empty messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Empty__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Empty__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Empty messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Empty__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__Sequence__destroy(array: *mut std_msgs__msg__Empty__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Empty message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__Sequence__are_equal(
        lhs: *const std_msgs__msg__Empty__Sequence,
        rhs: *const std_msgs__msg__Empty__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Empty messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Empty__Sequence__copy(
        input: *const std_msgs__msg__Empty__Sequence,
        output: *mut std_msgs__msg__Empty__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Empty(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Float32 {
    pub data: f32,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Float32() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Float32>(),
        4usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Float32))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Float32>(),
        4usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Float32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Float32>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Float32__Sequence {
    pub data: *mut std_msgs__msg__Float32,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Float32__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Float32__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Float32__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Float32__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Float32__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float32__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float32__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float32__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Float32 message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Float32"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Float32__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__init(msg: *mut std_msgs__msg__Float32) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Float32 message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__fini(msg: *mut std_msgs__msg__Float32);
}
extern "C" {
    #[doc = " Create msg/Float32 message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Float32__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__create() -> *mut std_msgs__msg__Float32;
}
extern "C" {
    #[doc = " Destroy msg/Float32 message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float32__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__destroy(msg: *mut std_msgs__msg__Float32);
}
extern "C" {
    #[doc = " Check for msg/Float32 message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__are_equal(
        lhs: *const std_msgs__msg__Float32,
        rhs: *const std_msgs__msg__Float32,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Float32 message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__copy(
        input: *const std_msgs__msg__Float32,
        output: *mut std_msgs__msg__Float32,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Float32 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Float32__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__Sequence__init(
        array: *mut std_msgs__msg__Float32__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Float32 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float32__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__Sequence__fini(array: *mut std_msgs__msg__Float32__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Float32 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Float32__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Float32__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Float32 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float32__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__Sequence__destroy(array: *mut std_msgs__msg__Float32__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Float32 message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__Sequence__are_equal(
        lhs: *const std_msgs__msg__Float32__Sequence,
        rhs: *const std_msgs__msg__Float32__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Float32 messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32__Sequence__copy(
        input: *const std_msgs__msg__Float32__Sequence,
        output: *mut std_msgs__msg__Float32__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Float32(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Float32MultiArray {
    pub layout: std_msgs__msg__MultiArrayLayout,
    pub data: rosidl_runtime_c__float__Sequence,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Float32MultiArray() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Float32MultiArray>(),
        56usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Float32MultiArray))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Float32MultiArray>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Float32MultiArray)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float32MultiArray>())).layout as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32MultiArray),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float32MultiArray>())).data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32MultiArray),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Float32MultiArray__Sequence {
    pub data: *mut std_msgs__msg__Float32MultiArray,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Float32MultiArray__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Float32MultiArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__Float32MultiArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Float32MultiArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Float32MultiArray__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float32MultiArray__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32MultiArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float32MultiArray__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32MultiArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float32MultiArray__Sequence>())).capacity
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float32MultiArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Float32MultiArray message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Float32MultiArray"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Float32MultiArray__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__init(
        msg: *mut std_msgs__msg__Float32MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Float32MultiArray message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__fini(msg: *mut std_msgs__msg__Float32MultiArray);
}
extern "C" {
    #[doc = " Create msg/Float32MultiArray message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Float32MultiArray__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__create() -> *mut std_msgs__msg__Float32MultiArray;
}
extern "C" {
    #[doc = " Destroy msg/Float32MultiArray message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float32MultiArray__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__destroy(msg: *mut std_msgs__msg__Float32MultiArray);
}
extern "C" {
    #[doc = " Check for msg/Float32MultiArray message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__are_equal(
        lhs: *const std_msgs__msg__Float32MultiArray,
        rhs: *const std_msgs__msg__Float32MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Float32MultiArray message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__copy(
        input: *const std_msgs__msg__Float32MultiArray,
        output: *mut std_msgs__msg__Float32MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Float32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Float32MultiArray__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__Sequence__init(
        array: *mut std_msgs__msg__Float32MultiArray__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Float32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float32MultiArray__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__Sequence__fini(
        array: *mut std_msgs__msg__Float32MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Create array of msg/Float32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Float32MultiArray__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Float32MultiArray__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Float32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float32MultiArray__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__Sequence__destroy(
        array: *mut std_msgs__msg__Float32MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Check for msg/Float32MultiArray message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__Sequence__are_equal(
        lhs: *const std_msgs__msg__Float32MultiArray__Sequence,
        rhs: *const std_msgs__msg__Float32MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Float32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float32MultiArray__Sequence__copy(
        input: *const std_msgs__msg__Float32MultiArray__Sequence,
        output: *mut std_msgs__msg__Float32MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Float32MultiArray(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Float64 {
    pub data: f64,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Float64() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Float64>(),
        8usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Float64))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Float64>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Float64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Float64>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Float64__Sequence {
    pub data: *mut std_msgs__msg__Float64,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Float64__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Float64__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Float64__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Float64__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Float64__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float64__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float64__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float64__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Float64 message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Float64"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Float64__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__init(msg: *mut std_msgs__msg__Float64) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Float64 message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__fini(msg: *mut std_msgs__msg__Float64);
}
extern "C" {
    #[doc = " Create msg/Float64 message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Float64__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__create() -> *mut std_msgs__msg__Float64;
}
extern "C" {
    #[doc = " Destroy msg/Float64 message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float64__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__destroy(msg: *mut std_msgs__msg__Float64);
}
extern "C" {
    #[doc = " Check for msg/Float64 message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__are_equal(
        lhs: *const std_msgs__msg__Float64,
        rhs: *const std_msgs__msg__Float64,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Float64 message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__copy(
        input: *const std_msgs__msg__Float64,
        output: *mut std_msgs__msg__Float64,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Float64 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Float64__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__Sequence__init(
        array: *mut std_msgs__msg__Float64__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Float64 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float64__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__Sequence__fini(array: *mut std_msgs__msg__Float64__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Float64 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Float64__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Float64__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Float64 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float64__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__Sequence__destroy(array: *mut std_msgs__msg__Float64__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Float64 message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__Sequence__are_equal(
        lhs: *const std_msgs__msg__Float64__Sequence,
        rhs: *const std_msgs__msg__Float64__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Float64 messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64__Sequence__copy(
        input: *const std_msgs__msg__Float64__Sequence,
        output: *mut std_msgs__msg__Float64__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Float64(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Float64MultiArray {
    pub layout: std_msgs__msg__MultiArrayLayout,
    pub data: rosidl_runtime_c__double__Sequence,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Float64MultiArray() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Float64MultiArray>(),
        56usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Float64MultiArray))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Float64MultiArray>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Float64MultiArray)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float64MultiArray>())).layout as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64MultiArray),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float64MultiArray>())).data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64MultiArray),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Float64MultiArray__Sequence {
    pub data: *mut std_msgs__msg__Float64MultiArray,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Float64MultiArray__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Float64MultiArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__Float64MultiArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Float64MultiArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Float64MultiArray__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float64MultiArray__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64MultiArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float64MultiArray__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64MultiArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Float64MultiArray__Sequence>())).capacity
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Float64MultiArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Float64MultiArray message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Float64MultiArray"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Float64MultiArray__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__init(
        msg: *mut std_msgs__msg__Float64MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Float64MultiArray message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__fini(msg: *mut std_msgs__msg__Float64MultiArray);
}
extern "C" {
    #[doc = " Create msg/Float64MultiArray message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Float64MultiArray__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__create() -> *mut std_msgs__msg__Float64MultiArray;
}
extern "C" {
    #[doc = " Destroy msg/Float64MultiArray message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float64MultiArray__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__destroy(msg: *mut std_msgs__msg__Float64MultiArray);
}
extern "C" {
    #[doc = " Check for msg/Float64MultiArray message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__are_equal(
        lhs: *const std_msgs__msg__Float64MultiArray,
        rhs: *const std_msgs__msg__Float64MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Float64MultiArray message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__copy(
        input: *const std_msgs__msg__Float64MultiArray,
        output: *mut std_msgs__msg__Float64MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Float64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Float64MultiArray__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__Sequence__init(
        array: *mut std_msgs__msg__Float64MultiArray__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Float64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float64MultiArray__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__Sequence__fini(
        array: *mut std_msgs__msg__Float64MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Create array of msg/Float64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Float64MultiArray__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Float64MultiArray__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Float64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Float64MultiArray__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__Sequence__destroy(
        array: *mut std_msgs__msg__Float64MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Check for msg/Float64MultiArray message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__Sequence__are_equal(
        lhs: *const std_msgs__msg__Float64MultiArray__Sequence,
        rhs: *const std_msgs__msg__Float64MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Float64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Float64MultiArray__Sequence__copy(
        input: *const std_msgs__msg__Float64MultiArray__Sequence,
        output: *mut std_msgs__msg__Float64MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Float64MultiArray(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct builtin_interfaces__msg__Time {
    pub sec: i32,
    pub nanosec: u32,
}
#[test]
fn bindgen_test_layout_builtin_interfaces__msg__Time() {
    assert_eq!(
        ::std::mem::size_of::<builtin_interfaces__msg__Time>(),
        8usize,
        concat!("Size of: ", stringify!(builtin_interfaces__msg__Time))
    );
    assert_eq!(
        ::std::mem::align_of::<builtin_interfaces__msg__Time>(),
        4usize,
        concat!("Alignment of ", stringify!(builtin_interfaces__msg__Time))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<builtin_interfaces__msg__Time>())).sec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<builtin_interfaces__msg__Time>())).nanosec as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time),
            "::",
            stringify!(nanosec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct builtin_interfaces__msg__Time__Sequence {
    pub data: *mut builtin_interfaces__msg__Time,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_builtin_interfaces__msg__Time__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<builtin_interfaces__msg__Time__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(builtin_interfaces__msg__Time__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<builtin_interfaces__msg__Time__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(builtin_interfaces__msg__Time__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<builtin_interfaces__msg__Time__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<builtin_interfaces__msg__Time__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<builtin_interfaces__msg__Time__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(builtin_interfaces__msg__Time__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Header {
    pub stamp: builtin_interfaces__msg__Time,
    pub frame_id: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Header() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Header>(),
        32usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Header))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Header>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Header))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Header>())).stamp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header),
            "::",
            stringify!(stamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Header>())).frame_id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header),
            "::",
            stringify!(frame_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Header__Sequence {
    pub data: *mut std_msgs__msg__Header,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Header__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Header__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Header__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Header__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Header__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Header__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Header__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Header__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Header__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Header message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Header"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Header__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__init(msg: *mut std_msgs__msg__Header) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Header message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__fini(msg: *mut std_msgs__msg__Header);
}
extern "C" {
    #[doc = " Create msg/Header message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Header__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__create() -> *mut std_msgs__msg__Header;
}
extern "C" {
    #[doc = " Destroy msg/Header message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Header__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__destroy(msg: *mut std_msgs__msg__Header);
}
extern "C" {
    #[doc = " Check for msg/Header message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__are_equal(
        lhs: *const std_msgs__msg__Header,
        rhs: *const std_msgs__msg__Header,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Header message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__copy(
        input: *const std_msgs__msg__Header,
        output: *mut std_msgs__msg__Header,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Header messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Header__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__Sequence__init(
        array: *mut std_msgs__msg__Header__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Header messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Header__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__Sequence__fini(array: *mut std_msgs__msg__Header__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Header messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Header__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Header__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Header messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Header__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__Sequence__destroy(array: *mut std_msgs__msg__Header__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Header message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__Sequence__are_equal(
        lhs: *const std_msgs__msg__Header__Sequence,
        rhs: *const std_msgs__msg__Header__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Header messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Header__Sequence__copy(
        input: *const std_msgs__msg__Header__Sequence,
        output: *mut std_msgs__msg__Header__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Header(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int16 {
    pub data: i16,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int16() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int16>(),
        2usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int16))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int16>(),
        2usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Int16>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int16__Sequence {
    pub data: *mut std_msgs__msg__Int16,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int16__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int16__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int16__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int16__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int16__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int16__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int16__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int16__Sequence>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Int16 message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Int16"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Int16__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__init(msg: *mut std_msgs__msg__Int16) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Int16 message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__fini(msg: *mut std_msgs__msg__Int16);
}
extern "C" {
    #[doc = " Create msg/Int16 message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Int16__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__create() -> *mut std_msgs__msg__Int16;
}
extern "C" {
    #[doc = " Destroy msg/Int16 message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int16__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__destroy(msg: *mut std_msgs__msg__Int16);
}
extern "C" {
    #[doc = " Check for msg/Int16 message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__are_equal(
        lhs: *const std_msgs__msg__Int16,
        rhs: *const std_msgs__msg__Int16,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Int16 message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__copy(
        input: *const std_msgs__msg__Int16,
        output: *mut std_msgs__msg__Int16,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Int16 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Int16__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__Sequence__init(
        array: *mut std_msgs__msg__Int16__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Int16 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int16__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__Sequence__fini(array: *mut std_msgs__msg__Int16__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Int16 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Int16__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Int16__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Int16 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int16__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__Sequence__destroy(array: *mut std_msgs__msg__Int16__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Int16 message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__Sequence__are_equal(
        lhs: *const std_msgs__msg__Int16__Sequence,
        rhs: *const std_msgs__msg__Int16__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Int16 messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16__Sequence__copy(
        input: *const std_msgs__msg__Int16__Sequence,
        output: *mut std_msgs__msg__Int16__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Int16(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int16MultiArray {
    pub layout: std_msgs__msg__MultiArrayLayout,
    pub data: rosidl_runtime_c__int16__Sequence,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int16MultiArray() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int16MultiArray>(),
        56usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int16MultiArray))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int16MultiArray>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int16MultiArray))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int16MultiArray>())).layout as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16MultiArray),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int16MultiArray>())).data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16MultiArray),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int16MultiArray__Sequence {
    pub data: *mut std_msgs__msg__Int16MultiArray,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int16MultiArray__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int16MultiArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__Int16MultiArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int16MultiArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Int16MultiArray__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int16MultiArray__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16MultiArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int16MultiArray__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16MultiArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int16MultiArray__Sequence>())).capacity
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int16MultiArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Int16MultiArray message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Int16MultiArray"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Int16MultiArray__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__init(msg: *mut std_msgs__msg__Int16MultiArray) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Int16MultiArray message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__fini(msg: *mut std_msgs__msg__Int16MultiArray);
}
extern "C" {
    #[doc = " Create msg/Int16MultiArray message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Int16MultiArray__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__create() -> *mut std_msgs__msg__Int16MultiArray;
}
extern "C" {
    #[doc = " Destroy msg/Int16MultiArray message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int16MultiArray__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__destroy(msg: *mut std_msgs__msg__Int16MultiArray);
}
extern "C" {
    #[doc = " Check for msg/Int16MultiArray message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__are_equal(
        lhs: *const std_msgs__msg__Int16MultiArray,
        rhs: *const std_msgs__msg__Int16MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Int16MultiArray message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__copy(
        input: *const std_msgs__msg__Int16MultiArray,
        output: *mut std_msgs__msg__Int16MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Int16MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Int16MultiArray__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__Sequence__init(
        array: *mut std_msgs__msg__Int16MultiArray__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Int16MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int16MultiArray__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__Sequence__fini(
        array: *mut std_msgs__msg__Int16MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Create array of msg/Int16MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Int16MultiArray__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Int16MultiArray__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Int16MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int16MultiArray__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__Sequence__destroy(
        array: *mut std_msgs__msg__Int16MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Check for msg/Int16MultiArray message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__Sequence__are_equal(
        lhs: *const std_msgs__msg__Int16MultiArray__Sequence,
        rhs: *const std_msgs__msg__Int16MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Int16MultiArray messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int16MultiArray__Sequence__copy(
        input: *const std_msgs__msg__Int16MultiArray__Sequence,
        output: *mut std_msgs__msg__Int16MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Int16MultiArray(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int32 {
    pub data: i32,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int32() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int32>(),
        4usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int32))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int32>(),
        4usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Int32>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int32__Sequence {
    pub data: *mut std_msgs__msg__Int32,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int32__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int32__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int32__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int32__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int32__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int32__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int32__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int32__Sequence>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Int32 message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Int32"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Int32__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__init(msg: *mut std_msgs__msg__Int32) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Int32 message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__fini(msg: *mut std_msgs__msg__Int32);
}
extern "C" {
    #[doc = " Create msg/Int32 message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Int32__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__create() -> *mut std_msgs__msg__Int32;
}
extern "C" {
    #[doc = " Destroy msg/Int32 message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int32__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__destroy(msg: *mut std_msgs__msg__Int32);
}
extern "C" {
    #[doc = " Check for msg/Int32 message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__are_equal(
        lhs: *const std_msgs__msg__Int32,
        rhs: *const std_msgs__msg__Int32,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Int32 message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__copy(
        input: *const std_msgs__msg__Int32,
        output: *mut std_msgs__msg__Int32,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Int32 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Int32__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__Sequence__init(
        array: *mut std_msgs__msg__Int32__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Int32 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int32__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__Sequence__fini(array: *mut std_msgs__msg__Int32__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Int32 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Int32__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Int32__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Int32 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int32__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__Sequence__destroy(array: *mut std_msgs__msg__Int32__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Int32 message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__Sequence__are_equal(
        lhs: *const std_msgs__msg__Int32__Sequence,
        rhs: *const std_msgs__msg__Int32__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Int32 messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32__Sequence__copy(
        input: *const std_msgs__msg__Int32__Sequence,
        output: *mut std_msgs__msg__Int32__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Int32(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int32MultiArray {
    pub layout: std_msgs__msg__MultiArrayLayout,
    pub data: rosidl_runtime_c__int32__Sequence,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int32MultiArray() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int32MultiArray>(),
        56usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int32MultiArray))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int32MultiArray>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int32MultiArray))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int32MultiArray>())).layout as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32MultiArray),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int32MultiArray>())).data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32MultiArray),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int32MultiArray__Sequence {
    pub data: *mut std_msgs__msg__Int32MultiArray,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int32MultiArray__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int32MultiArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__Int32MultiArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int32MultiArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Int32MultiArray__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int32MultiArray__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32MultiArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int32MultiArray__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32MultiArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int32MultiArray__Sequence>())).capacity
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int32MultiArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Int32MultiArray message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Int32MultiArray"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Int32MultiArray__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__init(msg: *mut std_msgs__msg__Int32MultiArray) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Int32MultiArray message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__fini(msg: *mut std_msgs__msg__Int32MultiArray);
}
extern "C" {
    #[doc = " Create msg/Int32MultiArray message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Int32MultiArray__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__create() -> *mut std_msgs__msg__Int32MultiArray;
}
extern "C" {
    #[doc = " Destroy msg/Int32MultiArray message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int32MultiArray__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__destroy(msg: *mut std_msgs__msg__Int32MultiArray);
}
extern "C" {
    #[doc = " Check for msg/Int32MultiArray message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__are_equal(
        lhs: *const std_msgs__msg__Int32MultiArray,
        rhs: *const std_msgs__msg__Int32MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Int32MultiArray message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__copy(
        input: *const std_msgs__msg__Int32MultiArray,
        output: *mut std_msgs__msg__Int32MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Int32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Int32MultiArray__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__Sequence__init(
        array: *mut std_msgs__msg__Int32MultiArray__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Int32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int32MultiArray__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__Sequence__fini(
        array: *mut std_msgs__msg__Int32MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Create array of msg/Int32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Int32MultiArray__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Int32MultiArray__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Int32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int32MultiArray__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__Sequence__destroy(
        array: *mut std_msgs__msg__Int32MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Check for msg/Int32MultiArray message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__Sequence__are_equal(
        lhs: *const std_msgs__msg__Int32MultiArray__Sequence,
        rhs: *const std_msgs__msg__Int32MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Int32MultiArray messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int32MultiArray__Sequence__copy(
        input: *const std_msgs__msg__Int32MultiArray__Sequence,
        output: *mut std_msgs__msg__Int32MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Int32MultiArray(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int64 {
    pub data: i64,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int64() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int64>(),
        8usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int64))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int64>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Int64>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int64__Sequence {
    pub data: *mut std_msgs__msg__Int64,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int64__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int64__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int64__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int64__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int64__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int64__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int64__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int64__Sequence>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Int64 message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Int64"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Int64__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__init(msg: *mut std_msgs__msg__Int64) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Int64 message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__fini(msg: *mut std_msgs__msg__Int64);
}
extern "C" {
    #[doc = " Create msg/Int64 message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Int64__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__create() -> *mut std_msgs__msg__Int64;
}
extern "C" {
    #[doc = " Destroy msg/Int64 message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int64__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__destroy(msg: *mut std_msgs__msg__Int64);
}
extern "C" {
    #[doc = " Check for msg/Int64 message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__are_equal(
        lhs: *const std_msgs__msg__Int64,
        rhs: *const std_msgs__msg__Int64,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Int64 message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__copy(
        input: *const std_msgs__msg__Int64,
        output: *mut std_msgs__msg__Int64,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Int64 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Int64__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__Sequence__init(
        array: *mut std_msgs__msg__Int64__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Int64 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int64__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__Sequence__fini(array: *mut std_msgs__msg__Int64__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Int64 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Int64__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Int64__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Int64 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int64__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__Sequence__destroy(array: *mut std_msgs__msg__Int64__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Int64 message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__Sequence__are_equal(
        lhs: *const std_msgs__msg__Int64__Sequence,
        rhs: *const std_msgs__msg__Int64__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Int64 messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64__Sequence__copy(
        input: *const std_msgs__msg__Int64__Sequence,
        output: *mut std_msgs__msg__Int64__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Int64(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int64MultiArray {
    pub layout: std_msgs__msg__MultiArrayLayout,
    pub data: rosidl_runtime_c__int64__Sequence,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int64MultiArray() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int64MultiArray>(),
        56usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int64MultiArray))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int64MultiArray>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int64MultiArray))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int64MultiArray>())).layout as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64MultiArray),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int64MultiArray>())).data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64MultiArray),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int64MultiArray__Sequence {
    pub data: *mut std_msgs__msg__Int64MultiArray,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int64MultiArray__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int64MultiArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__Int64MultiArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int64MultiArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Int64MultiArray__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int64MultiArray__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64MultiArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int64MultiArray__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64MultiArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int64MultiArray__Sequence>())).capacity
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int64MultiArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Int64MultiArray message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Int64MultiArray"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Int64MultiArray__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__init(msg: *mut std_msgs__msg__Int64MultiArray) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Int64MultiArray message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__fini(msg: *mut std_msgs__msg__Int64MultiArray);
}
extern "C" {
    #[doc = " Create msg/Int64MultiArray message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Int64MultiArray__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__create() -> *mut std_msgs__msg__Int64MultiArray;
}
extern "C" {
    #[doc = " Destroy msg/Int64MultiArray message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int64MultiArray__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__destroy(msg: *mut std_msgs__msg__Int64MultiArray);
}
extern "C" {
    #[doc = " Check for msg/Int64MultiArray message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__are_equal(
        lhs: *const std_msgs__msg__Int64MultiArray,
        rhs: *const std_msgs__msg__Int64MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Int64MultiArray message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__copy(
        input: *const std_msgs__msg__Int64MultiArray,
        output: *mut std_msgs__msg__Int64MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Int64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Int64MultiArray__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__Sequence__init(
        array: *mut std_msgs__msg__Int64MultiArray__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Int64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int64MultiArray__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__Sequence__fini(
        array: *mut std_msgs__msg__Int64MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Create array of msg/Int64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Int64MultiArray__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Int64MultiArray__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Int64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int64MultiArray__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__Sequence__destroy(
        array: *mut std_msgs__msg__Int64MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Check for msg/Int64MultiArray message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__Sequence__are_equal(
        lhs: *const std_msgs__msg__Int64MultiArray__Sequence,
        rhs: *const std_msgs__msg__Int64MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Int64MultiArray messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int64MultiArray__Sequence__copy(
        input: *const std_msgs__msg__Int64MultiArray__Sequence,
        output: *mut std_msgs__msg__Int64MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Int64MultiArray(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int8 {
    pub data: i8,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int8() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int8>(),
        1usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int8))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int8>(),
        1usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__Int8>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int8__Sequence {
    pub data: *mut std_msgs__msg__Int8,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int8__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int8__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int8__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int8__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int8__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int8__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int8__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int8__Sequence>())).capacity as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Int8 message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Int8"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Int8__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__init(msg: *mut std_msgs__msg__Int8) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Int8 message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__fini(msg: *mut std_msgs__msg__Int8);
}
extern "C" {
    #[doc = " Create msg/Int8 message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Int8__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__create() -> *mut std_msgs__msg__Int8;
}
extern "C" {
    #[doc = " Destroy msg/Int8 message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int8__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__destroy(msg: *mut std_msgs__msg__Int8);
}
extern "C" {
    #[doc = " Check for msg/Int8 message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__are_equal(
        lhs: *const std_msgs__msg__Int8,
        rhs: *const std_msgs__msg__Int8,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Int8 message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__copy(
        input: *const std_msgs__msg__Int8,
        output: *mut std_msgs__msg__Int8,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Int8 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Int8__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__Sequence__init(
        array: *mut std_msgs__msg__Int8__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Int8 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int8__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__Sequence__fini(array: *mut std_msgs__msg__Int8__Sequence);
}
extern "C" {
    #[doc = " Create array of msg/Int8 messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Int8__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Int8__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Int8 messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int8__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__Sequence__destroy(array: *mut std_msgs__msg__Int8__Sequence);
}
extern "C" {
    #[doc = " Check for msg/Int8 message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__Sequence__are_equal(
        lhs: *const std_msgs__msg__Int8__Sequence,
        rhs: *const std_msgs__msg__Int8__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Int8 messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8__Sequence__copy(
        input: *const std_msgs__msg__Int8__Sequence,
        output: *mut std_msgs__msg__Int8__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Int8(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int8MultiArray {
    pub layout: std_msgs__msg__MultiArrayLayout,
    pub data: rosidl_runtime_c__int8__Sequence,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int8MultiArray() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int8MultiArray>(),
        56usize,
        concat!("Size of: ", stringify!(std_msgs__msg__Int8MultiArray))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int8MultiArray>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__Int8MultiArray))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int8MultiArray>())).layout as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8MultiArray),
            "::",
            stringify!(layout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int8MultiArray>())).data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8MultiArray),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__Int8MultiArray__Sequence {
    pub data: *mut std_msgs__msg__Int8MultiArray,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__Int8MultiArray__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__Int8MultiArray__Sequence>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(std_msgs__msg__Int8MultiArray__Sequence)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__Int8MultiArray__Sequence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std_msgs__msg__Int8MultiArray__Sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int8MultiArray__Sequence>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8MultiArray__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int8MultiArray__Sequence>())).size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8MultiArray__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__Int8MultiArray__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__Int8MultiArray__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/Int8MultiArray message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__Int8MultiArray"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__Int8MultiArray__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__init(msg: *mut std_msgs__msg__Int8MultiArray) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/Int8MultiArray message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__fini(msg: *mut std_msgs__msg__Int8MultiArray);
}
extern "C" {
    #[doc = " Create msg/Int8MultiArray message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__Int8MultiArray__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__create() -> *mut std_msgs__msg__Int8MultiArray;
}
extern "C" {
    #[doc = " Destroy msg/Int8MultiArray message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int8MultiArray__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__destroy(msg: *mut std_msgs__msg__Int8MultiArray);
}
extern "C" {
    #[doc = " Check for msg/Int8MultiArray message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__are_equal(
        lhs: *const std_msgs__msg__Int8MultiArray,
        rhs: *const std_msgs__msg__Int8MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/Int8MultiArray message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__copy(
        input: *const std_msgs__msg__Int8MultiArray,
        output: *mut std_msgs__msg__Int8MultiArray,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/Int8MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__Int8MultiArray__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__Sequence__init(
        array: *mut std_msgs__msg__Int8MultiArray__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/Int8MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int8MultiArray__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__Sequence__fini(
        array: *mut std_msgs__msg__Int8MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Create array of msg/Int8MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the array and calls"]
    #[doc = "* std_msgs__msg__Int8MultiArray__Sequence__init()."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return The pointer to the initialized array if successful, otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__Sequence__create(
        size: size_t,
    ) -> *mut std_msgs__msg__Int8MultiArray__Sequence;
}
extern "C" {
    #[doc = " Destroy array of msg/Int8MultiArray messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__Int8MultiArray__Sequence__fini()"]
    #[doc = "* on the array,"]
    #[doc = "* and frees the memory of the array."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__Sequence__destroy(
        array: *mut std_msgs__msg__Int8MultiArray__Sequence,
    );
}
extern "C" {
    #[doc = " Check for msg/Int8MultiArray message array equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message array on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message array on the right hand size of the equality operator."]
    #[doc = "* \\return true if message arrays are equal in size and content, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__Sequence__are_equal(
        lhs: *const std_msgs__msg__Int8MultiArray__Sequence,
        rhs: *const std_msgs__msg__Int8MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy an array of msg/Int8MultiArray messages."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source array pointer."]
    #[doc = "* \\param[out] output The target array pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer"]
    #[doc = "*   is null or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__Int8MultiArray__Sequence__copy(
        input: *const std_msgs__msg__Int8MultiArray__Sequence,
        output: *mut std_msgs__msg__Int8MultiArray__Sequence,
    ) -> bool;
}
extern "C" {
    pub fn rosidl_typesupport_c__get_message_type_support_handle__std_msgs__msg__Int8MultiArray(
    ) -> *const rosidl_message_type_support_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__String {
    pub data: rosidl_runtime_c__String,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__String() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__String>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__String))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__String>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__String))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<std_msgs__msg__String>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__String),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_msgs__msg__String__Sequence {
    pub data: *mut std_msgs__msg__String,
    #[doc = " The number of valid items in data"]
    pub size: size_t,
    #[doc = " The number of allocated items in data"]
    pub capacity: size_t,
}
#[test]
fn bindgen_test_layout_std_msgs__msg__String__Sequence() {
    assert_eq!(
        ::std::mem::size_of::<std_msgs__msg__String__Sequence>(),
        24usize,
        concat!("Size of: ", stringify!(std_msgs__msg__String__Sequence))
    );
    assert_eq!(
        ::std::mem::align_of::<std_msgs__msg__String__Sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(std_msgs__msg__String__Sequence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__String__Sequence>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__String__Sequence),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__String__Sequence>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__String__Sequence),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<std_msgs__msg__String__Sequence>())).capacity as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(std_msgs__msg__String__Sequence),
            "::",
            stringify!(capacity)
        )
    );
}
extern "C" {
    #[doc = " Initialize msg/String message."]
    #[doc = "**"]
    #[doc = "* If the init function is called twice for the same message without"]
    #[doc = "* calling fini inbetween previously allocated memory will be leaked."]
    #[doc = "* \\param[in,out] msg The previously allocated message pointer."]
    #[doc = "* Fields without a default value will not be initialized by this function."]
    #[doc = "* You might want to call memset(msg, 0, sizeof("]
    #[doc = "* std_msgs__msg__String"]
    #[doc = "* )) before or use"]
    #[doc = "* std_msgs__msg__String__create()"]
    #[doc = "* to allocate and initialize the message."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "*/"]
    pub fn std_msgs__msg__String__init(msg: *mut std_msgs__msg__String) -> bool;
}
extern "C" {
    #[doc = " Finalize msg/String message."]
    #[doc = "**"]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__String__fini(msg: *mut std_msgs__msg__String);
}
extern "C" {
    #[doc = " Create msg/String message."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the message, sets the memory to zero, and"]
    #[doc = "* calls"]
    #[doc = "* std_msgs__msg__String__init()."]
    #[doc = "* \\return The pointer to the initialized message if successful,"]
    #[doc = "* otherwise NULL"]
    #[doc = "*/"]
    pub fn std_msgs__msg__String__create() -> *mut std_msgs__msg__String;
}
extern "C" {
    #[doc = " Destroy msg/String message."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__String__fini()"]
    #[doc = "* and frees the memory of the message."]
    #[doc = "* \\param[in,out] msg The allocated message pointer."]
    #[doc = "*/"]
    pub fn std_msgs__msg__String__destroy(msg: *mut std_msgs__msg__String);
}
extern "C" {
    #[doc = " Check for msg/String message equality."]
    #[doc = "**"]
    #[doc = "* \\param[in] lhs The message on the left hand size of the equality operator."]
    #[doc = "* \\param[in] rhs The message on the right hand size of the equality operator."]
    #[doc = "* \\return true if messages are equal, otherwise false."]
    #[doc = "*/"]
    pub fn std_msgs__msg__String__are_equal(
        lhs: *const std_msgs__msg__String,
        rhs: *const std_msgs__msg__String,
    ) -> bool;
}
extern "C" {
    #[doc = " Copy a msg/String message."]
    #[doc = "**"]
    #[doc = "* This functions performs a deep copy, as opposed to the shallow copy that"]
    #[doc = "* plain assignment yields."]
    #[doc = "*"]
    #[doc = "* \\param[in] input The source message pointer."]
    #[doc = "* \\param[out] output The target message pointer, which must"]
    #[doc = "*   have been initialized before calling this function."]
    #[doc = "* \\return true if successful, or false if either pointer is null"]
    #[doc = "*   or memory allocation fails."]
    #[doc = "*/"]
    pub fn std_msgs__msg__String__copy(
        input: *const std_msgs__msg__String,
        output: *mut std_msgs__msg__String,
    ) -> bool;
}
extern "C" {
    #[doc = " Initialize array of msg/String messages."]
    #[doc = "**"]
    #[doc = "* It allocates the memory for the number of elements and calls"]
    #[doc = "* std_msgs__msg__String__init()"]
    #[doc = "* for each element of the array."]
    #[doc = "* \\param[in,out] array The allocated array pointer."]
    #[doc = "* \\param[in] size The size / capacity of the array."]
    #[doc = "* \\return true if initialization was successful, otherwise false"]
    #[doc = "* If the array pointer is valid and the size is zero it is guaranteed"]
    #[doc = "# to return true."]
    #[doc = "*/"]
    pub fn std_msgs__msg__String__Sequence__init(
        array: *mut std_msgs__msg__String__Sequence,
        size: size_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Finalize array of msg/String messages."]
    #[doc = "**"]
    #[doc = "* It calls"]
    #[doc = "* std_msgs__msg__String__fini()"]
    #[doc = "* for each element of the array and frees the memory for the number of"]
    #[doc = "* elements."]
    #[doc = "* \\param[in,out] array The initialized array pointer."]
    #[doc = "*/"]
